  
  // Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
    
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.БезопасныйРежим = Ложь;
    ПараметрыРегистрации.Версия = "1.0";
    ПараметрыРегистрации.Информация = "ХД";
    
	//	
	//НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	//НоваяКоманда.Представление = НСтр("ru = 'Zoho: Уведомление о новом сотруднике'");
	//НоваяКоманда.Идентификатор = "Zoho_УведомлениеОНовомСотруднике";
	//НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	//НоваяКоманда.ПоказыватьОповещение = Истина;  
	
			НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'BirthDay Напоминание о днях рождениях сотрудников'");
    НоваяКоманда.Идентификатор = "BirthDay_НапомнитьОДняхРожденияхСотрудников";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;

	
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Обмен: Уведомление о состоянии обмена каждый час'");
    НоваяКоманда.Идентификатор = "Sync_ИнформацияОСостоянииСинхронизацийКаждыйЧас";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;
	
	
			НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Обмен: Уведомление о состоянии обмена утром'");
    НоваяКоманда.Идентификатор = "Sync_ИнформацияОСостоянииСинхронизацийУтром";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;    
	
	
				НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Запись зарплаты net ежедневно'");
    НоваяКоманда.Идентификатор = "ЗаписьЗарплатыNetЕжедневно";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;    
	
					НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Обновить информацию в SD'");
    НоваяКоманда.Идентификатор = "ОбновитьИнформациювSD";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина; 
	
						НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Уведомление об окончании исполнительного срока'");
    НоваяКоманда.Идентификатор = "Probation_УведомлениеОбОкончанииИспытательногоСрока";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;  

						НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Уведомление о повышении ЗП из оффера'");
    НоваяКоманда.Идентификатор = "OfferSalary_УведомлениеОПовышенииЗПИзОффера";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;

						НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Уведомление о performance bonus из оффера'");
    НоваяКоманда.Идентификатор = "OfferPerformanceBonus_УведомлениеОБонусеИзОффера";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;

						НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Уведомление о sign-on bonus из оффера'");
    НоваяКоманда.Идентификатор = "OfferSignOnBonus_УведомлениеОБонусеИзОффера";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;

							НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Обновить телефоны из SD'");
    НоваяКоманда.Идентификатор = "ПолучитьТелефоныИзSD";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;    
	
								НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Отправить HR Изменение ЗП НДФЛ'");
    НоваяКоманда.Идентификатор = "ОтправитьHRИзменениеЗПНДФЛ";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина; 

									НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Получить ID Из SD'");
    НоваяКоманда.Идентификатор = "ПолучитьIDИзSD";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;    
	
									НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Выполнить выгрузку управленческой штатки'");
    НоваяКоманда.Идентификатор = "ВыполнитьВыгрузкуУправленческойШтатки";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина; 

									НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Мониторинг ошибок ЖР'");
    НоваяКоманда.Идентификатор = "МониторингОшибокЖР";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;


    Возврат ПараметрыРегистрации;
    
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды = Неопределено, ОбъектыНазначения = Неопределено) Экспорт
	
	Попытка
			
		Если ИдентификаторКоманды = "Zoho_УведомлениеОНовомСотруднике" Тогда	
			
			   Zoho_УведомлениеОНовомСотруднике();
			   
		ИначеЕсли ИдентификаторКоманды = "ОтправитьПисьмоHTML" Тогда	   
			   
			   ОтправитьПисьмоHTML(); 
			   
		ИначеЕсли ИдентификаторКоманды = "ЗаполнитьВНовыхСотрудникахОфисиМесто" Тогда
			   
			   ЗаполнитьВНовыхСотрудникахОфисиМесто();
			
		ИначеЕсли ИдентификаторКоманды = "ЗагрузкаУчетнойИнофрмацииПользователя" Тогда
			   
			   ЗагрузкаУчетнойИнофрмацииПользователя(); 
			   
		ИначеЕсли ИдентификаторКоманды = "BirthDay_НапомнитьОДняхРожденияхСотрудников" Тогда	
			
			BirthDay_НапомнитьОДняхРожденияхСотрудников();
			
		ИначеЕсли ИдентификаторКоманды = "Sync_ИнформацияОСостоянииСинхронизацийКаждыйЧас" Тогда	
			
			Sync_ИнформацияОСостоянииСинхронизаций(Истина);
			
		ИначеЕсли ИдентификаторКоманды = "Sync_ИнформацияОСостоянииСинхронизацийУтром" Тогда	
			
			Sync_ИнформацияОСостоянииСинхронизаций(Ложь);		
			
		ИначеЕсли ИдентификаторКоманды = "ЗаписьЗарплатыNetЕжедневно" Тогда	
			
			ЗаписьЗарплатыNetЕжедневно();		
			
		ИначеЕсли ИдентификаторКоманды = "ОбновитьИнформациювSD" Тогда	
			
			ОбновитьИнформациювSD();  
			
		ИначеЕсли ИдентификаторКоманды = "ЗаполняемФизЛицоИзСотрудников" Тогда	
			
			ЗаполняемФизЛицоИзСотрудников();
		
		ИначеЕсли ИдентификаторКоманды = "ПеренестиБонусы" Тогда	
			
			ПеренестиБонусы();
			
		ИначеЕсли ИдентификаторКоманды = "Probation_УведомлениеОбОкончанииИспытательногоСрока" Тогда
			
			Probation_УведомлениеОбОкончанииИспытательногоСрока();	

		ИначеЕсли ИдентификаторКоманды = "OfferSalary_УведомлениеОПовышенииЗПИзОффера" Тогда
			
			OfferSalary_УведомлениеОПовышенииЗПИзОффера();

		ИначеЕсли ИдентификаторКоманды = "OfferPerformanceBonus_УведомлениеОБонусеИзОффера" Тогда
			
			OfferPerformanceBonus_УведомлениеОБонусеИзОффера();

		ИначеЕсли ИдентификаторКоманды = "OfferSignOnBonus_УведомлениеОБонусеИзОффера" Тогда
			
			OfferSignOnBonus_УведомлениеОБонусеИзОффера();
			
		ИначеЕсли ИдентификаторКоманды = "ЗаполнитьЛокациювДолжности" Тогда
			
			ЗаполнитьЛокациювДолжности();	
			
		ИначеЕсли ИдентификаторКоманды = "ЗагрузитьизЭксельТелефоны" Тогда
			
			ЗагрузитьизЭксельТелефоны();    
			
		ИначеЕсли ИдентификаторКоманды = "HREstablishmentExcel" Тогда
	
			HREstablishmentExcel();
			
		ИначеЕсли ИдентификаторКоманды = "ОтправитьHRИзменениеЗПНДФЛ" Тогда	
			
			ОтправитьHRИзменениеЗПНДФЛ();	    
			
		ИначеЕсли ИдентификаторКоманды = "ПолучитьТелефоныИзSD" Тогда		
			
			ПолучитьТелефоныИзSD();       
			
		ИначеЕсли ИдентификаторКоманды = "ВыровнятьМаскуТелефонов" Тогда	
			
			ВыровнятьМаскуТелефонов()   
			
		ИначеЕсли ИдентификаторКоманды = "ПолучитьIDИзSD" Тогда
			
			ПолучитьIDИзSD();
			
		ИначеЕсли ИдентификаторКоманды = "ПосмотретьТаблицаМонитораОбменаДанными" Тогда	
			
			ПосмотретьТаблицаМонитораОбменаДанными();
			
		ИначеЕсли ИдентификаторКоманды = "ВыполнитьПодставлениеФизЛицаВУчетнойИнформации" Тогда 
			
			ВыполнитьПодставлениеФизЛицаВУчетнойИнформации(); 
			
		ИначеЕсли ИдентификаторКоманды = "ЗаполнитьФизЛицоПоИмениВУчИнф" Тогда  
			
			ЗаполнитьФизЛицоПоИмениВУчИнф();     
			
		ИначеЕсли ИдентификаторКоманды = "ВыполнитьСверкуДанных" Тогда  	
			
			ВыполнитьСверкуДанных();
			
		ИначеЕсли  ИдентификаторКоманды = "ВыполнитьВыгрузкуУправленческойШтатки"	Тогда 
			
			ВыполнитьВыгрузкуУправленческойШтатки(); 

		ИначеЕсли ИдентификаторКоманды = "МониторингОшибокЖР" Тогда
			
			МониторингОшибокЖР();
				 
		ИначеЕсли  ИдентификаторКоманды = "ВыполнитьВыгрузкуПосадкиСотрудников"	Тогда		 
			
			ВыполнитьВыгрузкуПосадкиСотрудников();
			
		ИначеЕсли  ИдентификаторКоманды = "ЗаполнитьУчетныеДанныевРСУчетнаяИнформация"	Тогда		 
			
			ЗаполнитьУчетныеДанныевРСУчетнаяИнформация();                                            
			
		ИначеЕсли  ИдентификаторКоманды = "СравнитьТелефоныBBЭксель"	Тогда
			
			СравнитьТелефоныBBЭксель();

		ИначеЕсли ИдентификаторКоманды = "ОбновитьМестаИОфисы" Тогда
			
			ОбновитьМестаИОфисы();

		Иначе
			   
			ВызватьИсключение "Неизвестная команда: " + ИдентификаторКоманды;
			
		КонецЕсли;
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		Тема = "ОХД. Синтаксическая ошибка команды: " + ИдентификаторКоманды;
		
		ТекстПисьма = "Возникли ошибки при выполнении команды: " + ИдентификаторКоманды + " 
		|
		|Описание ошибки: " + ОписаниеОшибки;
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_ОХД_ОповещениеОСинтаксическойОшибке_Получатели", Истина);
		
		
		ПолучателиПисьма = Новый Массив;
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Тема", Тема);
		ПараметрыПисьма.Вставить("Текст", ТекстПисьма);
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты; //ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("CRM_УчетнаяЗаписьЭлектроннойПочты") 
		ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыПисьма.Вставить("ПолучателиПисьма", ПолучателиПисьма);
		ПараметрыПисьма.Вставить("Важность", Перечисления.ВариантыВажностиВзаимодействия.Высокая);
		
		УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
		
	КонецПопытки;
	
КонецПроцедуры   

//Zoho_УведомлениеОНовомСотруднике
Процедура Zoho_УведомлениеОНовомСотруднике()
	
	СобытиеЖР = "ХД.Zoho_УведомлениеОНовомСотруднике";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	сРез = Новый ТаблицаЗначений; 
	
	СтрокаРегламентноеЗадание = "Zoho_УведомлениеОНовомСотруднике";
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли;
	
	//КаталогФайлаКИ = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("КаталогФайлаЗагрузкиБазыКлиентов- selecom.pro");
	
	Zoho_ПроверкаНеОтправленных_Выполнение(СобытиеЖР, сРез);
	
	Zoho_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);
	
	ЗаписатьЗавершениеУведомления(СобытиеЖР, сРез);
	
	//ЗаписатьЗавершениеЗаданияВРегистр("Zoho_УведомлениеОНовомСотруднике");
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
	
КонецПроцедуры  

Процедура ЗаписатьЗавершениеУведомления(СобытиеЖР, сРез)
	
	Для каждого эл Из сРез Цикл
		
		ВыпРас = РегистрыСведений.ВыполнениеРассылки.СоздатьМенеджерЗаписи();
		ВыпРас.Объект = эл.Сотрудник;
		ВыпРас.Прочитать();
		
		Если ЗначениеЗаполнено(ВыпРас.Объект) Тогда
			ВыпРас.Выполнено = Истина;
			Попытка
				ВыпРас.Записать();
			Исключение
				ЗаписьЖР(СобытиеЖР, "Не удалось записать выполнение рассылки", , Истина, ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Zoho_ПроверкаНеОтправленных_Выполнение(СобытиеЖР, сРез)
	
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Офис КАК Офис,
	|	Сотрудники.НомерМеста КАК НомерМеста,
	|	Сотрудники.ГоловнаяОрганизация.Представление КАК Организация,
	|	Сотрудники.СоздатьАккаунт КАК СоздатьАккаунт,
	|	Сотрудники.ОрганизоватьРабочееМесто КАК ОрганизоватьРабочееМесто,
	|	Сотрудники.Пропуск КАК Пропуск,
	|	Сотрудники.МобильныйТелефон КАК МобильныйТелефон
	|ИЗ
	|	РегистрСведений.ВыполнениеРассылки КАК ВыполнениеРассылки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ВыполнениеРассылки.Объект = Сотрудники.Ссылка)
	|ГДЕ
	|	ВыполнениеРассылки.Выполнено = ЛОЖЬ
	|	И Сотрудники.НомерМеста <> ЗНАЧЕНИЕ(Справочник.НомерМеста.ПустаяСсылка)";
	
	сРез = Запрос.Выполнить().Выгрузить(); 
	
КонецПроцедуры

Процедура Zoho_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез)
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
	
	Если сРез.Количество() > 0 Тогда

		Для каждого эл Из сРез Цикл
            Текст ="";      
			
			Текст = Текст + СтрШаблон("Новый сотрудник %1 место, офис %2, номер места %3  
									  |организовать рабочее место %4, создать аккаунт %5, пропуск %6, мобильный телефон %7",
									  эл.Сотрудник, ?(ЗначениеЗаполнено(эл.Офис),эл.Офис, "Нет"), ?(ЗначениеЗаполнено(эл.НомерМеста),эл.НомерМеста, "Нет"),
									  эл.ОрганизоватьРабочееМесто,эл.СоздатьАккаунт, эл.Пропуск, эл.МобильныйТелефон);
			
			
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//ЖурналОбработки = ВыборкаДетальныеЗаписи.ХранилищеДанных.ЖурналОбработки;
			
			//ЗаписьЖР(СобытиеЖР, "Создается исходящее письмо", ЖурналОбработки);
			
			//Если ВыборкаДетальныеЗаписи.Статус = Перечисления.СтатусыДанныхХранилищаДанных.ДанныеВыгруженыБезОшибокТребуетсяОтправкаEmail Тогда
			//	
			//	
			//	Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
			//	Текст = "Ошибок при формировании файлов не обнаружено.
			//	|
			//	|---------------------------------------
			//	|Список тел номеров для ручной корректировки по файлу: "+  нТекст +"
			//	|Журнал формирования файлов заявок: 
			//	|
			//	|" + ВыборкаДетальныеЗаписи.ХранилищеДанных.ЖурналОбработки;
			//	
			//ИначеЕсли ВыборкаДетальныеЗаписи.Статус = Перечисления.СтатусыДанныхХранилищаДанных.ДанныеВыгруженыСОшибкамиТребуетсяОтправкаEmail Тогда 	
			//	
			//	Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
			//	Текст = "Ошибок при формировании файлов не обнаружено.
			//	|
			//	|---------------------------------------
			//	|Список тел номеров для ручной корректировки по файлу: "+  нТекст +"
			//	|Журнал формирования файлов заявок: 
			//	|
			//	|" + ВыборкаДетальныеЗаписи.ХранилищеДанных.ЖурналОбработки;
			
			//	
			//Иначе
			//	
			//	Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая;
			//	Текст = "Возникли ошибки при формировании файлов!
			//	|
			//	|" + ВыборкаДетальныеЗаписи.ХранилищеДанных.ОписаниеОшибки + "
			//	|---------------------------------------
			//	|Журнал формирования файлов заявок: 
			//	|
			//	|" + ВыборкаДетальныеЗаписи.ХранилищеДанных.ЖурналОбработки;
			//	
			//КонецЕсли;   
			
			//УчетнаяЗапись = ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ИИС_УчетнаяЗаписьЭлектроннойПочты");
			ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_НовыхСотрудников", Истина);
			
			//УчетнаяЗапись 		= Неопределено;
			//ПолучателиПисьма    = Новый Массив;
			
			ПараметрыПисьма = Новый Структура;
			ПараметрыПисьма.Вставить("Тема", "ЗУП: Выход нового сотрудника");
			ПараметрыПисьма.Вставить("Текст", Текст);
			//ПараметрыПисьма.Вставить("Важность", Важность);
			ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
			ПараметрыПисьма.Вставить("ПолучателиПисьма",ПолучателиПисьма);
			
			ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);    
			
		КонецЦикла;
	КонецЕсли;
	
	

КонецПроцедуры

///ОтправитьПисьмоHTML

Процедура ОтправитьПисьмоHTML()
	
	СобытиеЖР = "ХД.ОтправитьПисьмоHTML";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	сРез = Новый ТаблицаЗначений; 
	
	СтрокаРегламентноеЗадание = "ОтправитьПисьмоHTML";
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли;
	

	ОтправитьПисьмоHTML_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);
	
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
	
КонецПроцедуры

Процедура ОтправитьПисьмоHTML_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез)
	
	Макет = ПолучитьМакет("ХД_ВыходСотрудника_HTML");
	ТекстHTML = Макет.ПолучитьТекст();   
	ТекстHTML = СтрЗаменить(ТекстHTML, "{1}", "Иванов Иван");   
	
	ТемаПисьма  = "ЗУП: Выход нового сотрудника ";    
	
	ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_ОХД_ОповещениеОСинтаксическойОшибке_Получатели", Истина);
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты; 
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", ТемаПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	ПараметрыПисьма.Вставить("Текст", ТекстHTML);
	ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПисьма.Вставить("ПолучателиПисьма", ПолучателиПисьма);
	//ПараметрыПисьма.Вставить("ПолучателиКопий", ПолучателиКопий);
	//ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);	
	
КонецПроцедуры

//ЗаполнитьВНовыхСотрудникахОфисиМесто


Процедура ЗаполнитьВНовыхСотрудникахОфисиМесто()
	
	СобытиеЖР = "ХД.ЗаполнитьВНовыхСотрудникахОфисиМесто";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	нОстутствуют = Новый Структура; 
	
	СтрокаРегламентноеЗадание = "ЗаполнитьВНовыхСотрудникахОфисиМесто";
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли;
	
	ЗагрузкаДанныхВНовыхСотрудников_Выполнение(СобытиеЖР, нОстутствуют);
	
	//ЗагрузкаИнвойсов_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, нОстутствуют);
	
	//ЗаписатьЗавершениеЗаданияВРегистр("ЗагрузкаБазыКлиентов");
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

	
КонецПроцедуры

Процедура ЗагрузкаДанныхВНовыхСотрудников_Выполнение(СобытиеЖР, нОстутствуют)

	  		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НовыеCотрудники.СотрудникСтрока КАК СотрудникСтрока,
	|	НовыеCотрудники.Сотрудник КАК Сотрудник,
	|	НовыеCотрудники.ДатаВыхода КАК ДатаВыхода,
	|	НовыеCотрудники.Сотрудник.НомерМеста КАК сНомерМеста,
	|	НовыеCотрудники.Сотрудник.Офис КАК сОфис,
	|	НовыеCотрудники.Офис КАК нОфис,
	|	НовыеCотрудники.НомерМеста КАК нНомерМеста
	|ИЗ
	|	РегистрСведений.НовыеCотрудники КАК НовыеCотрудники
	|ГДЕ
	|	НовыеCотрудники.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И (НовыеCотрудники.Сотрудник.Офис <> ЗНАЧЕНИЕ(Справочник.Офисы.ПустаяСсылка)
	|	Или НовыеCотрудники.Сотрудник.НомерМеста <> ЗНАЧЕНИЕ(Справочник.НомерМеста.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыхода";
	
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьРегистрНовыеСотрудники(Выборка)
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРегистрНовыеСотрудники(КЗ)
	
	МЗ = РегистрыСведений.НовыеCотрудники.СоздатьМенеджерЗаписи();
	МЗ.СотрудникСтрока = КЗ.СотрудникСтрока;
	МЗ.Прочитать();    
	//
	Если МЗ.Выбран() Тогда
		
		Если ЗначениеЗаполнено(КЗ.сОфис)  Тогда
			МЗ.Офис 		 	 = КЗ.сОфис;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(КЗ.сНомерМеста)  Тогда
			МЗ.НомерМеста     = КЗ.сНомерМеста;
		КонецЕсли;	
		
	КонецЕсли;
	//МЗ.Записать();

КонецПроцедуры // ЗаполнитьПоРегистру()

// уведомление о неподтянутых сотрудниках

Функция ВыполнитьЗапрос()

	//Текст сформирован автоматически из Управляемая консоль отчетов 3.9.0
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НовыеCотрудники.СотрудникСтрока КАК СотрудникСтрока,
	|	НовыеCотрудники.Сотрудник КАК Сотрудник,
	|	НовыеCотрудники.ДатаВыхода КАК ДатаВыхода
	|ИЗ
	|	РегистрСведений.НовыеCотрудники КАК НовыеCотрудники
	|ГДЕ
	|	НовыеCотрудники.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыхода";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		// Код
	КонецЦикла;

КонецФункции

//ЗагрузкаДоменнойИнформации();
Процедура ЗагрузкаУчетнойИнофрмацииПользователя()
	
	СобытиеЖР = "ХД.УчетнойИнофрмацииПользователя";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	нОстутствуют = Новый Структура; 
	
	СтрокаРегламентноеЗадание = "УчетнойИнофрмацииПользователя";
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли;
	
	//КаталогФайлаКИ = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("КаталогФайлаЗагрузкиБазыКлиентов- selecom.pro");
	
	КаталогФайлаКИ = "C:\temp\Список сотрудников.xlsx";
	
	ЗагрузкаУчетнойИнофрмацииПользователя_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ);
	
	//ЗагрузкаИнвойсов_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, нОстутствуют);
	
	//ЗаписатьЗавершениеЗаданияВРегистр("ЗагрузкаБазыКлиентов");
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура ЗагрузкаУчетнойИнофрмацииПользователя_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ)
	
	мСтруктура = ПодготовитьТаблицуУчетнойИнформации(СобытиеЖР, КаталогФайлаКИ);
	
	Если мСтруктура.Рез <> Неопределено Тогда
		
		//мРез =  ЗагрузитьИнвойсы( СобытиеЖР, мСтруктура.Рез, мСтруктура.нОтсутствуют) 
		
	КонецЕсли;
	
	//нОстутствуют = мРез;//мСтруктура.нОтсутствуют;

КонецПроцедуры  

Функция ПодготовитьТаблицуУчетнойИнформации(СобытиеЖР, КаталогФайлаКИ)
	
	мСтруктура = Новый Структура;
	
	ИмяФайла =  КаталогФайлаКИ;
	
	РезультатПоследнейЗагрузки = Истина;  
	
	СообщениеОбОшибке ="";
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда    
		ЗаписьЖР(СобытиеЖР, "Файл загрузки контактной информации не найден: " + ИмяФайла);
		
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.ДобавитьФайл(ИмяФайла);
	
	ХешСумма = СокрЛП(ХешированиеДанных.ХешСумма);
	мКаталог = СтрРазделить(КаталогФайлаКИ,"\");
	Индекс = мКаталог.Количество();
	мКаталог.Удалить(Индекс-1); 
	КаталогФайлаХэшФайла = СтрСоединить(мКаталог, "\");
	ИмяФайлаХэш = КаталогФайлаХэшФайла + "\dbCLNT_CHNL_hash.txt";
	ФайлХ = Новый Файл(ИмяФайлаХэш);
	Если ФайлХ.Существует() Тогда
		ПредыдущийХеш = "";
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяФайлаХэш);
		Если ТекстовыйДокумент.КоличествоСтрок() > 0 Тогда
			ПредыдущийХеш = СокрЛП(ТекстовыйДокумент.ПолучитьСтроку(1));
		КонецЕсли;
		ТекстовыйДокумент = Неопределено;
		Если ПредыдущийХеш = ХешСумма Тогда // старый файл - перезаливать не нужно
			ЗаписьЖР(СобытиеЖР, "В каталоге обнаружен старый файл загрузки контактной информации. Загрузка КИ не производилась!" + ИмяФайла);
			
			мСтруктура.Вставить("Рез",Неопределено);
			//Возврат мСтруктура;
		КонецЕсли;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла); 
	    
	//мРез = o_EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);

	мРез = EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);
	Если мРез = Неопределено  Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;  
	
	//СправочникОбъект = Справочники.ХранилищеДанных.СоздатьЭлемент(); 
	//СправочникОбъект.ОбменДанными.Загрузка = Истина;
	//СправочникОбъект.Дата = ТекущаяДата();
	////СправочникОбъект.Тип = Перечисления.ТипыДанныхХранилищаДанных.ИсходящиеДанные;
	////СправочникОбъект.Вид = Перечисления.ВидыДанныхХранилищаДанных.ЗПИФ_ОбновлениеКИдляОФД;
	//СправочникОбъект.УстановитьНовыйКод();
	//СправочникОбъект.Записать();
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);  
	
	ИмяФайлаБезРасширения = СтрЗаменить(ИмяФайла,".xls","");  
	РасширениеБезТочки =   СтрЗаменить(Файл.Расширение,".","");
	
	//ДобавитьПрисоединенныйФайл(СправочникОбъект.Ссылка, ИмяФайлаБезРасширения, РасширениеБезТочки, ИмяФайла);

	тРез = мРез[1].Скопировать();   
	тРез.Очистить();
	тРез.Свернуть("Type1,Counterparty,InternalNumber,InvoiceNumber");
	
	нОтсутствуют = тРез.Скопировать();   
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КСИНН = Новый КвалификаторыСтроки(50);
	КСКПП = Новый КвалификаторыСтроки(9);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	ОписаниеТиповД = Новый ОписаниеТипов(Массив, , );
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСИНН = Новый ОписаниеТипов(Массив, , ,КСИНН);
    Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСКПП = Новый ОписаниеТипов(Массив, , ,КСКПП);
	
	
	нОтсутствуют.Колонки.Добавить("Номер",ОписаниеТиповСИНН);
	нОтсутствуют.Колонки.Добавить("Дата",ОписаниеТиповД);
	нОтсутствуют.Колонки.Добавить("IssueDate",ОписаниеТиповД);
	нОтсутствуют.Колонки.Добавить("СуммаДокумента",ОписаниеТиповЧ);
	
	тРез.Колонки.Добавить("AmountInInvoiceCurrency",ОписаниеТиповЧ);  
	тРез.Колонки.Добавить("IssueDate",ОписаниеТиповД);
	тРез.Колонки.Добавить("ИНН", ОписаниеТиповСИНН);
	тРез.Колонки.Добавить("КПП", ОписаниеТиповСКПП);
	
	//Рез = ПодготовитьИнвойсы(мРез[1],тРез);
	
	СообщениеОбОшибке = Символы.ПС + "Загрузка успешна!";
	//ТекстовыйДокумент = Новый ТекстовыйДокумент;
	//ТекстовыйДокумент.ДобавитьСтроку(ХешСумма);
	//ТекстовыйДокумент.ДобавитьСтроку(СообщениеОбОшибке);
	//ТекстовыйДокумент.Записать(ИмяФайлаХэш);
	
	//мСтруктура.Вставить("Рез",Рез);
	мСтруктура.Вставить("нОтсутствуют", нОтсутствуют);
	//мСтруктура.Вставить("СправочникОбъект",СправочникОбъект);
	Возврат мСтруктура;
	
КонецФункции // ПодготовитьТаблицуКИ()

 //Sync_ИнформацияОСостоянииСинхронизаций
Процедура Sync_ИнформацияОСостоянииСинхронизаций(ТолькоОшибки)
	
	СобытиеЖР = "ХД.Sync_ИнформацияОСостоянииСинхронизаций";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "Sync_ИнформацияОСостоянииСинхронизаций";
	
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли; 
		
	сРез = Sync_СостояниеОбмена(СобытиеЖР, ТолькоОшибки); 
	
	Sync_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");	
	
КонецПроцедуры	

Функция Sync_СостояниеОбмена(СобытиеЖР, ТолькоОшибки)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СостоянияОбменовДанными.УзелИнформационнойБазы КАК Узел,
	               |	СостоянияОбменовДанными.ДействиеПриОбмене КАК Действие,
	               |	СостоянияОбменовДанными.РезультатВыполненияОбмена КАК Состояние,
	               |	СостоянияОбменовДанными.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.СостоянияОбменовДанными КАК СостоянияОбменовДанными
	               |#Условие
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Узел";
	 		 
		 Состояние_Ошибки = Новый Массив;
		 Состояние_Ошибки.Добавить(Перечисления.РезультатыВыполненияОбмена.Ошибка);
		 Состояние_Ошибки.Добавить(Перечисления.РезультатыВыполненияОбмена.Ошибка_ТранспортСообщения); 
		 
		 ТекстУсловия = "
		 |ГДЕ
		 |СостоянияОбменовДанными.РезультатВыполненияОбмена В (&СостоянияОшибки)";		 
		 
		 ТекстЗамены = ?(ТолькоОшибки, ТекстУсловия, ""); 
		 
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Условие", ТекстЗамены); 
		 	 
	     Запрос.Текст = ТекстЗапроса;
		 
		 ЗаписьЖР(СобытиеЖР, ТекстЗапроса);
		 
		 Запрос.УстановитьПараметр("СостоянияОшибки",Состояние_Ошибки); 
		 
		 сРез = Запрос.Выполнить().Выгрузить();
		 
		 Возврат сРез;
	
КонецФункции	

Функция Sync_ТекстПисьма(СобытиеЖР, сРез)
	
	ТекстПисьма = "";
	
	//ШаблонПисьма = "<html dir=""ltr""><head></head>
	//|<body>
	//|<div align = ""center""><h3>Состояние Синхронизаций</h3></div>
	//|<div>
	//|<table width = ""70%"" cellspacing=""0"" cellpadding=""5"" border = ""1"" align = ""center"">
	//|<tr>
	//|<th width = ""20%"">Узел обмена</th>
	//|<th valign=""top"">Действие</th>
	//|<th valign=""top"">Дата</th>
	//|<th valign=""top"">Состояние</th>
	//|</tr>
	//|#ВставкаСтрок#
	//|</table>
	//|</div>
	//|</body></html>";
	//
	//ШаблонСтроки = 
	//"<tr>
	//|<td width =""20%"">%1</td>
	//|<td valign=""top"">%2</td>
	//|<td valign=""top"">%3</td>
	//|<td valign=""top"">%4</td>
	//|</tr>";
	
	ЧастиПисьма = Новый Массив;
	ТекстПисьма =  ТаблицаЗначенийВТаблицуХТМЛ(сРез,);
	 //Для каждого ДанныеУзла Из сРез Цикл 
	 //    
	 //    ДатаВФормате = Формат(ДанныеУзла.ДатаОкончания, "ДФ=dd.MM.yyyy"); 
	 //    
	 //    НоваяСтрока = СтрШаблон(ШаблонСтроки,ДанныеУзла.Узел,ДанныеУзла.Действие,ДатаВФормате,ДанныеУзла.Состояние);
	 //    
	 //    ЧастиПисьма.Добавить(НоваяСтрока);
	 //    
	 //    //	
	 //    //	Если ТекущийУзел <> ДанныеУзла.Узел Тогда		
	 //    //		
	 //    //		Если ЧастиПисьма.Количество() > 0 Тогда
	 //    //			ЧастиПисьма.Добавить(РазделительУзлов);
	 //    //		КонецЕсли;	
	 //    //		
	 //    //		ЗаголовокУзла = СтрШаблон(ШаблонИмяУзла, ДанныеУзла.Узел);
	 //    //		ЧастиПисьма.Добавить(ЗаголовокУзла);
	 //    //		ТекущийУзел = ДанныеУзла.Узел;
	 //    //	КонецЕсли;
	 //    //	
	 //    //		//	
	 //    //	Действие = СтрШаблон(ШаблонДействия, ДанныеУзла.Действие, ДатаВФормате, ДанныеУзла.Состояние);
	 //    //	ЧастиПисьма.Добавить(Действие);		
	 //КонецЦикла;	
	
	//Если ЧастиПисьма.Количество() > 0 Тогда
	//    ТекстПисьма = СтрЗаменить(ШаблонПисьма, "#ВставкаСтрок#", СтрСоединить(ЧастиПисьма,Символы.ПС));
	//Иначе
	//	ТекстПисьма = "";
	//КонецЕсли;
	
	Возврат ТекстПисьма;
		
КонецФункции	

Процедура Sync_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез)
	
	Если сРез.Количество() > 0 Тогда 
		
		   УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");	
				
			ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Sync_Рассылка_ИнформацияОСостоянииСинхронизации", Истина);
			
			ТекстHTML = Sync_ТекстПисьма(СобытиеЖР, сРез);

			ПараметрыПисьма = Новый Структура;
			ПараметрыПисьма.Вставить("Тема", "ЗУП: Отчет о состоянии выполнения синхронизаций");
			ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
			ПараметрыПисьма.Вставить("Текст", ТекстHTML);
			ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
			
			//ПараметрыПисьма.Вставить("Важность", Важность);
			ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
			ПараметрыПисьма.Вставить("ПолучателиПисьма",ПолучателиПисьма);
			
			ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
		
	КонецЕсли;	
	
КонецПроцедуры

// BirthDay_НапомнитьОДняхРожденияхСотрудников
Процедура BirthDay_НапомнитьОДняхРожденияхСотрудников() 
	
	СобытиеЖР = "ХД.BirthDay_НапомнитьОДняхРожденияхСотрудников";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "BirthDay_НапомнитьОДняхРожденияхСотрудников";
	
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли; 
	
	сРез = BirthDay_ИнициализироватьТаблицуРезультата();
	
	BirthDay_СотрудникиСБлижайщимиДнямиРождений(СобытиеЖР, сРез); 
	
	BirthDay_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

	
КонецПроцедуры

Функция BirthDay_ИнициализироватьТаблицуРезультата()
	
	сРез = Новый ТаблицаЗначений;
	
	КавлификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	КавлификаторСтроки = Новый КвалификаторыСтроки(300,ДопустимаяДлина.Переменная);
	
	сРез.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	сРез.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	сРез.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата",,,,,КавлификаторДаты));
	сРез.Колонки.Добавить("ФИОПолные", Новый ОписаниеТипов("Строка",,,,КавлификаторСтроки));
	
	Возврат сРез;
	
КонецФункции	

Процедура BirthDay_СотрудникиСБлижайщимиДнямиРождений(СобытиеЖР, сРез)
	
	НапоминатьЗа = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("BirthDay_НапомнитьОДняхРожденияхСотрудников"); 
	ПроверяемаяДатаДняРождения = ТекущаяДатаСеанса() + (НапоминатьЗа * 86400); 
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.ОкончаниеПериода = ПроверяемаяДатаДняРождения;
	ПараметрыПолучения.КадровыеДанные = "Организация,ФИОПолные,ДатаРождения,ДатаУвольнения";    
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,"ДатаУвольнения", "=", Дата(1, 1, 1));
	
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыПолучения);
	
	ЗаписьЖР(СобытиеЖР, "Проверяемая дата:" + ПроверяемаяДатаДняРождения);

	ДеньРождения = День(ПроверяемаяДатаДняРождения);
	МесяцРождения = Месяц(ПроверяемаяДатаДняРождения);
		
	Для каждого ДанныеСотрудника Из ТаблицаСотрудников Цикл 
		
		Если  ДеньРождения = День(ДанныеСотрудника.ДатаРождения) 
			И МесяцРождения = Месяц(ДанныеСотрудника.ДатаРождения) и ЗначениеЗаполнено(ДанныеСотрудника.ДатаРождения) Тогда		
			СтрокаРезультата = сРез.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата,ДанныеСотрудника); 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция BirthDay_ТекстПисьма(СобытиеЖР, сРез) 
	
	//ШаблонПисьма =  
	//"<html dir=""ltr""><head></head>
	//|<body>
	//|<div >
	//|<div><h3 align = ""center""> Напоминания о днях рождениях сотрудников</h3></div>
	//|<div align = ""center""> <p>#ВставкаТекста#</p> <div>
	//|<table width=""70%"" cellspacing=""0"" cellpadding=""5"" border = ""1"" align = ""center"">
	//|<tr> 
	//|<th width=""50%"" valign=""top"">Сотрудник</th>
	//|<th valign=""top"">Организация</th>
	//|</tr>
	//|#ВставкаСтрок#
	//|</table>
	//|</div>
	//|</body></html>";	
	//
	//ШаблонСтроки = "<tr> 
	//|<td width=""50%"" valign=""top"">%1</td>
	//|<td valign=""top"">%2</td>
	//|</tr>";
	
	
	ЧастиТекста = Новый Массив;
	//
	НапоминатьЗа = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("BirthDay_НапомнитьОДняхРожденияхСотрудников");
	//
	ДатаДняРождения = Формат(ТекущаяДатаСеанса() + (НапоминатьЗа * 86400), "ДФ=dd.MM.yyyy");
	//
	СклонениеДня = СтроковыеФункцииКлиентСервер.ФормаМножественногоЧисла("день","дня","дней", НапоминатьЗа);
	//
	ЧастьТекста = СтрШаблон("Через %1 %2 (%3) следующие сотрудники будут отмечать свой День Рождения:",НапоминатьЗа,СклонениеДня,Формат(ДатаДняРождения, "ДФ=dd.MM.yyyy"));
	
	//ШаблонПисьма = СтрЗаменить(ШаблонПисьма, "#ВставкаТекста#",ЧастьТекста); 
	
	//Для каждого СтрокаДанных из сРез Цикл 	
	//	НоваяСтрока = СтрШаблон(ШаблонСтроки,СтрокаДанных.ФИОПолные,СтрокаДанных.Организация);
	//	ЧастиТекста.Добавить(НоваяСтрока);
	//КонецЦикла;	
	//
	//ШаблонПисьма = СтрЗаменить(ШаблонПисьма,"#ВставкаСтрок#",СтрСоединить(ЧастиТекста,Символы.ПС));       
	
	
	Макет = ПолучитьМакет("ХД_ДниРождения_HTML");	
	
	ТекстHTML = Макет.ПолучитьТекст();        
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{<b>Описание</b>}",ЧастьТекста); 
	
	СтрокаКолонок = "Сотрудник,ДатаРождения,Организация";
	
	мМассив  = СтрРазделить(СтрокаКолонок,",");
	
	Для каждого стр Из сРез Цикл
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", стр[эл]); 	
			
		КонецЦикла;  	
		
	КонецЦикла;
	
	Возврат  ТекстHTML; 
	
Конецфункции	

Процедура BirthDay_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез)
	
	Если сРез.Количество() > 0 Тогда 
		
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");	
		
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("BirthDay_Рассылка_НапомнитьОДняхРожденияСотрудников", Истина);
		
		ТекстHTML =  BirthDay_ТекстПисьма(СобытиеЖР,сРез);  
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Тема", "ЗУП: Напоминания о днях рождениях сотрудников");    
		ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		ПараметрыПисьма.Вставить("Текст", ТекстHTML);
		ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
		ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыПисьма.Вставить("ПолучателиПисьма",ПолучателиПисьма);
		
		ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
		
	КонецЕсли;	
	
КонецПроцедуры


//ЗаписьЗарплатыNetЕжедневно

Процедура ЗаписьЗарплатыNetЕжедневно()

	СобытиеЖР = "ХД.ЗаписьЗарплатыNetЕжедневно";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ЗаписьЗарплатыNetЕжедневно";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли; 
	
	СписокФизЛицОрганизация = ПолучитьСписокСотрудников(СобытиеЖР);
	
	ТЗНДФЛ = ПолучитьДанныеДляПостроенияОтчета(СобытиеЖР,СписокФизЛицОрганизация);
	
	Рез = СобратьЗапроссЗарплатой(ТЗНДФЛ);  
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Функция СобратьЗапроссЗарплатой(ТЗНДФЛ)

	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЗНДФЛ",ТЗНДФЛ);
	
	Запрос.Текст = "           
	|ВЫБРАТЬ
	|	ТЗНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТЗНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ТЗНДФЛ.Год КАК Год,
	|	ТЗНДФЛ.Месяц КАК Месяц,
	|	ТЗНДФЛ.Ставка КАК Ставка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗНДФЛ КАК ТЗНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ.Год КАК Год,
	|	ВТ.Месяц КАК Месяц,
	|	ВТ.Ставка КАК Ставка
	|ПОМЕСТИТЬ ВТНДФЛ
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Зарплата_net КАК Зарплата_net,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ЗарплатаПослеИспСрока КАК ЗарплатаПослеИспСрока,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ЗарплатаЧерез6Мес КАК ЗарплатаЧерез6Мес,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ЗарплатаЧерезГод КАК ЗарплатаЧерезГод,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.HiringSalary КАК ЗарплатаТекущая,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.УдаленнаяРабота КАК УдаленнаяРабота,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Валюта КАК Валюта,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ПлановыйФОТИтоги.Период) КАК Период,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ВТГруппировка
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыйФОТИтоги КАК ПлановыйФОТИтоги
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = ПлановыйФОТИтоги.Сотрудник
	|			И ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = ПлановыйФОТИтоги.ФизическоеЛицо
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Зарплата_net,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ЗарплатаПослеИспСрока,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ЗарплатаЧерез6Мес,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ЗарплатаЧерезГод,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.HiringSalary,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.УдаленнаяРабота,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Валюта,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Руководитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГруппировка.Сотрудник КАК Сотрудник,
	|	ВТГруппировка.Организация КАК Организация,
	|	ВТГруппировка.Зарплата_net КАК Зарплата_net,
	|	ВТГруппировка.ЗарплатаПослеИспСрока КАК ЗарплатаПослеИспСрока,
	|	ВТГруппировка.ЗарплатаЧерез6Мес КАК ЗарплатаЧерез6Мес,
	|	ВТГруппировка.ЗарплатаЧерезГод КАК ЗарплатаЧерезГод,
	|	ВТГруппировка.ЗарплатаТекущая КАК ЗарплатаТекущая,
	|	ВТГруппировка.УдаленнаяРабота КАК УдаленнаяРабота,
	|	ВТГруппировка.Валюта КАК Валюта,
	|	ВТГруппировка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТГруппировка.Период КАК Период,
	|	ПлановыйФОТИтоги.ФОТ КАК ФОТ,
	|	ВТГруппировка.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ВТ_ОКЛАД
	|ИЗ
	|	ВТГруппировка КАК ВТГруппировка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыйФОТИтоги КАК ПлановыйФОТИтоги
	|		ПО ВТГруппировка.Сотрудник = ПлановыйФОТИтоги.Сотрудник
	|			И ВТГруппировка.Организация = ПлановыйФОТИтоги.ГоловнаяОрганизация
	|			И ВТГруппировка.Период = ПлановыйФОТИтоги.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНДФЛ.ГоловнаяОрганизация КАК Организация,
	|	ВТ_ОКЛАД.Сотрудник КАК Сотрудник,
	|	ВТНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТНДФЛ.Год КАК Год,
	|	ВТНДФЛ.Месяц КАК Месяц,
	|	ВТНДФЛ.Ставка КАК Ставка,
	|	ВТ_ОКЛАД.Зарплата_net КАК Зарплата_net,
	|	ВТ_ОКЛАД.ЗарплатаПослеИспСрока КАК ЗарплатаПослеИспСрока,
	|	ВТ_ОКЛАД.ЗарплатаЧерез6Мес КАК ЗарплатаЧерез6Мес,
	|	ВТ_ОКЛАД.ЗарплатаЧерезГод КАК ЗарплатаЧерезГод,
	|	ВТ_ОКЛАД.ЗарплатаТекущая КАК ЗарплатаТекущая,
	|	ВТ_ОКЛАД.УдаленнаяРабота КАК УдаленнаяРабота,
	|	ВТ_ОКЛАД.Валюта КАК Валюта,
	|	ВТ_ОКЛАД.Период КАК Период,
	|	ВТ_ОКЛАД.ФОТ КАК ЗарплатаГросс,
	|	ВЫБОР
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13) = ВТНДФЛ.Ставка
	|			ТОГДА 0.13
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15) = ВТНДФЛ.Ставка
	|					ТОГДА 0.15
	|				ИНАЧЕ 0.18
	|			КОНЕЦ
	|	КОНЕЦ КАК СтавкаЧисло,
	|	ВТ_ОКЛАД.ФОТ - ВТ_ОКЛАД.ФОТ * ВЫБОР
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13) = ВТНДФЛ.Ставка
	|			ТОГДА 0.13
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15) = ВТНДФЛ.Ставка
	|					ТОГДА 0.15
	|				ИНАЧЕ 0.18
	|			КОНЕЦ
	|	КОНЕЦ КАК ОкладNetРасчетный,
	
	|	ВТ_ОКЛАД.Руководитель КАК Руководитель
	|ИЗ
	|	ВТНДФЛ КАК ВТНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОКЛАД КАК ВТ_ОКЛАД
	|		ПО ВТНДФЛ.ФизическоеЛицо = ВТ_ОКЛАД.ФизическоеЛицо
	|			И ВТНДФЛ.ГоловнаяОрганизация = ВТ_ОКЛАД.Организация";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.ZUPC_ЗарплатаNet.СоздатьМенеджерЗаписи(); 
		МЗ.Период = ТекущаяДата();
		МЗ.Организация    = Выборка.Организация;
		МЗ.Сотрудник      = Выборка.Сотрудник;
		МЗ.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		МЗ.Год            = Выборка.Год;
		МЗ.Зарплата_net   = Окр(Выборка.ОкладNetРасчетный,-2, РежимОкругления.Окр15как10);     
		МЗ.Ставка 		  = Выборка.СтавкаЧисло;
		МЗ.Записать();
КонецЦикла;


КонецФункции // ()

Функция ПолучитьСписокСотрудников(СобытиеЖР)   
	
	
	МассивТипов = Новый Массив(2);
	МассивТипов[0]= Тип("Null");
	СписокФизЛицОрганизация = Новый ТаблицаЗначений;
	МассивТипов[1]= Тип("СправочникСсылка.ФизическиеЛица");
	СписокФизЛицОрганизация.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("СправочникСсылка.Организации");
	СписокФизЛицОрганизация.Колонки.Добавить("ГоловнаяОрганизация", Новый ОписаниеТипов(МассивТипов));
	СписокФизЛицОрганизация.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Число");
	СписокФизЛицОрганизация.Колонки.Добавить("Год", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Булево");
	СписокФизЛицОрганизация.Колонки.Добавить("НеОтбиратьПоОП", Новый ОписаниеТипов(МассивТипов));


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
		|	2024 КАК Год,
		|	ЛОЖЬ КАК НеОтбиратьПоОП
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
		//|	И ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо";
	
	//Запрос.УстановитьПараметр("ФизическоеЛицо", Справочники.ФизическиеЛица.НайтиПоНаименованию("Галимов Ринат Шамилевич"));
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	ЗаписьЖР(СобытиеЖР, "Получение списка сотрудников");
	
	Возврат Рез;
	
КонецФункции // ПолучитььСписокСотрудников()
 
Функция ПолучитьДанныеДляПостроенияОтчета(СобытиеЖР,СписокФизЛицОрганизация)
	
	ЗаписьЖР(СобытиеЖР, "Начало сбора данных по зарплате");

	//Период = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "Период").Значение; 
	ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОкончания = ТекущаяДата();
	
	ДатаНачалаНП = ДатаНачала;
	ДатаКонцаНП  =  ДатаОкончания;
	//ДатаПодписи  = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ДатаПодписи").Значение;
	//Если ТипЗнч(ДатаПодписи) = Тип("СтандартнаяДатаНачала") Тогда 
	//	ДатаПодписи = ДатаПодписи.Дата;
	//КонецЕсли;	
	
	//Если ДатаПодписи = Неопределено Или ДатаПодписи = '00010101' Тогда
		ДатаПодписи = ТекущаяДатаСеанса();
	//КонецЕсли;
	Ответственный = Неопределено;

	ФизическоеЛицоОтветственного = ?(Ответственный = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный.Значение, "ФизическоеЛицо"));
	
	// Создание запроса и установка всех необходимых параметров.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ФизлицоОтветственного", ФизическоеЛицоОтветственного);
	Запрос.УстановитьПараметр("НачалоНП", ДатаНачалаНП);
	Запрос.УстановитьПараметр("КонецНП", ДатаКонцаНП);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаПодписи);
	Запрос.УстановитьПараметр("СписокФизЛицОрганизация", СписокФизЛицОрганизация);
	Запрос.УстановитьПараметр("Резидент", Справочники.СтатусыНалогоплательщиковПоНДФЛ.Резидент);
	Запрос.УстановитьПараметр("Нерезидент", Справочники.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент);
	Запрос.УстановитьПараметр("ДатаИзмененияНалогообложенияДивидендов", УчетНДФЛ.ДатаИзмененияНалогообложенияДивидендов());
	Запрос.УстановитьПараметр("ДатаНачалаРасчетаСроковУплатыНалога", УчетНДФЛ.ДатаНачалаРасчетаСроковУплатыНалога());
	Запрос.УстановитьПараметр("ДатаЗакона263ФЗ", УчетНДФЛ.ДатаЗакона263ФЗ());
	Запрос.УстановитьПараметр("ДатаЗакона285ФЗ", УчетНДФЛ.ДатаЗакона285ФЗ());
	Запрос.УстановитьПараметр("ДатаЗакона176ФЗ", УчетНДФЛ.ДатаЗакона176ФЗ());
	Запрос.УстановитьПараметр("ГодЗакона285ФЗ", Год(УчетНДФЛ.ДатаЗакона285ФЗ()));
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();		
	Запрос.УстановитьПараметр("ДатаОбъединенияНалоговыхБаз", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.ДатаОбъединенияНалоговыхБаз);
	Запрос.УстановитьПараметр("НачалоРасчетаНДФЛПоПрогрессивнойШкале", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.НачалоРасчетаНДФЛПоПрогрессивнойШкале);
	Запрос.УстановитьПараметр("ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале", Год(ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.НачалоРасчетаНДФЛПоПрогрессивнойШкале));
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
	Запрос.УстановитьПараметр("ОбщаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ПоОсновнойСтавке());
	Запрос.УстановитьПараметр("ДоходыОтТрудовойДеятельности", Перечисления.КатегорииДоходовНДФЛ.ДоходыОтТрудовойДеятельности());
	Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
	Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
	Запрос.УстановитьПараметр("СтавкаЧисломСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом);
	// Сформируем текст запроса с датами месяцев налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, ДатаНачалаНП, ДатаКонцаНП,,,, Истина);
	
	ВТ_ПорядокСтавок = Новый ТаблицаЗначений;
    ВТ_ПорядокСтавок.Колонки.Добавить("Ставка", Новый ОписаниеТипов("ПеречислениеСсылка.НДФЛСтавки"));
	ВТ_ПорядокСтавок.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка13;
	НоваяСтрока.Порядок   = 1;		
	
	НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка15;
	НоваяСтрока.Порядок   = 2;		
	
	НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка18;
	НоваяСтрока.Порядок   = 3;		 
	
		НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка20;
	НоваяСтрока.Порядок   = 4;	   
	
			НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка22;
	НоваяСтрока.Порядок   = 5;
	
	Запрос.УстановитьПараметр("ВТ_ПорядокСтавок", ВТ_ПорядокСтавок);
	
	
	// -----------------------------------------------------------------------------
		Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛицаОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ФизЛицаОрганизация.Организация,
	|	ФизЛицаОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизЛицаОрганизация.Год КАК Год,
	|	ФизЛицаОрганизация.НеОтбиратьПоОП
	|ПОМЕСТИТЬ ВТСписокФизЛицОрганизация
	|ИЗ
	|	&СписокФизЛицОрганизация КАК ФизЛицаОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ГоловнаяОрганизация,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК СтруктурнаяЕдиница,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТГоловныеОрганизации
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВЫБОР
	|		КОГДА Организации.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТСписокФизЛицОрганизация.Организация
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТОбособленныеПодразделения
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = Организации.ГоловнаяОрганизация
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВТСписокФизЛицОрганизация.Организация
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Периоды.Период) КАК Период,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТТаблицаДляСрезаНаКонецГода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	МассивНеобходимыхДанных = Новый Массив;
	МассивНеобходимыхДанных.Добавить("ФИОПолные");
	МассивНеобходимыхДанных.Добавить("ДокументВид");
	МассивНеобходимыхДанных.Добавить("ДокументНомер");
	МассивНеобходимыхДанных.Добавить("ДокументСерия");
	МассивНеобходимыхДанных.Добавить("АдресПоПрописке");
	МассивНеобходимыхДанных.Добавить("АдресЗаПределамиРФ");
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФизическиеЛица");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Ложь, МассивНеобходимыхДанных);
	
	// Получим кадровые данные ответственного лица.
	ФизическоеЛицоОтветственногоВМассиве = Новый Массив;
	ФизическоеЛицоОтветственногоВМассиве.Добавить(ФизическоеЛицоОтветственного);
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц 	= ФизическоеЛицоОтветственногоВМассиве;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода 			= ДатаПодписи;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода 		= ДатаПодписи;
	ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные			= "ВидЗанятости,Организация,Должность";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций);
	КадровыйУчет.СоздатьВТСтраныМираДляГражданства(Запрос.МенеджерВременныхТаблиц);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Вставить("ВсеЗаписи", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ГражданствоФизическихЛиц",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТТаблицаДляСрезаНаКонецГода",
			"Период,ФизическоеЛицо"),
		ПараметрыПостроения);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ИсторияРегистрацийВНалоговомОргане",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТГоловныеОрганизации",
			"Период,СтруктурнаяЕдиница"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГОД(ГражданствоФизЛицаСрезПоследних.Период) КАК Год,
	|	ГражданствоФизЛицаСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраныМира.Код КАК КодСтраны,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛицаСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ ГражданствоФизЛицаСрезПоследних.ИНН
	|	КОНЕЦ КАК ИННВСтранеГражданства
	|ПОМЕСТИТЬ ВТГражданствоФизЛиц
	|ИЗ
	|	ВТГражданствоФизическихЛицСрезПоследних КАК ГражданствоФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтраныМираДляГражданства КАК СтраныМира
	|		ПО ГражданствоФизЛицаСрезПоследних.Страна = СтраныМира.Страна
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Периоды.Период) КАК Период,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	// Статусы застрахованных на конец месяца.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтатусФизическихЛицКакНалогоплательщиковНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца",
			"ФизическоеЛицо"),
		,
		"ВТСтатусФизЛицНаКонецМесяцаПромежуточная");
		
	// Статусы застрахованных на конец налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтатусФизическихЛицКакНалогоплательщиковНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТСтатусыФизЛицНаКонецНалоговогоПериода",
			"ФизическоеЛицо"),
		,
		"ВТСтатусыФизЛицНаКонецНалоговогоПериодаПромежуточная");
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период, МЕСЯЦ) КАК Месяц,
	|	ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаИзмененияНалогообложенияДивидендов
	|				ТОГДА СтатусФизЛицНаКонецМесяца.Статус.КодФНС
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Статус.КодФНС_2015
	|		КОНЕЦ, 1) КАК Статус,
	|	ВЫБОР
	|		КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаЗакона285ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы))
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаЗакона285ФЗ
	|				И СтатусФизЛицНаКонецМесяца.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК ТекущийСтатус
	|ПОМЕСТИТЬ ВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца КАК ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяцаПромежуточная КАК СтатусФизЛицНаКонецМесяца
	|		ПО ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период = СтатусФизЛицНаКонецМесяца.Период
	|			И ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СтатусФизЛицНаКонецМесяца.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокФизЛицОрганизация.ГОД КАК Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГОД < &ГодЗакона285ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы))
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, &Резидент) <> &Резидент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьИностранныйАдрес,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГОД < &ГодЗакона285ФЗ
	|				И СтатусыФизЛицНаКонецНалоговогоПериода.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериодаПромежуточная КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО (СписокФизЛицОрганизация.ГОД = ГОД(СтатусыФизЛицНаКонецНалоговогоПериода.Период))
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ)";
	
	Запрос.Выполнить();

	// Статусы застрахованных на конец налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ПрименениеСтандартныхВычетовПоНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних",
			"ФизическоеЛицо"));
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Период,
	|	НДФЛПрименениеВычетов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|ПОМЕСТИТЬ ВТПрименениеВычетовВМесяцаРезидентства
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО (ГОД(СтатусФизЛицНаКонецМесяца.Месяц) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|			И СтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних КАК НДФЛПрименениеВычетов
	|		ПО (НДФЛПрименениеВычетов.ФизическоеЛицо = СтатусФизЛицНаКонецМесяца.ФизическоеЛицо)
	|			И (НДФЛПрименениеВычетов.Период = СтатусФизЛицНаКонецМесяца.Месяц)
	|ГДЕ
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Период,
	|	ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ДатаАктуальности КАК Период,
	|	ФизЛица.ГоловнаяОрганизация.ИндивидуальныйПредприниматель КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛицаДляПолученияФИО
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ФизЛица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаАктуальности,
	|	&ФизлицоОтветственного";
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ОбъединеннаяНалоговаяБазаСтрокой", НСтр("ru = 'Объединенная налоговая база'"));
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБазаСтрокой", НСтр("ru = 'Основная налоговая база'"));
	Запрос.УстановитьПараметр("Дивиденды", НСтр("ru = 'Дивиденды'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыОтДолевогоУчастия", НСтр("ru = 'Доходы от долевого участия'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоВыигрышам", НСтр("ru = 'Доходы по выигрышам'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыЦБ", НСтр("ru = 'Операции с ценными бумагами кроме процента, купона по облигациям российских организаций'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыРЕПО", НСтр("ru = 'Операции РЕПО'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыЗаймЦБ", НСтр("ru = 'Операции займа ценными бумагами'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыИИС", НСтр("ru = 'Операции на ИИС'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоОблигациям", НСтр("ru = 'Процент, купон по облигациям российских организаций с 1 января 2017 г.'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ", НСтр("ru = 'Прочие доходы, облагаемые по ставке п. 1.1 ст. 224 НК РФ'"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК КатегорияДохода,
	|	&ОсновнаяНалоговаяБазаСтрокой КАК ПредставлениеНалоговойБазы,
	|	1 КАК ПорядокНалоговойБазы
	|ПОМЕСТИТЬ ВТОписаниеНалоговыхБаз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды),
	|	&Дивиденды,
	|	90
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия),
	|	&ПрочиеДоходыОтДолевогоУчастия,
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам),
	|	&ПрочиеДоходыПоВыигрышам,
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ),
	|	&ПрочиеДоходыЦБ,
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО),
	|	&ПрочиеДоходыРЕПО,
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ),
	|	&ПрочиеДоходыЗаймЦБ,
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС),
	|	&ПрочиеДоходыИИС,
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям),
	|	&ПрочиеДоходыПоОблигациям,
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ),
	|	&ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ,
	|	9";
	Запрос.Выполнить();

	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛицаДляПолученияФИО");
	ОписательВременныхТаблиц.ИмяВТКадровыеДанныеФизическихЛиц = "ВТФИООтветственных";
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФИОПолные,ИОФамилия");

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.ИНН КАК Организация_ИНН,
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.КПП КАК Организация_КПП,
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.Код КАК Организация_КодНалоговогоОргана,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|			ТОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ ФИОПредпринимателя.ФИОПолные
	|	КОНЕЦ КАК Организация_Наименование,
	|	ДанныеОФизЛице.ИНН КАК ФизическоеЛицо_ИНН,
	|	КадровыеДанныеФизЛиц.ФИОПолные КАК ФизическоеЛицо_ФИО,
	|	ФИОФизлицаОтветственного.ИОФамилия КАК Ответственный_ФИО,
	|	ДолжностьОтветственного.Должность.Наименование КАК Ответственный_Должность,
	|	КадровыеДанныеФизЛиц.ДокументВид.Наименование КАК ВидДокумента,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеФизЛиц.ДокументВид ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ КадровыеДанныеФизЛиц.ДокументВид.КодМВД
	|	КОНЕЦ КАК КодДокументаУдЛичн,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеФизЛиц.ДокументВид ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ КадровыеДанныеФизЛиц.ДокументСерия + "" "" + КадровыеДанныеФизЛиц.ДокументНомер
	|	КОНЕЦ КАК ФизическоеЛицо_СерияНомерДокументаУдЛичн,
	|	ДанныеОФизЛице.ДатаРождения КАК ФизическоеЛицо_ДатаРождения,
	|	ЕСТЬNULL(ГражданствоФизЛица.КодСтраны, ""643"") КАК ФизическоеЛицо_КодСтраны,
	|	ДоходыПредыдущегоМестаРаботыНДФЛ.Размер КАК ФизическоеЛицо_ДоходыПредыдущегоМестаРаботы,
	|	ЕСТЬNULL(КадровыеДанныеФизЛиц.АдресПоПрописке, """") КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА ЕСТЬNULL(ГражданствоФизЛица.КодСтраны, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизическоеЛицо_АдресКодСтраны,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА ЕСТЬNULL(КадровыеДанныеФизЛиц.АдресЗаПределамиРФ, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизическоеЛицо_ИностранныйАдрес
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИОПредпринимателя
	|		ПО (ФИОПредпринимателя.ФизическоеЛицо = СписокФизЛицОрганизация.ГоловнаяОрганизация.ИндивидуальныйПредприниматель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОФизЛице
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ДанныеОФизЛице.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОбОтветственном
	|		ПО (ДанныеОбОтветственном.Ссылка = &ФизлицоОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = КадровыеДанныеФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсторияРегистрацийВНалоговомОрганеСрезПоследних КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИОФизлицаОтветственного
	|		ПО (ФИОФизлицаОтветственного.ФизическоеЛицо = &ФизлицоОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ГражданствоФизЛица.ФизическоеЛицо
	|			И СписокФизЛицОрганизация.Год = ГражданствоФизЛица.Год
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ КАК ДоходыПредыдущегоМестаРаботыНДФЛ
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ДоходыПредыдущегоМестаРаботыНДФЛ.ФизическоеЛицо
	|			И СписокФизЛицОрганизация.ГоловнаяОрганизация = ДоходыПредыдущегоМестаРаботыНДФЛ.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.Год = ГОД(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода))
	|			И (МЕСЯЦ(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода) = 12)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК ДолжностьОтветственного
	|		ПО (ДолжностьОтветственного.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство))
	|			И (ДолжностьОтветственного.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	Год";
	
	ДанныеОФизЛицеОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	УчетНДФЛ.СоздатьВТСтандартныеВычетыПоНДФЛЗаПериод(Запрос.МенеджерВременныхТаблиц, Ложь, ДатаПодписи, "ВТПрименениеВычетовВМесяцаРезидентства");
	УчетНДФЛ.СоздатьВТДополнительныеСвойстваКодаДохода(Запрос.МенеджерВременныхТаблиц);
	
	// АПК:96-выкл в таблице ВТСтрокиУчета строки должны быть уникальны
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛСведенияОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|				И НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА 0
	|		ИНАЧЕ НДФЛСведенияОДоходах.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|				И НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета
	|	КОНЕЦ КАК КодВычета,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ПериодДляОпределенияСтатуса,
	|	НДФЛСведенияОДоходах.КодДохода.Код КАК КодДоходаКод,
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода < &ДатаЗакона263ФЗ
	|		И СвойстваКодаДохода.СоответствуетОплатеТруда
	|		И (НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|			ИЛИ НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)) КАК УчитываетсяПоМесяцуНачисления,
	|	НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2025, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2025Года
	|	КОНЕЦ КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	НДФЛСведенияОДоходах.КодВычета.НеПредоставляетсяНерезидентам КАК ВычетНеПредоставляетсяНерезидентам,
	|	НДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	|	&УсловиеОблагаемостиУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	НДФЛСведенияОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	НДФЛСведенияОДоходах.ДокументОснование КАК ДокументОснование,
	|	НДФЛСведенияОДоходах.УстаревшаяДатаПолученияДохода КАК УстаревшаяДатаПолученияДохода
	|ПОМЕСТИТЬ ВТСтрокиДоходов
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахНДФЛ КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеСвойстваКодаДохода КАК СвойстваКодаДохода
	|		ПО НДФЛСведенияОДоходах.КодДохода = СвойстваКодаДохода.КодДохода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛСведенияОДоходах.Организация = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыСБюджетом.Сумма КАК Сумма,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышения КАК СуммаСПревышения,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	НДФЛРасчетыСБюджетом.ВариантУдержания КАК ВариантУдержания,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК ПериодДляОпределенияСтатуса,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛРасчетыСБюджетом.КрайнийСрокУплаты КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды))
	|			ТОГДА НДФЛРасчетыСБюджетом.НалогСДивидендовУплаченныйЗаРубежом
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов
	|ПОМЕСТИТЬ ВТСтрокиНалогов
	|ИЗ
	|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК НДФЛРасчетыСБюджетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И (ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) = СписокФизЛицОрганизация.Год)
	|			И НДФЛРасчетыСБюджетом.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛРасчетыСБюджетом.Организация = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтрокиДоходов.ПериодДляОпределенияСтатуса КАК Период,
	|	СтрокиДоходов.КодДохода КАК КодДохода,
	|	СтрокиДоходов.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СтрокиДоходов.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТСтрокиУчета
	|ИЗ
	|	ВТСтрокиДоходов КАК СтрокиДоходов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.ФизическоеЛицо,
	|	СтрокиНалогов.ПериодДляОпределенияСтатуса,
	|	СтрокиНалогов.КодДохода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(СтрокиНалогов.ПериодДляОпределенияСтатуса, ГОД),
	|	СтрокиНалогов.КодДохода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОблагаемостиУНалоговогоАгента", УчетНДФЛ.УсловиеОблагаемостиУНалоговогоАгента("НДФЛСведенияОДоходах"));
	Запрос.Выполнить();
	// АПК:96-вкл
	
	УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета",,,"ВТСтавкаНДФЛ");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтрокиУчета.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтрокиУчета.Период КАК Период,
	|	СтрокиУчета.КодДохода КАК КодДохода,
	|	СтрокиУчета.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СтрокиУчета.КатегорияДохода КАК КатегорияДохода
	|ИЗ
	|	ВТСтрокиУчета КАК СтрокиУчета
	|ГДЕ
	|	СтрокиУчета.Период < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)";
	Если Запрос.Выполнить().Пустой() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ПустаяСсылка) КАК Статус,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка) КАК КодДохода,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.ПустаяСсылка) КАК СтавкаНалогообложенияРезидента,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.ПустаяСсылка) КАК СтавкаНДФЛ,
		|	0 КАК СтавкаЧислом
		|ПОМЕСТИТЬ ВТСтавкаНДФЛПоСтавкеРезидента";
		Запрос.Выполнить();
	Иначе 	
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента2016(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СоответствиеНалоговыхБаз", УчетНДФЛПовтИсп.СоставНалоговыхБаз());
	Запрос.УстановитьПараметр("ДатаЗакона176ФЗ", УчетНДФЛ.ДатаЗакона176ФЗ());
	Запрос.УстановитьПараметр("ТаблицаПределовДляНалоговыхБаз", УчетНДФЛ.ТаблицаПределовДляНалоговыхБаз2025());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНалоговыхБаз.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СоответствиеНалоговыхБаз.НалоговаяБаза КАК НалоговаяБаза,
	|	СоответствиеНалоговыхБаз.КатегорияДохода КАК КатегорияДохода,
	|	СоответствиеНалоговыхБаз.ПериодС КАК ПериодС,
	|	СоответствиеНалоговыхБаз.ПериодПо КАК ПериодПо,
	|	СоответствиеНалоговыхБаз.СтатусФизическогоЛица КАК Статус
	|ПОМЕСТИТЬ ВТСоответствиеНалоговыхБаз
	|ИЗ
	|	&СоответствиеНалоговыхБаз КАК СоответствиеНалоговыхБаз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПределов.НалоговаяБаза КАК НалоговаяБаза,
	|	ТаблицаПределов.Предел1 КАК Предел1
	|ПОМЕСТИТЬ ВТПределыДляНалоговыхБаз
	|ИЗ
	|	&ТаблицаПределовДляНалоговыхБаз КАК ТаблицаПределов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыСБюджетом.Сумма КАК Сумма,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышения КАК СуммаСПревышения,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	НДФЛРасчетыСБюджетом.ВариантУдержания КАК ВариантУдержания,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНДФЛ
	|		ИНАЧЕ СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ
	|	КОНЕЦ КАК СтавкаПоИтогамГода,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.КатегорияДохода КАК КатегорияДохода,
	|	ЕСТЬNULL(СоответствиеНалоговыхБаз.НалоговаяБаза, ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)) КАК НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса КАК ПериодДляОпределенияСтатуса,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
	|	НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов КАК НалогНаПрибыльДляДивидендов
	|ПОМЕСТИТЬ ВТСтрокиНалоговСоСтавками
	|ИЗ
	|	ВТСтрокиНалогов КАК НДФЛРасчетыСБюджетом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КодДохода = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.КодДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеНалоговыхБаз КАК СоответствиеНалоговыхБаз
	|		ПО НДФЛРасчетыСБюджетом.КатегорияДохода = СоответствиеНалоговыхБаз.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СоответствиеНалоговыхБаз.СтавкаНалогообложенияРезидента
	|			И (СтавкиНДФЛ.Статус = СоответствиеНалоговыхБаз.Статус)
	|			И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ СоответствиеНалоговыхБаз.ПериодС И СоответствиеНалоговыхБаз.ПериодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкаНДФЛНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛНаКонецНалоговогоПериода.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛНаКонецНалоговогоПериода.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВидДвижения КАК ВидДвижения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Сумма КАК Сумма,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Период КАК Период,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КодДохода КАК КодДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода КАК ПериодДляОпределенияСтатуса,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Ставка КАК Ставка,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.НалоговаяБаза КАК НалоговаяБаза
	|ПОМЕСТИТЬ ВТСтрокиАвансов
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК АвансовыеПлатежиИностранцевПоНДФЛ
	|ГДЕ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ГоловнаяОрганизация,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ФизическоеЛицо,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВидДвижения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СуммаСПревышения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаНалогообложенияРезидента,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Период,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КодДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.РегистрацияВНалоговомОргане,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КатегорияДохода,
	|	ВЫБОР
	|		КОГДА АвансовыеПлатежиИностранцевПоНДФЛ.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ АвансовыеПлатежиИностранцевПоНДФЛ.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.НалоговаяБаза
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК АвансовыеПлатежиИностранцевПоНДФЛ
	|ГДЕ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтандартныеВычетыПоНДФЛЗаПериод.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Месяц КАК Месяц,
	|	СтандартныеВычетыПоНДФЛЗаПериод.КодВычета КАК КодВычетаЛичный,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Количество КАК КоличествоДетей,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Основание КАК Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыПоМесяцамРезидентства
	|ИЗ
	|	ВТСтандартныеВычетыПоНДФЛЗаПериод КАК СтандартныеВычетыПоНДФЛЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименениеВычетовВМесяцаРезидентства.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрименениеВычетовВМесяцаРезидентства.Период КАК Месяц,
	|	ПрименениеВычетовВМесяцаРезидентства.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета,
	|	СтандартныеВычетыПоМесяцамРезидентства.КоличествоДетей КАК КоличествоДетей,
	|	СтандартныеВычетыПоМесяцамРезидентства.Основание КАК Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыФизЛицОрганизации
	|ИЗ
	|	ВТПрименениеВычетовВМесяцаРезидентства КАК ПрименениеВычетовВМесяцаРезидентства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|		ПО ПрименениеВычетовВМесяцаРезидентства.ФизическоеЛицо = СтандартныеВычетыПоМесяцамРезидентства.ФизическоеЛицо
	|			И ПрименениеВычетовВМесяцаРезидентства.Период = СтандартныеВычетыПоМесяцамРезидентства.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета КАК КодВычета,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Сумма) КАК Размер,
	|	МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор,
	|	НДФЛИмущественныеВычетыФизлиц.Период КАК Дата
	|ПОМЕСТИТЬ ВТСоциальныеИИмущественныеВычеты
	|ИЗ
	|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛИмущественныеВычетыФизлиц.Организация = СписокФизЛицОрганизация.Организация)
	|			И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета,
	|	НДФЛИмущественныеВычетыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Сумма),
	|	НЕОПРЕДЕЛЕНО,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.ГруппаВычета = ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.Социальные))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(НДФЛСведенияОДоходах.МесяцНалоговогоПериода) КАК Год,
	|	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ) КАК Месяц,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицПоГодам.Статус = &Резидент
	|			ТОГДА НДФЛСведенияОДоходах.СуммаВычета
	|		КОГДА НДФЛСведенияОДоходах.ВычетНеПредоставляетсяНерезидентам
	|			ТОГДА 0
	|		ИНАЧЕ НДФЛСведенияОДоходах.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НДФЛСведенияОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	НДФЛСведенияОДоходах.КодДоходаКод КАК КодДоходаКод,
	|	НДФЛСведенияОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаЧислом
	|	КОНЕЦ КАК СтавкаЧислом,
	|	НДФЛСведенияОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.УчитываетсяПоМесяцуНачисления
	|			ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК МесяцНачисления,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.УчитываетсяПоМесяцуНачисления
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ НДФЛСведенияОДоходах.ДатаПолученияДохода
	|	КОНЕЦ КАК ДатаВыплаты,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК Период,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	НДФЛСведенияОДоходах.Период КАК ДатаНачисления,
	|	НДФЛСведенияОДоходах.КодВычета КАК КодВычета,
	|	НДФЛСведенияОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|			ТОГДА СоответствиеНалоговыхБаз.НалоговаяБаза
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода < &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода В (&ОбщаяНалоговаяБаза)
	|				И НДФЛСведенияОДоходах.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛСведенияОДоходах.КатегорияДохода
	|	КОНЕЦ КАК НалоговаяБаза,
	|	НДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|							И НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|			ТОГДА НЕ СоответствиеНалоговыхБаз.НалоговаяБаза В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка))
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
	|					И НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|					И НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходРазделаПо13,
	|	НДФЛСведенияОДоходах.ДокументОснование КАК ДокументОснование,
	|	НДФЛСведенияОДоходах.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		И НДФЛСведенияОДоходах.ДатаПолученияДохода <> НДФЛСведенияОДоходах.УстаревшаяДатаПолученияДохода КАК ДатаПолученияДоходаПеренесена
	|ПОМЕСТИТЬ ВТДоходыПоСтавкам
	|ИЗ
	|	ВТСтрокиДоходов КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеНалоговыхБаз КАК СоответствиеНалоговыхБаз
	|		ПО НДФЛСведенияОДоходах.КатегорияДохода = СоответствиеНалоговыхБаз.КатегорияДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СоответствиеНалоговыхБаз.СтавкаНалогообложенияРезидента
	|			И (СтавкиНДФЛ.Статус = СоответствиеНалоговыхБаз.Статус)
	|			И (НДФЛСведенияОДоходах.ДатаПолученияДохода МЕЖДУ СоответствиеНалоговыхБаз.ПериодС И СоответствиеНалоговыхБаз.ПериодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицПоГодам
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтатусыФизЛицПоГодам.ФизическоеЛицо
	|			И (ГОД(НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса) = СтатусыФизЛицПоГодам.Год)
	|ГДЕ
	|	(НЕ НДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ
	|			ИЛИ СтатусыФизЛицПоГодам.Статус = &Резидент
	|			ИЛИ СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ДистанционныйРаботник)
	|				И НДФЛСведенияОДоходах.КатегорияДохода В (&ДоходыОтТрудовойДеятельности)
	|				И НДФЛСведенияОДоходах.ДатаПолученияДохода >= ДАТАВРЕМЯ(2024, 1, 1, 0, 0, 0))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК Месяц,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Сумма) КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза
	|	КОНЕЦ КАК НалоговаяБаза,
	|	НДФЛИмущественныеВычетыФизлиц.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета КАК КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК МесяцПериодаПредоставленияВычета
	|ПОМЕСТИТЬ ВТВычетыПоСтавкам
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|				И (ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НДФЛИмущественныеВычетыФизлиц.Период МЕЖДУ &НачалоНП И &КонецНП)
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛИмущественныеВычетыФизлиц.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ),
	|	НДФЛИмущественныеВычетыФизлиц.РегистрацияВНалоговомОргане,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Сумма),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.РегистрацияВНалоговомОргане,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцПериодаПредоставленияВычета
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|				И (ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация
	|			И ВТСписокФизЛицОрганизация.ФизическоеЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ ВТСписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.РегистрацияВНалоговомОргане,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцПериодаПредоставленияВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.ФизическоеЛицо КАК ФизическоеЛицо,
	|	База.НалоговаяБаза КАК НалоговаяБаза,
	|	База.Год КАК Год,
	|	База.НачалоГода КАК НачалоГода
	|ПОМЕСТИТЬ ВТСотрудникиСПревышением
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза,
	|		ДоходыПоСтавкам.Год КАК Год,
	|		НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Месяц, ГОД) КАК НачалоГода
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|	ГДЕ
	|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		И ДоходыПоСтавкам.Год >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале
	|		И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
	|		СтандартныеИмущественныеВычеты.НалоговаяБаза,
	|		-СтандартныеИмущественныеВычеты.СуммаВычета,
	|		ГОД(СтандартныеИмущественныеВычеты.Месяц),
	|		НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.Месяц, ГОД)
	|	ИЗ
	|		ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
	|	ГДЕ
	|		СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		И ГОД(СтандартныеИмущественныеВычеты.Месяц) >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале) КАК База
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПределыДляНалоговыхБаз КАК ПределыДляНалоговыхБаз
	|		ПО База.НалоговаяБаза = ПределыДляНалоговыхБаз.НалоговаяБаза
	|
	|СГРУППИРОВАТЬ ПО
	|	База.ФизическоеЛицо,
	|	База.НалоговаяБаза,
	|	База.Год,
	|	ПределыДляНалоговыхБаз.Предел1,
	|	База.НачалоГода
	|
	|ИМЕЮЩИЕ
	|	СУММА(База.ОблагаемаяБаза) > ВЫБОР
	|		КОГДА База.НачалоГода >= &ДатаЗакона176ФЗ
	|			ТОГДА ПределыДляНалоговыхБаз.Предел1
	|		ИНАЧЕ &Предел
	|	КОНЕЦ";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.Год КАК Год,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК НачалоМесяца,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
		|	0 КАК ОблагаемыйДоходСНачалаГода,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
		|	ЛОЖЬ КАК ПределПревышен
		|ИЗ
		|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
		|			И СведенияОДоходахНДФЛ.Год = СотрудникиСПревышением.Год
		|ГДЕ
		|	СведенияОДоходахНДФЛ.ОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ДатаПолученияДохода < &ДатаЗакона176ФЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.Год,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	НалоговаяБаза,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода";
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			ТаблицаРасчетаНарастающимИтогом = Результат.Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СтандартныеИмущественныеВычеты.СуммаВычета) КАК Сумма,
			|	СтандартныеИмущественныеВычеты.Месяц КАК НачалоМесяца
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ГОД(СтандартныеИмущественныеВычеты.Месяц) = СотрудникиСПревышением.Год)
			|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
			|ГДЕ
			|	СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
			|	И ГОД(СтандартныеИмущественныеВычеты.Месяц) >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале
			|	И СтандартныеИмущественныеВычеты.Месяц < &ДатаЗакона176ФЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза,
			|	СтандартныеИмущественныеВычеты.Месяц";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НалоговаяБаза,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца,НалоговаяБаза");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			ТекущийГод = Неопределено;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Или ТекущийГод <> СтрокаТаблицы.Год Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущийГод = СтрокаТаблицы.Год;
					ТекущееНачалоМесяца = Неопределено;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК ДатаПолученияДохода,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Год КАК Год,
			|	ДоходыПоСтавкам.Месяц КАК Месяц,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	ДоходыПоСтавкам.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.СтавкаЧислом КАК СтавкаЧислом,
			|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыПоСтавкам.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыПоСтавкам.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыПоСтавкам.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	ДоходыПоСтавкам.Период КАК Период,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.ДокументОснование КАК ДокументОснование,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.ДатаПолученияДохода = РасчетНарастающимИтогом.ДатаПолученияДохода
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|ГДЕ
			|	ДоходыПоСтавкам.ДатаПолученияДохода < &ДатаЗакона176ФЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза
			|ПОМЕСТИТЬ ВТФизлицаБезПереносаДат
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация
			|
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена) = ЛОЖЬ И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане) > 1 И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.ДокументОснование) > 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизлицаБезПереносаДат.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ФизлицаБезПереносаДат.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ФизлицаБезПереносаДат.Период КАК Период,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	ФизлицаБезПереносаДат.НалоговаяБаза КАК НалоговаяБаза
			|ПОМЕСТИТЬ ВТОтборОснований
			|ИЗ
			|	ВТФизлицаБезПереносаДат КАК ФизлицаБезПереносаДат
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ПО ФизлицаБезПереносаДат.ФизическоеЛицо = РасширенныеДанныеОДоходах.ФизическоеЛицо
			|			И ФизлицаБезПереносаДат.НалоговаяБаза = РасширенныеДанныеОДоходах.НалоговаяБаза
			|			И ФизлицаБезПереносаДат.Период = РасширенныеДанныеОДоходах.Период
			|			И ФизлицаБезПереносаДат.ГоловнаяОрганизация = РасширенныеДанныеОДоходах.ГоловнаяОрганизация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтборОснований.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ОтборОснований.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОтборОснований.Период КАК ДатаПолученияДохода,
			|	ОтборОснований.НалоговаяБаза КАК НалоговаяБаза,
			|	ОтборОснований.ДокументОснование КАК ДокументОснование,
			|	ВЫБОР
			|		КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) <> 0
			|				И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) = 0
			|			ТОГДА 1
			|		КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
			|				И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) = 0
			|			ТОГДА 2
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОписаниеДокумента
			|ПОМЕСТИТЬ ВТОснованияВДниПревышения
			|ИЗ
			|	ВТОтборОснований КАК ОтборОснований
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
			|		ПО ОтборОснований.ФизическоеЛицо = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо
			|			И ОтборОснований.КатегорияДохода = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода
			|			И ОтборОснований.Период = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода
			|			И ОтборОснований.ДокументОснование = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
			|			И ОтборОснований.ГоловнаяОрганизация = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация
			|ГДЕ
			|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтборОснований.ФизическоеЛицо,
			|	ОтборОснований.Период,
			|	ОтборОснований.НалоговаяБаза,
			|	ОтборОснований.ДокументОснование,
			|	ОтборОснований.ГоловнаяОрганизация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом КАК СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасширенныеДанныеОДоходах.ПределПревышен КАК ПределПревышен,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0) КАК ОписаниеДокументаСПревышением
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВДниПревышения КАК ОснованияВДниПревышения
			|		ПО РасширенныеДанныеОДоходах.ФизическоеЛицо = ОснованияВДниПревышения.ФизическоеЛицо
			|			И РасширенныеДанныеОДоходах.НалоговаяБаза = ОснованияВДниПревышения.НалоговаяБаза
			|			И РасширенныеДанныеОДоходах.ДокументОснование = ОснованияВДниПревышения.ДокументОснование
			|			И РасширенныеДанныеОДоходах.Период = ОснованияВДниПревышения.ДатаПолученияДохода
			|			И РасширенныеДанныеОДоходах.ГоловнаяОрганизация = ОснованияВДниПревышения.ГоловнаяОрганизация
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|	И РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год,
			|	РасширенныеДанныеОДоходах.Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела,
			|	РасширенныеДанныеОДоходах.ПределПревышен,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0),
			|	РасширенныеДанныеОДоходах.КатегорияДохода
			|
			|ИМЕЮЩИЕ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	Год,
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
			
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущийГод = Неопределено;
			СтрокиРаспределения = Новый Массив;
			ОблагаемыйДоходДоПредела = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущийГод <> СтрокаТаблицы.Год Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					Если ОблагаемыйДоходДоПредела <> 0 Тогда
						ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
					КонецЕсли;
					СтрокиРаспределения = Новый Массив;
					ОблагаемыйДоходДоПредела = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущийГод = СтрокаТаблицы.Год;
				КонецЕсли;
				Если ОблагаемыйДоходДоПредела = 0 Тогда
					ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
				КонецЕсли;
				СтрокиРаспределения.Добавить(СтрокаТаблицы);
			КонецЦикла;
			Если ОблагаемыйДоходДоПредела <> 0 Тогда
				ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год КАК Год,
			|	ДоходыСУточненнымиСтавками.Месяц КАК Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.ОписаниеДокументаСПревышением = 2
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.Ставка
			|	КОНЕЦ КАК Ставка,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.ОписаниеДокументаСПревышением = 2
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.СтавкаЧислом
			|	КОНЕЦ КАК СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДокументОснование КАК ДокументОснование,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаЧислом
			|	КОНЕЦ КАК СтавкаЧислом,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета,
			|	РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТВременнаяТаблица
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	(НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|			ИЛИ НЕ РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета,
			|	ИСТИНА,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДокументОснование,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаПеренесена,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета,
			|	ДоходыСУточненнымиСтавками.ОблагаетсяУНалоговогоАгента,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДокументОснование,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаПеренесена,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыСУточненнымиСтавками
			|ГДЕ
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблица.СтавкаЧислом КАК СтавкаЧислом,
			|	ВременнаяТаблица.Ставка КАК Ставка,
			|	ВременнаяТаблица.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ВременнаяТаблица.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ВременнаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.Год КАК Год,
			|	ВременнаяТаблица.Месяц КАК Месяц,
			|	ВременнаяТаблица.СуммаДохода КАК СуммаДохода,
			|	ВременнаяТаблица.СуммаВычета КАК СуммаВычета,
			|	ВременнаяТаблица.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	ВременнаяТаблица.КодДохода КАК КодДохода,
			|	ВременнаяТаблица.КодДоходаКод КАК КодДоходаКод,
			|	ВременнаяТаблица.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ВременнаяТаблица.МесяцНачисления КАК МесяцНачисления,
			|	ВременнаяТаблица.ДатаВыплаты КАК ДатаВыплаты,
			|	ВременнаяТаблица.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ВременнаяТаблица.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ВременнаяТаблица.ДатаНачисления КАК ДатаНачисления,
			|	ВременнаяТаблица.КодВычета КАК КодВычета,
			|	ВременнаяТаблица.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ВременнаяТаблица.НалоговаяБаза КАК НалоговаяБаза,
			|	ВременнаяТаблица.КатегорияДохода КАК КатегорияДохода,
			|	ВременнаяТаблица.ДокументОснование КАК ДокументОснование,
			|	ВременнаяТаблица.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ВременнаяТаблица.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица";
			Запрос.Выполнить();
			
			ТвблицыКУдалению = Новый Массив;
			ТвблицыКУдалению.Добавить("ВТРасчетНарастающимИтогом");
			ТвблицыКУдалению.Добавить("ВТРасширенныеДанныеОДоходах");
			ТвблицыКУдалению.Добавить("ВТФизлицаБезПереносаДат");
			ТвблицыКУдалению.Добавить("ВТОтборОснований");
			ТвблицыКУдалению.Добавить("ВТОснованияВДниПревышения");
			ТвблицыКУдалению.Добавить("ВТДоходыСУточненнымиСтавками");
			ТвблицыКУдалению.Добавить("ВТВременнаяТаблица");
			ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, ТвблицыКУдалению);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.Год КАК Год,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК НачалоМесяца,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела1,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела2,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела3,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела4,
		|	ЛОЖЬ КАК Предел1Превышен,
		|	ЛОЖЬ КАК Предел2Превышен,
		|	ЛОЖЬ КАК Предел3Превышен,
		|	ЛОЖЬ КАК Предел4Превышен,
		|	0 КАК ОблагаемыйДоходСНачалаГода
		|ИЗ
		|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
		|			И СведенияОДоходахНДФЛ.Год = СотрудникиСПревышением.Год
		|ГДЕ
		|	СведенияОДоходахНДФЛ.ОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.Год,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	НалоговаяБаза,
		|	Период";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			ТаблицаРасчетаНарастающимИтогом = Результат.Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СтандартныеИмущественныеВычеты.СуммаВычета) КАК Сумма,
			|	СтандартныеИмущественныеВычеты.Месяц КАК НачалоМесяца
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ГОД(СтандартныеИмущественныеВычеты.Месяц) = СотрудникиСПревышением.Год)
			|			И СтандартныеИмущественныеВычеты.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
			|ГДЕ
			|	СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
			|	И СтандартныеИмущественныеВычеты.Месяц >= &ДатаЗакона176ФЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза,
			|	СтандартныеИмущественныеВычеты.Месяц";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НалоговаяБаза,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НалоговаяБаза,НачалоМесяца");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			СоответствиеПараметровНалоговыхБаз = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкалеС2025Года().СоответствиеПараметровНалоговыхБаз;
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			ТекущийГод = Неопределено;
			Предел1 = 0; Предел2 = 0; Предел3 = 0; Предел4 = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Или ТекущийГод <> СтрокаТаблицы.Год Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущийГод = СтрокаТаблицы.Год;
					ТекущееНачалоМесяца = Неопределено;
					ПределыНалоговойБазы = СоответствиеПараметровНалоговыхБаз[СтрокаТаблицы.НалоговаяБаза];
					Предел1 = ПределыНалоговойБазы.Предел1;
					Предел2 = ПределыНалоговойБазы.Предел2;
					Предел3 = ПределыНалоговойБазы.Предел3;
					Предел4 = ПределыНалоговойБазы.Предел4;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела1 = ОблагаемыйДоходСНачалаГода < Предел1 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел1;
				Если Предел1 <> Предел2 Тогда
					СтрокаТаблицы.ЭтоДеньПревышенияПредела2 = ОблагаемыйДоходСНачалаГода < Предел2 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел2;
					Если Предел2 <> Предел3 Тогда
						СтрокаТаблицы.ЭтоДеньПревышенияПредела3 = ОблагаемыйДоходСНачалаГода < Предел3 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел3;
						Если Предел3 <> Предел4 Тогда
							СтрокаТаблицы.ЭтоДеньПревышенияПредела4 = ОблагаемыйДоходСНачалаГода < Предел4 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел4;
						Иначе 
							СтрокаТаблицы.ЭтоДеньПревышенияПредела4	= СтрокаТаблицы.ЭтоДеньПревышенияПредела3;
						КонецЕсли;
					Иначе 
						СтрокаТаблицы.ЭтоДеньПревышенияПредела3	= СтрокаТаблицы.ЭтоДеньПревышенияПредела2;
						СтрокаТаблицы.ЭтоДеньПревышенияПредела4	= СтрокаТаблицы.ЭтоДеньПревышенияПредела2;
					КонецЕсли;
				Иначе 
					СтрокаТаблицы.ЭтоДеньПревышенияПредела2	= СтрокаТаблицы.ЭтоДеньПревышенияПредела1;
					СтрокаТаблицы.ЭтоДеньПревышенияПредела3	= СтрокаТаблицы.ЭтоДеньПревышенияПредела1;
					СтрокаТаблицы.ЭтоДеньПревышенияПредела4	= СтрокаТаблицы.ЭтоДеньПревышенияПредела1;
				КонецЕсли;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.Предел1Превышен = ОблагаемыйДоходСНачалаГода > Предел1;
				Если Предел1 <> Предел2 Тогда
					СтрокаТаблицы.Предел2Превышен = ОблагаемыйДоходСНачалаГода > Предел2;
					Если Предел2 <> Предел3 Тогда
						СтрокаТаблицы.Предел3Превышен = ОблагаемыйДоходСНачалаГода > Предел3;
						Если Предел3 <> Предел4 Тогда
							СтрокаТаблицы.Предел4Превышен = ОблагаемыйДоходСНачалаГода > Предел4;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК ДатаПолученияДохода,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела1 КАК ЭтоДеньПревышенияПредела1,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела2 КАК ЭтоДеньПревышенияПредела2,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела3 КАК ЭтоДеньПревышенияПредела3,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела4 КАК ЭтоДеньПревышенияПредела4,
			|	РасчетНарастающимИтогом.Предел1Превышен КАК Предел1Превышен,
			|	РасчетНарастающимИтогом.Предел2Превышен КАК Предел2Превышен,
			|	РасчетНарастающимИтогом.Предел3Превышен КАК Предел3Превышен,
			|	РасчетНарастающимИтогом.Предел4Превышен КАК Предел4Превышен,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Год КАК Год,
			|	ДоходыПоСтавкам.Месяц КАК Месяц,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	ДоходыПоСтавкам.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.СтавкаЧислом КАК СтавкаЧислом,
			|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыПоСтавкам.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыПоСтавкам.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыПоСтавкам.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.ДокументОснование КАК ДокументОснование,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела1, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела1,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела2, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела2,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела3, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела3,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела4, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела4,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел1Превышен, ЛОЖЬ) КАК Предел1Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел2Превышен, ЛОЖЬ) КАК Предел2Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел3Превышен, ЛОЖЬ) КАК Предел3Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел4Превышен, ЛОЖЬ) КАК Предел4Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.ДатаПолученияДохода = РасчетНарастающимИтогом.ДатаПолученияДохода
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза
			|ПОМЕСТИТЬ ВТФизлицаБезПереносаДат
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	(РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация
			|
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена) = ЛОЖЬ И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане) > 1 И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.ДокументОснование) > 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизлицаБезПереносаДат.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ФизлицаБезПереносаДат.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ФизлицаБезПереносаДат.Период КАК Период,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	ФизлицаБезПереносаДат.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1 КАК ЭтоДеньПревышенияПредела1,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2 КАК ЭтоДеньПревышенияПредела2,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3 КАК ЭтоДеньПревышенияПредела3,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4 КАК ЭтоДеньПревышенияПредела4
			|ПОМЕСТИТЬ ВТОтборОснований
			|ИЗ
			|	ВТФизлицаБезПереносаДат КАК ФизлицаБезПереносаДат
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ПО ФизлицаБезПереносаДат.ФизическоеЛицо = РасширенныеДанныеОДоходах.ФизическоеЛицо
			|			И ФизлицаБезПереносаДат.НалоговаяБаза = РасширенныеДанныеОДоходах.НалоговаяБаза
			|			И ФизлицаБезПереносаДат.Период = РасширенныеДанныеОДоходах.ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтборОснований.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ОтборОснований.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОтборОснований.Период КАК ДатаПолученияДохода,
			|	ОтборОснований.НалоговаяБаза КАК НалоговаяБаза,
			|	ОтборОснований.ДокументОснование КАК ДокументОснование,
			|	ВЫБОР
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела1
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела2
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела3
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела4
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОписаниеДокумента
			|ПОМЕСТИТЬ ВТОснованияВДниПревышения
			|ИЗ
			|	ВТОтборОснований КАК ОтборОснований
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
			|		ПО ОтборОснований.ФизическоеЛицо = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо
			|			И ОтборОснований.КатегорияДохода = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода
			|			И ОтборОснований.Период = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода
			|			И ОтборОснований.ДокументОснование = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
			|			И ОтборОснований.ГоловнаяОрганизация = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация
			|ГДЕ
			|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтборОснований.ФизическоеЛицо,
			|	ОтборОснований.Период,
			|	ОтборОснований.НалоговаяБаза,
			|	ОтборОснований.ДокументОснование,
			|	ОтборОснований.ГоловнаяОрганизация,
			|	ОтборОснований.ЭтоДеньПревышенияПредела1,
			|	ОтборОснований.ЭтоДеньПревышенияПредела2,
			|	ОтборОснований.ЭтоДеньПревышенияПредела3,
			|	ОтборОснований.ЭтоДеньПревышенияПредела4
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом КАК СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК Период,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0) КАК ОписаниеДокументаСПревышением,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1 КАК ЭтоДеньПревышенияПредела1,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2 КАК ЭтоДеньПревышенияПредела2,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3 КАК ЭтоДеньПревышенияПредела3,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4 КАК ЭтоДеньПревышенияПредела4
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВДниПревышения КАК ОснованияВДниПревышения
			|		ПО РасширенныеДанныеОДоходах.ФизическоеЛицо = ОснованияВДниПревышения.ФизическоеЛицо
			|			И РасширенныеДанныеОДоходах.НалоговаяБаза = ОснованияВДниПревышения.НалоговаяБаза
			|			И РасширенныеДанныеОДоходах.ДокументОснование = ОснованияВДниПревышения.ДокументОснование
			|			И РасширенныеДанныеОДоходах.ДатаПолученияДохода = ОснованияВДниПревышения.ДатаПолученияДохода
			|			И РасширенныеДанныеОДоходах.ГоловнаяОрганизация = ОснованияВДниПревышения.ГоловнаяОрганизация
			|ГДЕ
			|	(РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4)
			|	И РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год,
			|	РасширенныеДанныеОДоходах.Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0)
			|
			|ИМЕЮЩИЕ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	ДатаПолученияДохода,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			
			ДоходыСУточненнымиСтавками = УчетНДФЛЗаполнениеОтчетности.ДополнительныеСтрокиПревышения(ТаблицаРасчетаНарастающимИтогом, Ложь, Ложь);
			Для каждого СтрокаТаблицы Из ДоходыСУточненнымиСтавками Цикл
				Если СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.15
				ИначеЕсли СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка18 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.18
				ИначеЕсли СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка20 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.20
				ИначеЕсли СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка22 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.22
				Иначе
					
				КонецЕсли;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год КАК Год,
			|	ДоходыСУточненнымиСтавками.Месяц КАК Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.Ставка КАК Ставка,
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом КАК СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.Предел4Превышен
			|			ТОГДА 0.22
			|		КОГДА РасширенныеДанныеОДоходах.Предел3Превышен
			|			ТОГДА 0.2
			|		КОГДА РасширенныеДанныеОДоходах.Предел2Превышен
			|			ТОГДА 0.18
			|		КОГДА РасширенныеДанныеОДоходах.Предел1Превышен
			|			ТОГДА 0.15
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаЧислом
			|	КОНЕЦ КАК СтавкаЧислом,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.Предел4Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
			|		КОГДА РасширенныеДанныеОДоходах.Предел3Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
			|		КОГДА РасширенныеДанныеОДоходах.Предел2Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
			|		КОГДА РасширенныеДанныеОДоходах.Предел1Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета,
			|	РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1
			|	И НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2
			|	И НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3
			|	И НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета,
			|	ИСТИНА,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
			Запрос.Выполнить();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) КАК ГОД,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНачислено,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения < НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|						ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов - НДФЛРасчетыСБюджетом.СуммаСПревышения
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогКЗачету,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогУдержано,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УдержаноКЗачетуПоСтавке13,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогПереданоНаВзыскание,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогВозвращено,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК Месяц,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.Ставка КАК Ставка,
	|	НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза КАК НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДанныеОНалогах
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения < НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|						ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|					ИНАЧЕ НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышения <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22 <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Авансы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Авансы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(Авансы.МесяцНалоговогоПериода) КАК ГОД,
	|	Авансы.Сумма КАК Зачтено,
	|	Авансы.МесяцНалоговогоПериода КАК Месяц,
	|	Авансы.Период КАК Период,
	|	Авансы.Ставка КАК Ставка,
	|	Авансы.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	Авансы.НалоговаяБаза КАК НалоговаяБаза,
	|	Авансы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДанныеОЗачтенныхАвансах
	|ИЗ
	|	ВТСтрокиАвансов КАК Авансы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахПоРазделам.Месяц КАК Месяц,
	|	СУММА(СведенияОДоходахПоРазделам.СуммаДохода) КАК СуммаДохода,
	|	СведенияОДоходахПоРазделам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДоходыПоМесяцамПоСтавке13Итог
	|ИЗ
	|	ВТДоходыПоСтавкам КАК СведенияОДоходахПоРазделам
	|ГДЕ
	|	СведенияОДоходахПоРазделам.ДоходРазделаПо13
	|	И СведенияОДоходахПоРазделам.ОблагаетсяУНалоговогоАгента
	|	И (СведенияОДоходахПоРазделам.Месяц < &ДатаЗакона176ФЗ
	|			ИЛИ СведенияОДоходахПоРазделам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда))
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизическоеЛицо,
	|	СведенияОДоходахПоРазделам.Месяц,
	|	СведенияОДоходахПоРазделам.РегистрацияВНалоговомОргане
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыПоСтавкам.Год КАК Год,
	|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ДоходыПоСтавкам.Месяц КАК Месяц,
	|	ДоходыПоСтавкам.Ставка КАК Ставка,
	|	ЕСТЬNULL(МАКСИМУМ(ПредыдущийМесяц.Месяц), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Месяц, ГОД), СЕКУНДА, -1)) КАК ПредыдущийМесяц,
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДоходыПо13
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ПредыдущийМесяц
	|		ПО ДоходыПоСтавкам.ГоловнаяОрганизация = ПредыдущийМесяц.ГоловнаяОрганизация
	|			И ДоходыПоСтавкам.ФизическоеЛицо = ПредыдущийМесяц.ФизическоеЛицо
	|			И ДоходыПоСтавкам.Год = ПредыдущийМесяц.Год
	|			И ДоходыПоСтавкам.НалоговаяБаза = ПредыдущийМесяц.НалоговаяБаза
	|			И ДоходыПоСтавкам.Месяц > ПредыдущийМесяц.Месяц
	|			И ДоходыПоСтавкам.РегистрацияВНалоговомОргане = ПредыдущийМесяц.РегистрацияВНалоговомОргане
	|			И ДоходыПоСтавкам.ДоходРазделаПо13 = ПредыдущийМесяц.ДоходРазделаПо13
	|			И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента = ПредыдущийМесяц.ОблагаетсяУНалоговогоАгента
	|ГДЕ
	|	ДоходыПоСтавкам.ДоходРазделаПо13
	|	И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоСтавкам.ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизическоеЛицо,
	|	ДоходыПоСтавкам.НалоговаяБаза,
	|	ДоходыПоСтавкам.Год,
	|	ДоходыПоСтавкам.Месяц,
	|	ДоходыПоСтавкам.Ставка,
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПо13.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПо13.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыПо13.Год КАК Год,
	|	ДоходыПо13.Месяц КАК Месяц,
	|	ДоходыПо13.НалоговаяБаза КАК НалоговаяБаза,
	|	ДоходыПо13.Ставка КАК Ставка,
	|	ДоходыПо13.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ДоходыПоСтавкам.СуммаДохода) КАК СуммаДохода,
	|	СУММА(ДоходыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ПОМЕСТИТЬ ВТДоходыДоПолученияСтатусаРезидента
	|ИЗ
	|	ВТДоходыПо13 КАК ДоходыПо13
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ПО ДоходыПо13.ГоловнаяОрганизация = ДоходыПоСтавкам.ГоловнаяОрганизация
	|			И ДоходыПо13.ФизическоеЛицо = ДоходыПоСтавкам.ФизическоеЛицо
	|			И (ДоходыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И ДоходыПо13.Месяц > ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.ПредыдущийМесяц < ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.Год = ДоходыПоСтавкам.Год
	|			И ДоходыПо13.НалоговаяБаза = ДоходыПоСтавкам.НалоговаяБаза
	|			И ДоходыПо13.РегистрацияВНалоговомОргане = ДоходыПоСтавкам.РегистрацияВНалоговомОргане
	|			И (ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПо13.Год,
	|	ДоходыПо13.ГоловнаяОрганизация,
	|	ДоходыПо13.ФизическоеЛицо,
	|	ДоходыПо13.Месяц,
	|	ДоходыПо13.НалоговаяБаза,
	|	ДоходыПо13.Ставка,
	|	ДоходыПо13.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Период,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РеквизитыПлатежногоПоручения КАК РеквизитыПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбособленныеПодразделения КАК СписокФизЛицОрганизация
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация = СписокФизЛицОрганизация.Организация
	|ГДЕ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма <> 0
	|	И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК Месяц,
	|	МИНИМУМ(ДанныеОНалогах.Период) КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.ГОД КАК ГОД,
	|	ДанныеОНалогах.Месяц КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК Ставка,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК Налог,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТУдержаноНДФЛПоМесяцам
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.Месяц < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.ГОД,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ДанныеОНалогах.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТПеречисленоНДФЛПоМесяцам
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Перечислено.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Перечислено.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Перечислено.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	Перечислено.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Перечислено.Сумма - (ВЫРАЗИТЬ(Перечислено.Сумма * ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) / (ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0)) КАК ЧИСЛО(22, 0)))
	|	КОНЕЦ КАК КЗачетуПоСтавке13
	|ПОМЕСТИТЬ ВТКЗачетуПоПеречислениям
	|ИЗ
	|	ВТПеречисленоНДФЛПоМесяцам КАК Перечислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке13
	|		ПО Перечислено.ФизическоеЛицо = УдержаноНДФЛПоСтавке13.ФизическоеЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке13.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке13.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке13.ГоловнаяОрганизация
	|			И Перечислено.РегистрацияВНалоговомОргане = УдержаноНДФЛПоСтавке13.РегистрацияВНалоговомОргане
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке30
	|		ПО Перечислено.ФизическоеЛицо = УдержаноНДФЛПоСтавке30.ФизическоеЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке30.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке30.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке30.ГоловнаяОрганизация
	|			И Перечислено.РегистрацияВНалоговомОргане = УдержаноНДФЛПоСтавке30.РегистрацияВНалоговомОргане
	|ГДЕ
	|	Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецНП КАК Период,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета
	|ПОМЕСТИТЬ ВТСтандартныеВычетыВсе
	|ИЗ
	|	ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТВсеРегистрации
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОЗачтенныхАвансах.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОЗачтенныхАвансах КАК ДанныеОЗачтенныхАвансах";
	Запрос.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"РазмерВычетовНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСтандартныеВычетыВсе",
			"Период,КодВычета"));
			
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗачтенныеАвансы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЗачтенныеАвансы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗачтенныеАвансы.Месяц КАК Месяц,
	|	ЗачтенныеАвансы.Период КАК Дата,
	|	ЗачтенныеАвансы.Ставка КАК Ставка,
	|	ЗачтенныеАвансы.Зачтено КАК ЗачтеноАвансов,
	|	ЗачтенныеАвансы.НалоговаяБаза КАК НалоговаяБаза,
	|	ЗачтенныеАвансы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЗачтенныеАвансы.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода
	|ИЗ
	|	ВТДанныеОЗачтенныхАвансах КАК ЗачтенныеАвансы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацииВНалоговомОргане.КодПоОКАТО КАК КодПоОКАТО,
	|	РегистрацииВНалоговомОргане.КодПоОКТМО КАК КодПоОКТМО,
	|	РегистрацииВНалоговомОргане.КПП КАК КПП,
	|	РегистрацииВНалоговомОргане.Ссылка КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Ссылка В
	|			(ВЫБРАТЬ
	|				ВсеРегистрации.РегистрацияВНалоговомОргане
	|			ИЗ
	|				ВТВсеРегистрации КАК ВсеРегистрации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВычетыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|ГДЕ
	|	ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.НалоговаяБаза,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц
	|ИТОГИ
	|	СУММА(СуммаВычета)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Месяц,
	|	СтатусФизЛицНаКонецМесяца.Статус КАК Статус
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	Месяц
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПодтверждения.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерУведомления) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = ВТСписокФизЛицОрганизация.ФизическоеЛицо
	|				И НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация = ВТСписокФизЛицОрганизация.ГоловнаяОрганизация
	|				И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	|					ИЛИ НДФЛИмущественныеВычетыФизлиц.Организация = ВТСписокФизЛицОрганизация.Организация)
	|				И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|				И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация) КАК ДокументыПодтверждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|		ПО ДокументыПодтверждения.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|			И ДокументыПодтверждения.ФизическоеЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыПодтверждения.ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизическоеЛицо
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата КАК ДатаСправки,
	|	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки) КАК НомерСправки,
	|	МаксимальныеДатыСправок.Сотрудник КАК ФизическоеЛицо,
	|	1 КАК ТипСправки,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетностьЗаРеорганизованнуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетность)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане) КАК МаксимальныеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|			И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата,
	|	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки),
	|	МаксимальныеДатыСправок.Сотрудник,
	|	3,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛЗаРеорганизованнуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛ)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане) КАК МаксимальныеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|			И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоследниеДатыСправок.Дата,
	|	МАКСИМУМ(СправкаПоНДФЛСотруднику.Номер),
	|	ПоследниеДатыСправок.ФизическоеЛицо,
	|	2,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|		МАКСИМУМ(СправкаПоНДФЛСотруднику.Дата) КАК Дата
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛ КАК СправкаПоНДФЛСотруднику
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛСотруднику.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛСотруднику.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛСотруднику.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокФизЛицОрганизация.ФизическоеЛицо) КАК ПоследниеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛ КАК СправкаПоНДФЛСотруднику
	|		ПО ПоследниеДатыСправок.Дата = СправкаПоНДФЛСотруднику.Дата
	|			И ПоследниеДатыСправок.ФизическоеЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|			И (СправкаПоНДФЛСотруднику.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДатыСправок.ФизическоеЛицо,
	|	ПоследниеДатыСправок.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ТипСправки
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтандартныеВычетыФизЛицОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтандартныеВычетыФизЛицОрганизации.Месяц КАК Месяц,
	|	ВЫБОР
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычета,
	|	СтандартныеВычетыФизЛицОрганизации.КоличествоДетей КАК КоличествоДетей,
	|	СтандартныеВычетыФизЛицОрганизации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(СтандартныеВычетыФизЛицОрганизации.КоличествоДетей, 1) * ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0) КАК Размер,
	|	ВЫРАЗИТЬ(СтандартныеВычетыФизЛицОрганизации.Основание КАК СТРОКА(1000)) КАК Основание
	|ИЗ
	|	ВТСтандартныеВычетыФизЛицОрганизации КАК СтандартныеВычетыФизЛицОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРазмерВычетовНДФЛСрезПоследних КАК НДФЛРазмерВычетовСрезПоследних
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО СтандартныеВычетыФизЛицОрганизации.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И СтандартныеВычетыФизЛицОрганизации.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовНДФЛ КАК ВидыВычетовНДФЛ
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = ВидыВычетовНДФЛ.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	КодВычета,
	|	Месяц
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СоциальныеИИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКод,
	|	СоциальныеИИмущественныеВычеты.Размер КАК Размер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерУведомления) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(СоциальныеИИмущественныеВычеты.Дата, МЕСЯЦ) = СтатусФизЛицНаКонецМесяца.Месяц
	|				ТОГДА СоциальныеИИмущественныеВычеты.Дата
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Месяц
	|		КОНЕЦ) КАК Дата
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоциальныеИИмущественныеВычеты КАК СоциальныеИИмущественныеВычеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|			ПО СоциальныеИИмущественныеВычеты.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|				И СоциальныеИИмущественныеВычеты.ФизическоеЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Сотрудник
	|		ПО СтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СоциальныеИИмущественныеВычеты.ФизическоеЛицо
	|			И (КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) >= СоциальныеИИмущественныеВычеты.Дата)
	|ГДЕ
	|	СтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоциальныеИИмущественныеВычеты.ФизическоеЛицо,
	|	СоциальныеИИмущественныеВычеты.Размер,
	|	СоциальныеИИмущественныеВычеты.Дата,
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	КодВычетаКод,
	|	Дата
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Доходы.Раздел КАК Раздел,
	|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	МАКСИМУМ(Доходы.СуммаДоходаДоРезидентства) КАК СуммаДоходаДоРезидентства,
	|	МАКСИМУМ(Доходы.СуммаВычетаДоРезидентства) КАК СуммаВычетаДоРезидентства,
	|	МАКСИМУМ(Доходы.ОблагаемаяСуммаДоходаДоРезидентства) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|	Доходы.ДатаНачисления КАК ДатаНачисления,
	|	Доходы.МесяцНачисления КАК МесяцНачисления,
	|	Доходы.ДатаВыплаты КАК ДатаВыплаты,
	|	Доходы.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	Доходы.КодДоходаСсылка КАК КодДоходаСсылка,
	|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
	|	Доходы.КодВычетаСсылка КАК КодВычетаСсылка,
	|	СУММА(Доходы.СуммаВычета) КАК СуммаВычета,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.ОблагаетсяУНалоговогоАгента
	|				ТОГДА Доходы.ОблагаемаяСуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяСуммаДохода,
	|	СУММА(Доходы.НалогНачислено) КАК НалогНачислено,
	|	Доходы.КодДохода КАК КодДохода,
	|	Доходы.КодВычета КАК КодВычета,
	|	Доходы.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА Доходы.НалоговаяБаза
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА &ОбъединеннаяНалоговаяБазаСтрокой
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПредставлениеНалоговойБазы
	|	КОНЕЦ КАК НалоговаяБаза,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|						ТОГДА 1
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки)
	|						ТОГДА 2
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ)
	|						ТОГДА 3
	|					ИНАЧЕ 4
	|				КОНЕЦ
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПорядокНалоговойБазы
	|	КОНЕЦ КАК ПорядокНалоговойБазы,
	|	Доходы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода13,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода15,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода18,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода20,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода22,
	|	СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ НЕ NULL  КАК ЭтоФизическоеЛицоСПревышением,
	|	ВЫБОР
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА 13
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА 15
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|			ТОГДА 18
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|			ТОГДА 20
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|			ТОГДА 22
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокСтавки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыПоМесяцам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		ДоходыПоМесяцам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		""Раздел4_Ставка13"" КАК Раздел,
	|		ДоходыПоМесяцам.Месяц КАК МесяцНалоговогоПериода,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) КАК СуммаДоходаДоРезидентства,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0) КАК СуммаВычетаДоРезидентства,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) - ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|		ДоходыПоМесяцам.ДатаНачисления КАК ДатаНачисления,
	|		ДоходыПоМесяцам.МесяцНачисления КАК МесяцНачисления,
	|		ДоходыПоМесяцам.ДатаВыплаты КАК ДатаВыплаты,
	|		ДоходыПоМесяцам.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|		ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|		ДоходыПоМесяцам.КодДохода КАК КодДоходаСсылка,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) КАК СуммаДохода,
	|		ДоходыПоМесяцам.КодВычета КАК КодВычетаСсылка,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0) КАК СуммаВычета,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0) КАК ОблагаемаяСуммаДохода,
	|		0 КАК НалогНачислено,
	|		ДоходыПоМесяцам.КодДоходаКодДляОтчетности КАК КодДохода,
	|		ДоходыПоМесяцам.КодВычетаКодДляОтчетности КАК КодВычета,
	|		ДоходыПоМесяцам.Ставка КАК Ставка,
	|		ДоходыПоМесяцам.НалоговаяБаза КАК НалоговаяБаза,
	|		ДоходыПоМесяцам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|		ДоходыПоМесяцам.Год КАК Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДоПолученияСтатусаРезидента КАК ДоходыДоПолученияСтатусаРезидента
	|			ПО ДоходыПоМесяцам.ГоловнаяОрганизация = ДоходыДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ДоходыПоМесяцам.ФизическоеЛицо = ДоходыДоПолученияСтатусаРезидента.ФизическоеЛицо
	|				И ДоходыПоМесяцам.Год = ДоходыДоПолученияСтатусаРезидента.Год
	|				И ДоходыПоМесяцам.Месяц = ДоходыДоПолученияСтатусаРезидента.Месяц
	|				И ДоходыПоМесяцам.РегистрацияВНалоговомОргане = ДоходыДоПолученияСтатусаРезидента.РегистрацияВНалоговомОргане
	|				И ДоходыПоМесяцам.Ставка = ДоходыДоПолученияСтатусаРезидента.Ставка
	|				И ДоходыПоМесяцам.НалоговаяБаза = ДоходыДоПолученияСтатусаРезидента.НалоговаяБаза
	|	ГДЕ
	|		ДоходыПоМесяцам.ДоходРазделаПо13
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоходыПоМесяцам.ГоловнаяОрганизация,
	|		ДоходыПоМесяцам.ФизическоеЛицо,
	|		ВЫБОР
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|				ТОГДА ""Раздел4_Ставка13""
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|				ТОГДА ""Раздел4_Дивиденды""
	|			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				ТОГДА ""Раздел4_Ставка30""
	|			ИНАЧЕ ""Раздел4_Ставка35_15_9""
	|		КОНЕЦ,
	|		ДоходыПоМесяцам.Месяц,
	|		0,
	|		0,
	|		0,
	|		ДоходыПоМесяцам.ДатаНачисления,
	|		ДоходыПоМесяцам.МесяцНачисления,
	|		ДоходыПоМесяцам.ДатаВыплаты,
	|		ДоходыПоМесяцам.ДатаПолученияДохода,
	|		ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента,
	|		ДоходыПоМесяцам.КодДохода,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|		ДоходыПоМесяцам.КодВычета,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|		ВЫБОР
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|				ТОГДА 0
	|			КОГДА НЕ ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|				ТОГДА 0
	|			ИНАЧЕ (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * ДоходыПоМесяцам.СтавкаЧислом
	|		КОНЕЦ,
	|		ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|		ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|		ДоходыПоМесяцам.Ставка,
	|		ДоходыПоМесяцам.НалоговаяБаза,
	|		ДоходыПоМесяцам.РегистрацияВНалоговомОргане,
	|		ДоходыПоМесяцам.Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|	ГДЕ
	|		НЕ ДоходыПоМесяцам.ДоходРазделаПо13
	|		И НЕ ДоходыПоМесяцам.ДатаПолученияДоходаФиксирована) КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеНалоговыхБаз КАК ОписаниеНалоговыхБаз
	|		ПО Доходы.НалоговаяБаза = ОписаниеНалоговыхБаз.КатегорияДохода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
	|		ПО Доходы.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
	|			И Доходы.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
	|			И Доходы.Год = СотрудникиСПревышением.Год
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ФизическоеЛицо,
	|	Доходы.ГоловнаяОрганизация,
	|	Доходы.Раздел,
	|	Доходы.МесяцНалоговогоПериода,
	|	Доходы.ДатаНачисления,
	|	Доходы.МесяцНачисления,
	|	Доходы.ДатаВыплаты,
	|	Доходы.ДатаПолученияДохода,
	|	Доходы.КодДоходаСсылка,
	|	Доходы.КодВычетаСсылка,
	|	Доходы.Ставка,
	|	Доходы.КодВычета,
	|	Доходы.РегистрацияВНалоговомОргане,
	|	Доходы.КодДохода,
	|	СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ НЕ NULL ,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА Доходы.НалоговаяБаза
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА &ОбъединеннаяНалоговаяБазаСтрокой
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПредставлениеНалоговойБазы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|						ТОГДА 1
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки)
	|						ТОГДА 2
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ)
	|						ТОГДА 3
	|					ИНАЧЕ 4
	|				КОНЕЦ
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПорядокНалоговойБазы
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(Доходы.СуммаДоходаДоРезидентства) <> 0
	|		ИЛИ МАКСИМУМ(Доходы.СуммаВычетаДоРезидентства) <> 0
	|		ИЛИ МАКСИМУМ(Доходы.ОблагаемаяСуммаДоходаДоРезидентства) <> 0
	|		ИЛИ СУММА(Доходы.СуммаДохода) <> 0
	|		ИЛИ СУММА(Доходы.СуммаВычета) <> 0
	|		ИЛИ СУММА(Доходы.ОблагаемаяСуммаДохода) <> 0
	|		ИЛИ СУММА(Доходы.НалогНачислено) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|			ТОГДА ""Раздел4_Ставка30""
	|		КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА ""Раздел4_Дивиденды""
	|		ИНАЧЕ ""Раздел4_Ставка35_15_9""
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.Месяц,
	|	0,
	|	0,
	|	0,
	|	ДоходыПоМесяцам.ДатаНачисления,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДохода,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|	ДоходыПоМесяцам.КодВычета,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|			ТОГДА ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * ДоходыПоМесяцам.СтавкаЧислом
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	"""",
	|	99,
	|	ДоходыПоМесяцам.РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ДоходыПоМесяцам.СуммаДохода
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА ДоходыПоМесяцам.СуммаДохода
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	99
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|ГДЕ
	|	НЕ ДоходыПоМесяцам.ДоходРазделаПо13
	|	И ДоходыПоМесяцам.ДатаПолученияДоходаФиксирована
	|	И ДоходыПоМесяцам.СуммаДохода <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Раздел,
	|	ПорядокНалоговойБазы,
	|	МесяцНалоговогоПериода,
	|	МесяцНачисления,
	|	ДатаНачисления,
	|	ДатаВыплаты,
	|	КодДохода,
	|	КодВычета,
	|	ПорядокСтавки
	|ИТОГИ
	|	МАКСИМУМ(СуммаДоходаДоРезидентства),
	|	МАКСИМУМ(СуммаВычетаДоРезидентства),
	|	МАКСИМУМ(ОблагаемаяСуммаДоходаДоРезидентства),
	|	СУММА(СуммаДохода),
	|	СУММА(СуммаВычета),
	|	СУММА(ОблагаемаяСуммаДохода),
	|	МАКСИМУМ(НалогНачислено),
	|	СУММА(СуммаДохода13),
	|	СУММА(СуммаДохода15),
	|	СУММА(СуммаДохода18),
	|	СУММА(СуммаДохода20),
	|	СУММА(СуммаДохода22),
	|	МАКСИМУМ(ЭтоФизическоеЛицоСПревышением)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Раздел,
	|	НалоговаяБаза,
	|	МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	ВычетыПоСтавкам.МесяцПериодаПредоставленияВычета КАК МесяцПериодаПредоставленияВычета,
	|	ВычетыПоСтавкам.КодВычета КАК КодВычетаСсылка,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыПоМесяцамПоСтавке13Итог.СуммаДохода, 0)) КАК СуммаДохода,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	ВычетыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцамПоСтавке13Итог КАК ДоходыПоМесяцамПоСтавке13Итог
	|		ПО (ДоходыПоМесяцамПоСтавке13Итог.ГоловнаяОрганизация = ВычетыПоСтавкам.ГоловнаяОрганизация)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.ФизическоеЛицо = ВычетыПоСтавкам.ФизическоеЛицо)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.Месяц = ВычетыПоСтавкам.Месяц)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.РегистрацияВНалоговомОргане = ВычетыПоСтавкам.РегистрацияВНалоговомОргане)
	|			И (ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.КодВычета,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.НалоговаяБаза,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.МесяцПериодаПредоставленияВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц,
	|	МесяцПериодаПредоставленияВычета,
	|	КодВычета
	|ИТОГИ
	|	СУММА(СуммаВычета),
	|	МАКСИМУМ(СуммаДохода)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	СУММА(ДанныеОНалогах.НалогНачислено) КАК НалогНачислено,
	|	СУММА(ДанныеОНалогах.НалогКЗачету) КАК НалогКЗачету,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА 13
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА 15
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|			ТОГДА 18
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|			ТОГДА 20
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|			ТОГДА 22
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокСтавки
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеОНалогах.НалогНачислено) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	ПорядокСтавки,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА 13
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА 15
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|			ТОГДА 18
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|			ТОГДА 20
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|			ТОГДА 22
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокСтавки,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаНачалаРасчетаСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ КАК СрокПеречисления,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК НалогУдержано,
	|	СУММА(ДанныеОНалогах.УдержаноКЗачетуПоСтавке13) КАК КЗачетуПоСтавке13,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогУдержано <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаНачалаРасчетаСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	ПорядокСтавки,
	|	Ставка,
	|	СрокПеречисления
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	ДанныеОНалогах.НалогВозвращено КАК НалогВозвращено,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогВозвращено <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	ДанныеОНалогах.НалогПереданоНаВзыскание КАК НалогПереданоНаВзыскание,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогПереданоНаВзыскание <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Месяц,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Дата,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	ЕСТЬNULL(ПеречисленоДоПолученияСтатусаРезидента.КЗачетуПоСтавке13, 0) КАК КЗачетуПоСтавке13,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РеквизитыПП КАК РеквизитыПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц КАК ПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКЗачетуПоПеречислениям КАК ПеречисленоДоПолученияСтатусаРезидента
	|			ПО ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация = ПеречисленоДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизическоеЛицо = ПеречисленоДоПолученияСтатусаРезидента.ФизическоеЛицо
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц = ПеречисленоДоПолученияСтатусаРезидента.МесяцНалоговогоПериода
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.РегистрацияВНалоговомОргане = ПеречисленоДоПолученияСтатусаРезидента.РегистрацияВНалоговомОргане
	|				И (ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизическоеЛицо
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.РегистрацияВНалоговомОргане
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	КодВычета
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо;  
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокСтавок.Ставка КАК Ставка,
	|	ВТ_ПорядокСтавок.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТ_ПорядокСтавок
	|ИЗ
	|	&ВТ_ПорядокСтавок КАК ВТ_ПорядокСтавок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДоходыДоПолученияСтатусаРезидента.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТДоходыДоПолученияСтатусаРезидента.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТДоходыДоПолученияСтатусаРезидента.Год КАК Год,
	|	ВТДоходыДоПолученияСтатусаРезидента.Месяц КАК Месяц,
	|	ВТДоходыДоПолученияСтатусаРезидента.Ставка КАК Ставка,
	|	ВТ_ПорядокСтавок.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТ_Выборка_ПоследняяСтавка
	|ИЗ
	|	ВТДоходыДоПолученияСтатусаРезидента КАК ВТДоходыДоПолученияСтатусаРезидента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПорядокСтавок КАК ВТ_ПорядокСтавок
	|		ПО ВТДоходыДоПолученияСтатусаРезидента.Ставка = ВТ_ПорядокСтавок.Ставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ВТ_Выборка_ПоследняяСтавка.Месяц) КАК Месяц,
	|	МАКСИМУМ(ВТ_ПорядокСтавок.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_Выборка_ПоследняяСтавка_МаксМес
	|ИЗ
	|	ВТ_Выборка_ПоследняяСтавка КАК ВТ_Выборка_ПоследняяСтавка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокСтавок КАК ВТ_ПорядокСтавок
	|		ПО ВТ_Выборка_ПоследняяСтавка.Ставка = ВТ_ПорядокСтавок.Ставка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_Выборка_ПоследняяСтавка.Год КАК Год,
	|	ВТ_Выборка_ПоследняяСтавка.Месяц КАК Месяц,
	|	ВТ_Выборка_ПоследняяСтавка.Ставка КАК Ставка
	|ИЗ
	|	ВТ_Выборка_ПоследняяСтавка_МаксМес КАК ВТ_Выборка_ПоследняяСтавка_МаксМес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Выборка_ПоследняяСтавка КАК ВТ_Выборка_ПоследняяСтавка
	|		ПО ВТ_Выборка_ПоследняяСтавка_МаксМес.Месяц = ВТ_Выборка_ПоследняяСтавка.Месяц
	|			И ВТ_Выборка_ПоследняяСтавка_МаксМес.ГоловнаяОрганизация = ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация
	|			И ВТ_Выборка_ПоследняяСтавка_МаксМес.ФизическоеЛицо = ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо
	|			И ВТ_Выборка_ПоследняяСтавка_МаксМес.Порядок = ВТ_Выборка_ПоследняяСтавка.Порядок";
	
	
	
	
	//RSN_ОбщегоНазначенияНаСервере.СохранитьЗапрос(Запрос);
		
	Результат = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результат.Количество();
	ТЗНДФЛ = Результат[19].Выгрузить();
	ЗаписьЖР(СобытиеЖР, "Конец сбора данных по зарплате");
	
	Возврат  ТЗНДФЛ;
	
				
Конецфункции
 
Процедура ВыделитьСуммыПревышенияПредела(Знач ОблагаемыйДоходДоПредела, СтрокиРаспределения, СтрокиДоходовПревышающихПредел) 

	Если ОблагаемыйДоходДоПредела = 0 Или СтрокиРаспределения.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Вставить("СтавкаНалога", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом * 100);
	
	ОблагаемыйДоходЗаДень = СтрокиРаспределения[0].ОблагаемыйДоходЗаДень;
	
	СтрокиДляРаспределения = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиРаспределения Цикл
		Если СтрокаТаблицы.ОписаниеДокументаСПревышением = 1 Тогда
			ОблагаемыйДоходЗаДень = ОблагаемыйДоходЗаДень - СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
			ОблагаемыйДоходДоПредела = ОблагаемыйДоходДоПредела - СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
		ИначеЕсли СтрокаТаблицы.ОписаниеДокументаСПревышением = 2 Тогда
			ОблагаемыйДоходЗаДень = ОблагаемыйДоходЗаДень - СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
		Иначе
			СтрокиДляРаспределения.Добавить(СтрокаТаблицы)
		КонецЕсли;
	КонецЦикла;
	
	Если ОблагаемыйДоходДоПредела = 0 Или ОблагаемыйДоходЗаДень = 0 Или СтрокиДляРаспределения.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Если СтрокиДляРаспределения.Количество() = 1 Тогда
		СтрокаТаблицы = СтрокиДляРаспределения[0];
		СтрокаПревышения = СтрокиДоходовПревышающихПредел.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПревышения, СтрокаТаблицы);
		СтрокаТаблицы.СуммаДохода = ОблагаемыйДоходДоПредела;
		Если СтрокаТаблицы.СуммаВычета <> 0 Тогда
			СтрокаТаблицы.СуммаВычета = Окр(СтрокаТаблицы.СуммаВычета * ОблагаемыйДоходДоПредела / ОблагаемыйДоходЗаДень, 2);
			СтрокаТаблицы.СуммаДохода = СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаПревышения, ПараметрыРасчетаНДФЛПоПрогрессивнойШкале);
		СтрокаПревышения.СуммаДохода = СтрокаПревышения.СуммаДохода - СтрокаТаблицы.СуммаДохода;
		Если СтрокаПревышения.СуммаВычета <> 0 Тогда
			СтрокаПревышения.СуммаВычета = СтрокаПревышения.СуммаВычета - СтрокаТаблицы.СуммаВычета;
		КонецЕсли;
	Иначе
		
		МаксимальныйКоэффициент = 0;
		РаспределеннаяСумма = 0;
		РаспределенныеДоходы = Новый Соответствие;
		Для Каждого СтрокаТаблицы Из СтрокиДляРаспределения Цикл
			АбсолютноеЗначениеКоэффициента = (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета) * (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета);
			Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
				МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
				СтрокаМаксимальногоКоэффициента = СтрокаТаблицы;
			КонецЕсли;
			СуммаСтроки = Окр(ОблагаемыйДоходДоПредела * (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета) / ОблагаемыйДоходЗаДень, 2, 1);
			РаспределенныеДоходы.Вставить(СтрокаТаблицы, СуммаСтроки);
			РаспределеннаяСумма = РаспределеннаяСумма + СуммаСтроки;
		КонецЦикла;
		Если Не РаспределеннаяСумма = ОблагаемыйДоходДоПредела Тогда
			РаспределенныеДоходы.Вставить(СтрокаМаксимальногоКоэффициента, РаспределенныеДоходы[СтрокаМаксимальногоКоэффициента] + ОблагаемыйДоходДоПредела - РаспределеннаяСумма)
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из СтрокиДляРаспределения Цикл
			Если СтрокаТаблицы.СуммаДохода = СтрокаТаблицы.СуммаВычета Тогда
				 Продолжить;
			КонецЕсли;
			СтрокаПревышения = СтрокиДоходовПревышающихПредел.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПревышения, СтрокаТаблицы);
			Если СтрокаТаблицы.СуммаВычета <> 0 И СтрокаТаблицы.СуммаДохода <> 0 Тогда
				СтрокаТаблицы.СуммаВычета = Окр(СтрокаТаблицы.СуммаВычета * РаспределенныеДоходы[СтрокаТаблицы] / (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета), 2);
			КонецЕсли;
			СтрокаТаблицы.СуммаДохода = РаспределенныеДоходы[СтрокаТаблицы];
			Если СтрокаТаблицы.СуммаВычета <> 0 И СтрокаТаблицы.СуммаДохода <> 0 Тогда
				СтрокаТаблицы.СуммаДохода = СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаПревышения, ПараметрыРасчетаНДФЛПоПрогрессивнойШкале);
			СтрокаПревышения.СуммаДохода = СтрокаПревышения.СуммаДохода - СтрокаТаблицы.СуммаДохода;
			Если СтрокаПревышения.СуммаВычета <> 0 Тогда
				СтрокаПревышения.СуммаВычета = СтрокаПревышения.СуммаВычета - СтрокаТаблицы.СуммаВычета;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

//ОбновитьИнформациювSD
  
Процедура ОбновитьИнформациювSD()

	СобытиеЖР = "ХД.ОбновитьИнформациювSD";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ОбновитьИнформациювSD";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	token_work   = "7A8107BF-8ED3-460A-B6B9-6A994276AC9A";  
	
	Рез = ВыборкаОбновления();
	
	ВыполнитьHttpОбновить(token_work, Рез);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Функция ВыполнитьHttpОбновить(token_work, Рез)
	
	Путь           = "sd.phoenixtrading.ltd";
	
	//Файл           = КаталогВременныхФайлов()+"sd.txt";
	
	//ПоляПоиска = Новый Структура;   
	//ПоляПоиска.Вставить("email_id", эл.Почта);//"rinat.galimov@phoenixtrading.ltd"); 
	ЕстьОшибкиОтправки = 0;
	Для каждого эл Из Рез Цикл
		
		Если Не  ЗначениеЗаполнено(эл.id_sd) Тогда
			Продолжить;	
		КонецЕсли;
		
		мДет  = Новый Структура;
		//мДет.Вставить("description","Отдел: Разработка 1с, Локация: Москва, Офис: Калужская, Номер места: Стол 15");  
		//мДет.Вставить("department","ИТ"); 
		Если ЗначениеЗаполнено(эл.ActualPositionTitle) Тогда
			мДет.Вставить("jobtitle",эл.ActualPositionTitle); //"Ведущий программист 1c"	
		КонецЕсли;
		//мДет.Вставить("mobile",эл.ОсновнойТелефон); //"Ведущий программист 1c"   
		//мДет.Вставить("Organization",эл.Организация);
		
		ДопПоляСотрудника = Новый Структура;  
		Если ЗначениеЗаполнено(эл.Desk_Team) Тогда
			ДопПоляСотрудника.Вставить("udf_sline_2101", эл.Desk_Team); //"Отдел разработки 1с"
		КонецЕсли;
		Если ЗначениеЗаполнено(эл.Location) Тогда
			ДопПоляСотрудника.Вставить("udf_sline_2102", эл.Location); //"Moscow"
		КонецЕсли;
		Если ЗначениеЗаполнено(эл.Офис) Тогда
			ДопПоляСотрудника.Вставить("udf_sline_2103", эл.Офис);
		КонецЕсли;
		Если ЗначениеЗаполнено(эл.НомерМеста) Тогда
			ДопПоляСотрудника.Вставить("udf_sline_2104", эл.НомерМеста); //"Стол 15"
		КонецЕсли;
		Если ЗначениеЗаполнено(эл.Руководитель) Тогда
			ДопПоляСотрудника.Вставить("udf_sline_2106", эл.Руководитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(эл.Организация) Тогда
			ДопПоляСотрудника.Вставить("udf_sline_2105", эл.Организация);
		КонецЕсли;
		Если ЗначениеЗаполнено(эл.ДатаОбновленияДляSD) Тогда
			ПолеДаты = Новый Структура;
			ПолеДаты.Вставить("value", ДатаВремяВUnix(эл.ДатаОбновленияДляSD));	
			ДопПоляСотрудника.Вставить("udf_date_3792", ПолеДаты);	
		КонецЕсли;
		
		
		мДет.Вставить("user_udf_fields",ДопПоляСотрудника);
		
		сЛистИнфо = Новый Структура;  	
		сЛистИнфо.Вставить("user",мДет); 
		
		ДанныеЗапроса  = новый Структура; 
		ДанныеЗапроса.Вставить("input_data",сЛистИнфо); 
		
		Попытка 
			input_data = JSON(сЛистИнфо);
			input_data = КодироватьСтроку(Input_Data, СпособКодированияСтроки.КодировкаURL);
			Запрос= "/api/v3/users/"+ эл.id_sd +"?input_data=" + input_data;
			
			 
			//2741
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8"); 
			Заголовки.Вставить("Authtoken", token_work);
			
			Запрос = Новый HTTPЗапрос(Запрос, Заголовки);
			Запрос.УстановитьТелоИзСтроки("", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);   //"UTF-8"
			HTTPСоединение = Новый HTTPСоединение(Путь,,,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));  //Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено)
			
			Ответ = HTTPСоединение.ВызватьHTTPМетод("PUT",Запрос);      
			
			Если Ответ.КодСостояния <> 2000 И Ответ.КодСостояния <> 200 Тогда   
				ЕстьОшибкиОтправки = ЕстьОшибкиОтправки + 1;
				РезультатСтрока =  Ответ.ПолучитьТелоКакСтроку();	
				Коммментарий = СтрШаблон("Ошибка обновление информации в SD. Ответ: %1", РезультатСтрока);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'ОбновитьИнформациювSD'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , эл.Сотрудник, Коммментарий);
			КонецЕсли;
		Исключение   
			ЕстьОшибкиОтправки = ЕстьОшибкиОтправки + 1;
			Сообщить(ОписаниеОшибки()); 
			Сообщить(сЛистИнфо); 
			Коммментарий = СтрШаблон("Ошибка обновление информации в SD. Причина: %1", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'ОбновитьИнформациювSD'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , эл.Сотрудник, Коммментарий); 
			Продолжить
			//Возврат "Ошибка обмена";
			
		КонецПопытки;
	КонецЦикла;
	
	Если ЕстьОшибкиОтправки > 0 Тогда
		ОповеститьExpress(СтрШаблон("Ошибки обновления информации в SD. Подробности см. в ЖР. Количество: %1", ЕстьОшибкиОтправки));	
	КонецЕсли;
КонецФункции 

Функция ВыборкаОбновления();
	
	Запрос = Новый Запрос;
	
	//Запрос.УстановитьПараметр("ФизическоеЛицо", Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор("6daf4575-9559-11f0-8051-005056019580")));//Жердев Константин Алексеевич (Справочник.ФизическиеЛица)
	//Запрос.УстановитьПараметр("ФизическоеЛицо", Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор("87c1ea7d-dfc0-11ee-a6ef-00505601b51a")));//Галимов Ринат Шамилевич (Справочник.ФизическиеЛица)
	//Запрос.УстановитьПараметр("ФизическоеЛицо", Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор("eb031f8b-b8f7-11ee-8d99-b89a2ab8c2ce")));//Салащенко Антон Владимирович (Справочник.ФизическиеЛица)



	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ZUPC_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ZUPC_УчетнаяИнформацияПользователей.ОсновнойТелефон КАК ОсновнойТелефон,
	|	ZUPC_УчетнаяИнформацияПользователей.id_sd КАК id_sd,
	|	ZUPC_УчетнаяИнформацияПользователей.ДатаОбновленияДляSD КАК ДатаОбновленияДляSD,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация.Представление, """""""") КАК Организация,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualPositionTitle.Представление, """""""") КАК ActualPositionTitle,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Представление, """""""") КАК ActualDepartmentName,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Desk_Team.Представление, """""""") КАК Desk_Team,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Locations.Представление, """""""") КАК Location,  
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация.Представление, """") КАК Организация,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualPositionTitle.Представление, """") КАК ActualPositionTitle,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Представление, """") КАК ActualDepartmentName,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Desk_Team.Представление, """") КАК Desk_Team,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Locations.Представление, """") КАК Location,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо.ZUPC_DateJoingGroup КАК DateJoingGroup,
	//|	ВЫБОР
	//|		КОГДА ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг <> """"""""
	//|			ТОГДА ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг
	//|		ИНАЧЕ ТекущиеКадровыеДанныеСотрудников.Сотрудник
	//|	КОНЕЦ КАК Спеллинг,  
	|	ВЫБОР
	|		КОГДА ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг <> """"
	|			ТОГДА ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг
	|		ИНАЧЕ ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|	КОНЕЦ КАК Спеллинг,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Приоритет, 0) КАК Приоритет,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.Офис.Представление, """""""") КАК Офис,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.НомерМеста.Представление, """""""") КАК НомерМеста,
	//|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.Руководитель.Представление, """""""") КАК Руководитель
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.Офис.Представление, """") КАК Офис,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.НомерМеста.Представление, """") КАК НомерМеста,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.Руководитель.Представление, """") КАК Руководитель
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ZUPC_УчетнаяИнформацияПользователей
	|		ПО (ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = ZUPC_УчетнаяИнформацияПользователей.ФизическоеЛицо)
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_NonEstablishedEmployees = ЛОЖЬ 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Locations,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Приоритет";    
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

Процедура ЗаполняемФизЛицоИзСотрудников()

	СобытиеЖР = "ХД.ЗаполняемФизЛицоИзСотрудников";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ЗаполняемФизЛицоИзСотрудников";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	ЗаполняемФизЛицоИзСотрудниковВыполнить(СобытиеЖР);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура ЗаполняемФизЛицоИзСотрудниковВыполнить(СобытиеЖР)
	
	//Текст сформирован автоматически из Управляемая консоль отчетов 3.9.0
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	|	ФизическиеЛица.ZUPC_DateJoingGroup КАК DateJoingGroupФизЛицо,
	|	ФизическиеЛица.ZUPC_Спеллинг КАК СпеллингФизЛицо,
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ZUPC_DateJoingGroup КАК ZUPC_DateJoingGroupСотр,
	|	Сотрудники.Спеллинг КАК СпеллингСотр
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ФизическиеЛица.Ссылка = Сотрудники.ФизическоеЛицо)
	|ГДЕ
	|	Сотрудники.Спеллинг <> """"";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Сотрудник)  Тогда
		 СпрОб =  Выборка.ФизическоеЛицо.ПолучитьОбъект();
		 СпрОб.ZUPC_Спеллинг = Выборка.СпеллингСотр;	
		 //СпрОб.Записать();
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

	
Процедура ПеренестиБонусы()

	СобытиеЖР = "ХД.ПеренестиБонусы";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ПеренестиБонусы";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	ПереносимБонусы(СобытиеЖР);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура ПереносимБонусы(СобытиеЖР)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.ZUPC_SignOnBonus КАК ZUPC_SignOnBonus,
	|	Сотрудники.ZUPC_PerformanceBonusPerOffer КАК ZUPC_PerformanceBonusPerOffer
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ZUPC_SignOnBonus <>""""";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОб = 	 Выборка.Ссылка.ПолучитьОбъект();
		СпрОб.ZUPC_PerformanceBonusPerOffer = Выборка.ZUPC_SignOnBonus;
		//СпрОб.Записать();
		
	КонецЦикла;

КонецПроцедуры

// Probation_УведомлениеОбОкончанииИспытательногоСрока
Процедура Probation_УведомлениеОбОкончанииИспытательногоСрока()
	
	СобытиеЖР = "ХД.Probation_УведомлениеОбОкончанииИспытательногоСрока";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "Probation_УведомлениеОбОкончанииИспытательногоСрока";
	//
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли; 
	
	сРез = Probation_ИнициализироватьТаблицуРезультата();
	
	Probation_СотрудникиСЗаканчивающимсяИспытательнымСроком(СобытиеЖР, сРез); 
	
	Probation_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

КонецПроцедуры	

Функция Probation_ИнициализироватьТаблицуРезультата()
	
	сРез = Новый ТаблицаЗначений;
	
	КавлификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	КавлификаторСтроки = Новый КвалификаторыСтроки(300,ДопустимаяДлина.Переменная);
	КвалификаторЧисла = Новый КвалификаторыЧисла(3,0,ДопустимыйЗнак.Неотрицательный);
	
	сРез.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	сРез.Колонки.Добавить("Сотрудник",   Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	сРез.Колонки.Добавить("ДатаПриема",  Новый ОписаниеТипов("Дата",,,,,КавлификаторДаты));
	сРез.Колонки.Добавить("ИспСрок",     Новый ОписаниеТипов("Число",,,КвалификаторЧисла),"Исп.срок");
	сРез.Колонки.Добавить("ДатаОкончанияИспытытельногоСрока", Новый ОписаниеТипов("Дата",,,,,КавлификаторДаты));
	сРез.Колонки.Добавить("ФИОПолные",   Новый ОписаниеТипов("Строка",,,,КавлификаторСтроки));
	
	Возврат сРез;
	
КонецФункции

Процедура Probation_СотрудникиСЗаканчивающимсяИспытательнымСроком(СобытиеЖР, сРез)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.ОкончаниеПериода = ТекущаяДатаСеанса();
	ПараметрыПолучения.КадровыеДанные = "Организация,ФИОПолные,ДатаПриема,ИспытательныйСрокДатаЗавершения,ДатаУвольнения";    
	
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыПолучения);
	
	НапоминатьЗа = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Probation_НапомнитьОбОкончанииИспСрока"); 
	
	ПроверяемаяДата = ТекущаяДатаСеанса() + (НапоминатьЗа * 86400);  
	
	ЗаписьЖР(СобытиеЖР, "Проверяемая дата:" + ПроверяемаяДата);
		
	Для каждого ДанныеСотрудника Из ТаблицаСотрудников Цикл 
		Если ЗначениеЗаполнено(ДанныеСотрудника.ДатаУвольнения) Тогда
			Продолжить;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСотрудника.ИспытательныйСрокДатаЗавершения) И 
			НачалоДня(ПроверяемаяДата) = НачалоДня(ДанныеСотрудника.ИспытательныйСрокДатаЗавершения) Тогда

			СтрокаРезультата = сРез.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата,ДанныеСотрудника);
			СтрокаРезультата.ДатаОкончанияИспытытельногоСрока = ДанныеСотрудника.ИспытательныйСрокДатаЗавершения;
			
			ИспСрок = РазницаДатВМесяцах(ДанныеСотрудника.ДатаПриема, ДанныеСотрудника.ИспытательныйСрокДатаЗавершения);
			
			СтрокаРезультата.ИспСрок = ИспСрок; 
			
		КонецЕсли;
		
	КонецЦикла; 
		
КонецПроцедуры

Функция Probation_ТекстПисьма(СобытиеЖР, сРез) 
	
	ЧастиТекста = Новый Массив;
	//
	НапоминатьЗа = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("BirthDay_НапомнитьОДняхРожденияхСотрудников");
	//
	ДатаДняРождения = Формат(ТекущаяДатаСеанса() + (НапоминатьЗа * 86400), "ДФ=dd.MM.yyyy");
	//
	СклонениеДня = СтроковыеФункцииКлиентСервер.ФормаМножественногоЧисла("день","дня","дней", НапоминатьЗа);
	//
	ЧастьТекста = СтрШаблон("Через %1 %2 (%3) у следующих сотрудников заканчивается испытательный срок:",НапоминатьЗа,СклонениеДня,Формат(ДатаДняРождения, "ДФ=dd.MM.yyyy"));
		
	Макет = ПолучитьМакет("ХД_ИспытательныйСрок_HTML");	
	
	ТекстHTML = Макет.ПолучитьТекст();        
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{<b>Описание</b>}",ЧастьТекста); 
	
	СтрокаКолонок = "Сотрудник,ДатаПриема,ИспСрок,ДатаОкончанияИспытытельногоСрока,Организация";
	
	мМассив  = СтрРазделить(СтрокаКолонок,",");
	
	Для каждого стр Из сРез Цикл
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", стр[эл]); 	
			
		КонецЦикла;  	
		
	КонецЦикла;
	
	Возврат  ТекстHTML; 
	
Конецфункции

Процедура Probation_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез)
	
	Если сРез.Количество() > 0 Тогда 
		
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");	
			
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Probation_Рассылка_УведомлениеОбОкончанииИспытательногоСрока", Истина);
		
		ТекстHTML =  Probation_ТекстПисьма(СобытиеЖР,сРез);  
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Тема", "ЗУП: Уведомление об окончании испытательного срока");    
		ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		ПараметрыПисьма.Вставить("Текст", ТекстHTML);
		ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
		ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыПисьма.Вставить("ПолучателиПисьма",ПолучателиПисьма);
		
		ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
		
	КонецЕсли;	
	
КонецПроцедуры

//ЗаполнитьЛокациювДолжности

Процедура ЗаполнитьЛокациювДолжности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ZUPC_Locations", Справочники.ZUPC_Locations.ПолучитьСсылку(Новый УникальныйИдентификатор("b8551897-21b5-11ef-a6f6-00505601b51a")));//MOSCOW OFFICE (Справочник.ZUPC_Locations)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ZUPC_ActualDepartmentName КАК ZUPC_ActualDepartmentName,
	|	Сотрудники.ZUPC_Desk_Team КАК ZUPC_Desk_Team,
	|	Сотрудники.ZUPC_ActualPositionTitle КАК ZUPC_ActualPositionTitle,
	|	Сотрудники.ZUPC_Locations КАК ZUPC_Locations
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ZUPC_Locations = &ZUPC_Locations
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.ZUPC_ActualDepartmentName,
	|	Сотрудники.ZUPC_Desk_Team,
	|	Сотрудники.ZUPC_ActualPositionTitle,
	|	Сотрудники.ZUPC_Locations";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ZUPC_ActualPositionTitle) Тогда
			
			ОбПоз = Выборка.ZUPC_ActualPositionTitle.ПолучитьОбъект();
			ОбПоз.ZUPC_Locations = Справочники.ZUPC_Locations.ПолучитьСсылку(Новый УникальныйИдентификатор("b8551897-21b5-11ef-a6f6-00505601b51a"));
			//ОбПоз.Записать();
		Конецесли;	
	КонецЦикла;
		
КонецПроцедуры


//ЗагрузитьизЭксельТелефоны
Процедура ЗагрузитьизЭксельТелефоны()
	СобытиеЖР = "ХД.ЗагрузитьизЭксельТелефоны";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	нОстутствуют = Новый Структура; 
	
	СтрокаРегламентноеЗадание = "ЗагрузитьизЭксельТелефоны";
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;
	
	//КаталогФайлаКИ = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("КаталогФайлаЗагрузкиБазыКлиентов- selecom.pro");
	
	КаталогФайлаКИ = "E:\temp\телефоны.xlsx";
	
	ЗагрузкаТелефонов_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ);
	
	//ЗагрузкаИнвойсов_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, нОстутствуют);
	
	//ЗаписатьЗавершениеЗаданияВРегистр("ЗагрузкаБазыКлиентов");
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
	
КонецПроцедуры

Процедура ЗагрузкаТелефонов_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ)
	
	//ВнешнееСоединение =	ПолучитьСоединениесБазой("Узел_ЗПИФ_Рарус", СобытиеЖР);
		
	Рез = ПодготовитьТаблицуТелефонов(СобытиеЖР, КаталогФайлаКИ);
	
	Если Рез.Количество() > 0  Тогда
		
		 ОбновитьТелефоны( СобытиеЖР, Рез) 
		
	КонецЕсли;
	
КонецПроцедуры  

Функция ПодготовитьТаблицуТелефонов(СобытиеЖР, КаталогФайлаКИ)
	
	мСтруктура = Новый Структура;
	
	ИмяФайла =  КаталогФайлаКИ;
	
	РезультатПоследнейЗагрузки = Истина;  
	
	СообщениеОбОшибке ="";
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда    
		ЗаписьЖР(СобытиеЖР, "Файл загрузки контактной информации не найден: " + ИмяФайла);
		
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	
	//ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	//ХешированиеДанных.ДобавитьФайл(ИмяФайла);
	//
	//ХешСумма = СокрЛП(ХешированиеДанных.ХешСумма);
	//мКаталог = СтрРазделить(КаталогФайлаКИ,"\");
	//Индекс = мКаталог.Количество();
	//мКаталог.Удалить(Индекс-1); 
	//КаталогФайлаХэшФайла = СтрСоединить(мКаталог, "\");
	//ИмяФайлаХэш = КаталогФайлаХэшФайла + "\dbCLNT_CHNL_hash.txt";
	//ФайлХ = Новый Файл(ИмяФайлаХэш);
	//Если ФайлХ.Существует() Тогда
	//	ПредыдущийХеш = "";
	//	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	//	ТекстовыйДокумент.Прочитать(ИмяФайлаХэш);
	//	Если ТекстовыйДокумент.КоличествоСтрок() > 0 Тогда
	//		ПредыдущийХеш = СокрЛП(ТекстовыйДокумент.ПолучитьСтроку(1));
	//	КонецЕсли;
	//	ТекстовыйДокумент = Неопределено;
	//	Если ПредыдущийХеш = ХешСумма Тогда // старый файл - перезаливать не нужно
	//		ЗаписьЖР(СобытиеЖР, "В каталоге обнаружен старый файл загрузки контактной информации. Загрузка КИ не производилась!" + ИмяФайла);
	//		
	//		мСтруктура.Вставить("Рез",Неопределено);
	//		//Возврат мСтруктура;
	//	КонецЕсли;
	//КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла); 
	    
	//мРез = o_EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);

	мРез = EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);
	Если мРез = Неопределено  Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;  
	
	//СправочникОбъект = Справочники.ХранилищеДанных.СоздатьЭлемент(); 
	//СправочникОбъект.ОбменДанными.Загрузка = Истина;
	//СправочникОбъект.Дата = ТекущаяДата();
	////СправочникОбъект.Тип = Перечисления.ТипыДанныхХранилищаДанных.ИсходящиеДанные;
	////СправочникОбъект.Вид = Перечисления.ВидыДанныхХранилищаДанных.ЗПИФ_ОбновлениеКИдляОФД;
	//СправочникОбъект.УстановитьНовыйКод();
	//СправочникОбъект.Записать();
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);  
	
	ИмяФайлаБезРасширения = СтрЗаменить(ИмяФайла,".xls","");  
	РасширениеБезТочки =   СтрЗаменить(Файл.Расширение,".","");
	
	//ДобавитьПрисоединенныйФайл(СправочникОбъект.Ссылка, ИмяФайлаБезРасширения, РасширениеБезТочки, ИмяФайла);

	//тРез = мРез[1].Скопировать();   
	//тРез.Очистить();
	//тРез.Свернуть("Type1,Counterparty,InternalNumber,InvoiceNumber");
	//
	//нОтсутствуют = тРез.Скопировать();   
	//
	//КЧ = Новый КвалификаторыЧисла(15,2);
	//КСИНН = Новый КвалификаторыСтроки(50);
	//КСКПП = Новый КвалификаторыСтроки(9);
	//Массив = Новый Массив;
	//Массив.Добавить(Тип("Дата"));
	//ОписаниеТиповД = Новый ОписаниеТипов(Массив, , );
	//Массив.Очистить();
	//Массив.Добавить(Тип("Число"));
	//ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	//Массив.Очистить();
	//Массив.Добавить(Тип("Строка"));
	//ОписаниеТиповСИНН = Новый ОписаниеТипов(Массив, , ,КСИНН);
	//Массив.Очистить();
	//Массив.Добавить(Тип("Строка"));
	//ОписаниеТиповСКПП = Новый ОписаниеТипов(Массив, , ,КСКПП);
	//
	//
	//нОтсутствуют.Колонки.Добавить("Номер",ОписаниеТиповСИНН);
	//нОтсутствуют.Колонки.Добавить("Дата",ОписаниеТиповД);
	//нОтсутствуют.Колонки.Добавить("IssueDate",ОписаниеТиповД);
	//нОтсутствуют.Колонки.Добавить("СуммаДокумента",ОписаниеТиповЧ);
	//
	//тРез.Колонки.Добавить("AmountInInvoiceCurrency",ОписаниеТиповЧ);  
	//тРез.Колонки.Добавить("IssueDate",ОписаниеТиповД);
	//тРез.Колонки.Добавить("ИНН", ОписаниеТиповСИНН);
	//тРез.Колонки.Добавить("КПП", ОписаниеТиповСКПП);
	//
	//Рез = ПодготовитьИнвойсы(мРез[1],тРез);
	//
	//СообщениеОбОшибке = Символы.ПС + "Загрузка успешна!";
	////ТекстовыйДокумент = Новый ТекстовыйДокумент;
	////ТекстовыйДокумент.ДобавитьСтроку(ХешСумма);
	////ТекстовыйДокумент.ДобавитьСтроку(СообщениеОбОшибке);
	////ТекстовыйДокумент.Записать(ИмяФайлаХэш);
	//
	//мСтруктура.Вставить("Рез",Рез);
	//мСтруктура.Вставить("нОтсутствуют", нОтсутствуют);
	////мСтруктура.Вставить("СправочникОбъект",СправочникОбъект);
	Возврат мРез[0];
	
КонецФункции // ПодготовитьТаблицуКИ()

Процедура ОбновитьТелефоны(СобытиеЖР, Рез)

	    Для каждого эл Из  Рез Цикл
		
			МЗ =   РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
	        МЗ.Почта =  эл.Почта;
			МЗ.СотрудникСтрока = эл.СотрудникСтрока;
			МЗ.Прочитать();   
			Если МЗ.Выбран() Тогда
				Если ЗначениеЗаполнено(эл.MobilTelRu) Тогда
					МЗ.ОсновнойТелефон =   эл.MobilTelRu;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(эл.MobilTelDubai) Тогда
					МЗ.ТелефонДоп =   эл.MobilTelDubai;
				КонецЕсли; 
				Если ЗначениеЗаполнено(эл.iptel) Тогда
					МЗ.ВнутрНомер =   эл.iptel;
				КонецЕсли; 
			Конецесли;
			//МЗ.Записать();
		
		КонецЦикла;

КонецПроцедуры


//HREstablishmentExcel
Процедура HREstablishmentExcel()
	СобытиеЖР = "ХД.HREstablishmentExcel";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	нОстутствуют = Новый Структура; 
	
	СтрокаРегламентноеЗадание = "HREstablishmentExcel";
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;
	
	//КаталогФайлаКИ = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("КаталогФайлаЗагрузкиБазыКлиентов- selecom.pro");
	
	КаталогФайлаКИ = "E:\temp\bl\fs.xlsx";
	
	ЗагрузкаHREstablishment_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ);
	
	//ЗагрузкаИнвойсов_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, нОстутствуют);
	
	//ЗаписатьЗавершениеЗаданияВРегистр("ЗагрузкаБазыКлиентов");
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
	
КонецПроцедуры

Процедура ЗагрузкаHREstablishment_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ)
	
	//ВнешнееСоединение =	ПолучитьСоединениесБазой("Узел_ЗПИФ_Рарус", СобытиеЖР);
		
	Рез = ПодготовитьТаблицуHREstablishment(СобытиеЖР, КаталогФайлаКИ);
	
	Путь =  "E:\temp\bl\fs2.xlsx";
	
	Если Рез.Количество() > 0  Тогда
		
		 тРез = СравнитьHREstablishment( СобытиеЖР, Рез); 
		
		 Если  тРез.Количество() > 0 Тогда
		 
		 	 HREstablishment_ЗаписьвФайл(СобытиеЖР, тРез, Путь)
		 
		 КонецЕсли;
		 
	КонецЕсли;
	
КонецПроцедуры  

Процедура  HREstablishment_ЗаписьвФайл(СобытиеЖР, тРез, Путь)
	
	Шаблон = "HR Establishment";  
	ТипФайла = "XLSX";     
	
	элДата =  Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ПутьКФайлу = Путь  +""+ элДата+Шаблон+".xlsx"; 
	СформироватьТД(СобытиеЖР, тРез, Шаблон, Путь, ТипФайла)
	
	
КонецПроцедуры

Функция ПодготовитьТаблицуHREstablishment(СобытиеЖР, КаталогФайлаКИ)
	
	мСтруктура = Новый Структура;
	
	ИмяФайла =  КаталогФайлаКИ;
	
	РезультатПоследнейЗагрузки = Истина;  
	
	СообщениеОбОшибке ="";
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда    
		ЗаписьЖР(СобытиеЖР, "Файл загрузки контактной информации не найден: " + ИмяФайла);
		
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла); 
	    
	//мРез = o_EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);

	мРез = EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);
	Если мРез = Неопределено  Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;  
	

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);  
	
	ИмяФайлаБезРасширения = СтрЗаменить(ИмяФайла,".xls","");  	РасширениеБезТочки =   СтрЗаменить(Файл.Расширение,".","");
	
	//ДобавитьПрисоединенныйФайл(СправочникОбъект.Ссылка, ИмяФайлаБезРасширения, РасширениеБезТочки, ИмяФайла);

	тРез = мРез[0].Скопировать();   
	тРез.Очистить();
	тРез.Свернуть("NO_,Name_Surname,DateOfRecruitment,JobTitle,MonthlySalary,InRubles,Exch_rate");
	//
	//нОтсутствуют = тРез.Скопировать();   
	//
	КЧ = Новый КвалификаторыЧисла(15,2);
	КСИНН = Новый КвалификаторыСтроки(150);
	КСКПП = Новый КвалификаторыСтроки(9);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	ОписаниеТиповД = Новый ОписаниеТипов(Массив, , );
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСИНН = Новый ОписаниеТипов(Массив, , ,КСИНН);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСКПП = Новый ОписаниеТипов(Массив, , ,КСКПП);
	//

	тРез.Колонки.Добавить("ZUPC_ActualDepartmentName",ОписаниеТиповСИНН);  

	Рез = ПодготовитьТаблицуHR(мРез[0],тРез);
	
	Возврат Рез;
	
КонецФункции // ПодготовитьТаблицуКИ()

Функция ПодготовитьТаблицуHR(мРез, тРез)
	
	ZUPC_ActualDepartmentName ="";
	
	Для каждого эл Из мРез Цикл
		
		Если  ЗначениеЗаполнено(эл.Name_Surname) и  ЗначениеЗаполнено(эл.JobTitle)  Тогда
		   НоваяСтрока =  тРез.Добавить();   
		   ЗаполнитьЗначенияСвойств(НоваяСтрока,эл);  
		   НоваяСтрока.ZUPC_ActualDepartmentName = ZUPC_ActualDepartmentName; 
		   MonthlySalary = СтрЗаменить(эл.MonthlySalary,",","");
		   НоваяСтрока.MonthlySalary = СтрЗаменить(MonthlySalary,"$","");

		   НоваяСтрока.InRubles = СтрЗаменить(эл.InRubles,",","");

			
	    Иначе 
		   ZUPC_ActualDepartmentName =  эл.NO_;    
		КонецЕсли;
		   
	
	КонецЦикла;
	
   Возврат  тРез;
КонецФункции // ПодготовитьТаблицуHR()

Функция СравнитьHREstablishment(СобытиеЖР, Рез)    
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	HR.NO_ КАК NO_,
	|	HR.Name_Surname КАК Name_Surname,
	|	HR.DateOfRecruitment КАК DateOfRecruitment,
	|	HR.JobTitle КАК JobTitle,
	|	HR.MonthlySalary КАК MonthlySalary,
	|	HR.InRubles КАК InRubles,
	|	HR.Exch_rate КАК Exch_rate
	|ПОМЕСТИТЬ HR
	|ИЗ
	|	&HR КАК HR
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	HR.NO_ КАК NO_,
	|	HR.Name_Surname КАК Name_Surname,
	|	HR.DateOfRecruitment КАК DateOfRecruitment,
	|	HR.JobTitle КАК JobTitle,
	|	HR.MonthlySalary КАК MonthlySalary,
	|	HR.InRubles КАК InRubles,
	|	HR.Exch_rate КАК Exch_rate,
	|	ZUPC_ЗарплатаNetСрезПоследних.Период КАК Период,
	|	ZUPC_ЗарплатаNetСрезПоследних.Организация КАК Организация,
	|	ZUPC_ЗарплатаNetСрезПоследних.Сотрудник КАК Сотрудник,
	|	ZUPC_ЗарплатаNetСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ZUPC_ЗарплатаNetСрезПоследних.Год КАК Год,
	|	ZUPC_ЗарплатаNetСрезПоследних.Зарплата_net КАК Зарплата_net,
	|	ZUPC_ЗарплатаNetСрезПоследних.Ставка КАК Ставка
	|ИЗ
	|	HR КАК HR
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_ЗарплатаNet.СрезПоследних КАК ZUPC_ЗарплатаNetСрезПоследних
	|		ПО ((ВЫРАЗИТЬ(HR.Name_Surname КАК СТРОКА(150))) = ZUPC_ЗарплатаNetСрезПоследних.Сотрудник.Спеллинг)";
	
	Запрос.УстановитьПараметр("HR",Рез);
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции

    ///ОтправитьHRИзменениеЗП
Процедура ОтправитьHRИзменениеЗПНДФЛ()

	СобытиеЖР = "ХД.ОтправитьHRИзменениеЗПНДФЛ";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ОтправитьHRИзменениеЗПНДФЛ";
	
	Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
		ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
		Возврат;
	КонецЕсли; 
	
	СписокФизЛицОрганизация = ПолучитьСписокСотрудников(СобытиеЖР);
	
	сРез = ВыполнитьHRИзменениеЗП(СобытиеЖР, СписокФизЛицОрганизация); 

	дФайла = ЗаписьВФайлИзменениеНДФЛ(СобытиеЖР, сРез);
	
	HRИзменениеЗП_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез, дФайла);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Функция ВыполнитьHRИзменениеЗП(СобытиеЖР, СписокФизЛицОрганизация)
   	
	ЗаписьЖР(СобытиеЖР, "Начало сбора данных по зарплате");

	//Период = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "Период").Значение; 
	ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОкончания = ТекущаяДата();
	
	ДатаНачалаНП = ДатаНачала;
	ДатаКонцаНП  =  ДатаОкончания;
	//ДатаПодписи  = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ДатаПодписи").Значение;
	//Если ТипЗнч(ДатаПодписи) = Тип("СтандартнаяДатаНачала") Тогда 
	//	ДатаПодписи = ДатаПодписи.Дата;
	//КонецЕсли;	
	
	//Если ДатаПодписи = Неопределено Или ДатаПодписи = '00010101' Тогда
		ДатаПодписи = ТекущаяДатаСеанса();
	//КонецЕсли;
	Ответственный = Неопределено;

	ФизическоеЛицоОтветственного = ?(Ответственный = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный.Значение, "ФизическоеЛицо"));
	
	// Создание запроса и установка всех необходимых параметров.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ФизлицоОтветственного", ФизическоеЛицоОтветственного);
	Запрос.УстановитьПараметр("НачалоНП", ДатаНачалаНП);
	Запрос.УстановитьПараметр("КонецНП", ДатаКонцаНП);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаПодписи);
	Запрос.УстановитьПараметр("СписокФизЛицОрганизация", СписокФизЛицОрганизация);
	Запрос.УстановитьПараметр("Резидент", Справочники.СтатусыНалогоплательщиковПоНДФЛ.Резидент);
	Запрос.УстановитьПараметр("Нерезидент", Справочники.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент);
	Запрос.УстановитьПараметр("ДатаИзмененияНалогообложенияДивидендов", УчетНДФЛ.ДатаИзмененияНалогообложенияДивидендов());
	Запрос.УстановитьПараметр("ДатаНачалаРасчетаСроковУплатыНалога", УчетНДФЛ.ДатаНачалаРасчетаСроковУплатыНалога());
	Запрос.УстановитьПараметр("ДатаЗакона263ФЗ", УчетНДФЛ.ДатаЗакона263ФЗ());
	Запрос.УстановитьПараметр("ДатаЗакона285ФЗ", УчетНДФЛ.ДатаЗакона285ФЗ());
	Запрос.УстановитьПараметр("ДатаЗакона176ФЗ", УчетНДФЛ.ДатаЗакона176ФЗ());
	Запрос.УстановитьПараметр("ГодЗакона285ФЗ", Год(УчетНДФЛ.ДатаЗакона285ФЗ()));
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();		
	Запрос.УстановитьПараметр("ДатаОбъединенияНалоговыхБаз", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.ДатаОбъединенияНалоговыхБаз);
	Запрос.УстановитьПараметр("НачалоРасчетаНДФЛПоПрогрессивнойШкале", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.НачалоРасчетаНДФЛПоПрогрессивнойШкале);
	Запрос.УстановитьПараметр("ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале", Год(ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.НачалоРасчетаНДФЛПоПрогрессивнойШкале));
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
	Запрос.УстановитьПараметр("ОбщаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ПоОсновнойСтавке());
	Запрос.УстановитьПараметр("ДоходыОтТрудовойДеятельности", Перечисления.КатегорииДоходовНДФЛ.ДоходыОтТрудовойДеятельности());
	Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
	Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
	Запрос.УстановитьПараметр("СтавкаЧисломСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом);
	// Сформируем текст запроса с датами месяцев налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, ДатаНачалаНП, ДатаКонцаНП,,,, Истина);
	
	ВТ_ПорядокСтавок = Новый ТаблицаЗначений;
    ВТ_ПорядокСтавок.Колонки.Добавить("Ставка", Новый ОписаниеТипов("ПеречислениеСсылка.НДФЛСтавки"));
	ВТ_ПорядокСтавок.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка13;
	НоваяСтрока.Порядок   = 1;		
	
	НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка15;
	НоваяСтрока.Порядок   = 2;		
	
	НоваяСтрока  = ВТ_ПорядокСтавок.Добавить();
	НоваяСтрока.Ставка    = Перечисления.НДФЛСтавки.Ставка18;
	НоваяСтрока.Порядок   = 3;		
	
	Запрос.УстановитьПараметр("ВТ_ПорядокСтавок", ВТ_ПорядокСтавок);
	
	
	// -----------------------------------------------------------------------------
		Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛицаОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ФизЛицаОрганизация.Организация,
	|	ФизЛицаОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизЛицаОрганизация.Год КАК Год,
	|	ФизЛицаОрганизация.НеОтбиратьПоОП
	|ПОМЕСТИТЬ ВТСписокФизЛицОрганизация
	|ИЗ
	|	&СписокФизЛицОрганизация КАК ФизЛицаОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ГоловнаяОрганизация,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК СтруктурнаяЕдиница,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТГоловныеОрганизации
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВЫБОР
	|		КОГДА Организации.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТСписокФизЛицОрганизация.Организация
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТОбособленныеПодразделения
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = Организации.ГоловнаяОрганизация
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВТСписокФизЛицОрганизация.Организация
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Периоды.Период) КАК Период,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТТаблицаДляСрезаНаКонецГода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	МассивНеобходимыхДанных = Новый Массив;
	МассивНеобходимыхДанных.Добавить("ФИОПолные");
	МассивНеобходимыхДанных.Добавить("ДокументВид");
	МассивНеобходимыхДанных.Добавить("ДокументНомер");
	МассивНеобходимыхДанных.Добавить("ДокументСерия");
	МассивНеобходимыхДанных.Добавить("АдресПоПрописке");
	МассивНеобходимыхДанных.Добавить("АдресЗаПределамиРФ");
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФизическиеЛица");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Ложь, МассивНеобходимыхДанных);
	
	// Получим кадровые данные ответственного лица.
	ФизическоеЛицоОтветственногоВМассиве = Новый Массив;
	ФизическоеЛицоОтветственногоВМассиве.Добавить(ФизическоеЛицоОтветственного);
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц 	= ФизическоеЛицоОтветственногоВМассиве;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода 			= ДатаПодписи;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода 		= ДатаПодписи;
	ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные			= "ВидЗанятости,Организация,Должность";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций);
	КадровыйУчет.СоздатьВТСтраныМираДляГражданства(Запрос.МенеджерВременныхТаблиц);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Вставить("ВсеЗаписи", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ГражданствоФизическихЛиц",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТТаблицаДляСрезаНаКонецГода",
			"Период,ФизическоеЛицо"),
		ПараметрыПостроения);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ИсторияРегистрацийВНалоговомОргане",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТГоловныеОрганизации",
			"Период,СтруктурнаяЕдиница"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГОД(ГражданствоФизЛицаСрезПоследних.Период) КАК Год,
	|	ГражданствоФизЛицаСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраныМира.Код КАК КодСтраны,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛицаСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ ГражданствоФизЛицаСрезПоследних.ИНН
	|	КОНЕЦ КАК ИННВСтранеГражданства
	|ПОМЕСТИТЬ ВТГражданствоФизЛиц
	|ИЗ
	|	ВТГражданствоФизическихЛицСрезПоследних КАК ГражданствоФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтраныМираДляГражданства КАК СтраныМира
	|		ПО ГражданствоФизЛицаСрезПоследних.Страна = СтраныМира.Страна
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Периоды.Период) КАК Период,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	// Статусы застрахованных на конец месяца.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтатусФизическихЛицКакНалогоплательщиковНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца",
			"ФизическоеЛицо"),
		,
		"ВТСтатусФизЛицНаКонецМесяцаПромежуточная");
		
	// Статусы застрахованных на конец налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтатусФизическихЛицКакНалогоплательщиковНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТСтатусыФизЛицНаКонецНалоговогоПериода",
			"ФизическоеЛицо"),
		,
		"ВТСтатусыФизЛицНаКонецНалоговогоПериодаПромежуточная");
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период, МЕСЯЦ) КАК Месяц,
	|	ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаИзмененияНалогообложенияДивидендов
	|				ТОГДА СтатусФизЛицНаКонецМесяца.Статус.КодФНС
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Статус.КодФНС_2015
	|		КОНЕЦ, 1) КАК Статус,
	|	ВЫБОР
	|		КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаЗакона285ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы))
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период < &ДатаЗакона285ФЗ
	|				И СтатусФизЛицНаКонецМесяца.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусФизЛицНаКонецМесяца.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК ТекущийСтатус
	|ПОМЕСТИТЬ ВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	ВТИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца КАК ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяцаПромежуточная КАК СтатусФизЛицНаКонецМесяца
	|		ПО ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.Период = СтатусФизЛицНаКонецМесяца.Период
	|			И ИзмеренияДатыДляВТСтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СтатусФизЛицНаКонецМесяца.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокФизЛицОрганизация.ГОД КАК Год,
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГОД < &ГодЗакона285ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы))
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, &Резидент) <> &Резидент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьИностранныйАдрес,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГОД < &ГодЗакона285ФЗ
	|				И СтатусыФизЛицНаКонецНалоговогоПериода.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусыФизЛицНаКонецНалоговогоПериода.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериодаПромежуточная КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО (СписокФизЛицОрганизация.ГОД = ГОД(СтатусыФизЛицНаКонецНалоговогоПериода.Период))
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТИзмеренияДатыДляВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ)";
	
	Запрос.Выполнить();

	// Статусы застрахованных на конец налогового периода.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ПрименениеСтандартныхВычетовПоНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДатыДляВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних",
			"ФизическоеЛицо"));
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Период,
	|	НДФЛПрименениеВычетов.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|ПОМЕСТИТЬ ВТПрименениеВычетовВМесяцаРезидентства
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО (ГОД(СтатусФизЛицНаКонецМесяца.Месяц) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|			И СтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеСтандартныхВычетовПоНДФЛСрезПоследних КАК НДФЛПрименениеВычетов
	|		ПО (НДФЛПрименениеВычетов.ФизическоеЛицо = СтатусФизЛицНаКонецМесяца.ФизическоеЛицо)
	|			И (НДФЛПрименениеВычетов.Период = СтатусФизЛицНаКонецМесяца.Месяц)
	|ГДЕ
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Период,
	|	ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ДатаАктуальности КАК Период,
	|	ФизЛица.ГоловнаяОрганизация.ИндивидуальныйПредприниматель КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛицаДляПолученияФИО
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ФизЛица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаАктуальности,
	|	&ФизлицоОтветственного";
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ОбъединеннаяНалоговаяБазаСтрокой", НСтр("ru = 'Объединенная налоговая база'"));
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБазаСтрокой", НСтр("ru = 'Основная налоговая база'"));
	Запрос.УстановитьПараметр("Дивиденды", НСтр("ru = 'Дивиденды'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыОтДолевогоУчастия", НСтр("ru = 'Доходы от долевого участия'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоВыигрышам", НСтр("ru = 'Доходы по выигрышам'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыЦБ", НСтр("ru = 'Операции с ценными бумагами кроме процента, купона по облигациям российских организаций'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыРЕПО", НСтр("ru = 'Операции РЕПО'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыЗаймЦБ", НСтр("ru = 'Операции займа ценными бумагами'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыИИС", НСтр("ru = 'Операции на ИИС'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоОблигациям", НСтр("ru = 'Процент, купон по облигациям российских организаций с 1 января 2017 г.'"));
	Запрос.УстановитьПараметр("ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ", НСтр("ru = 'Прочие доходы, облагаемые по ставке п. 1.1 ст. 224 НК РФ'"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК КатегорияДохода,
	|	&ОсновнаяНалоговаяБазаСтрокой КАК ПредставлениеНалоговойБазы,
	|	1 КАК ПорядокНалоговойБазы
	|ПОМЕСТИТЬ ВТОписаниеНалоговыхБаз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды),
	|	&Дивиденды,
	|	90
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15),
	|	"""",
	|	99
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия),
	|	&ПрочиеДоходыОтДолевогоУчастия,
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам),
	|	&ПрочиеДоходыПоВыигрышам,
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ),
	|	&ПрочиеДоходыЦБ,
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО),
	|	&ПрочиеДоходыРЕПО,
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ),
	|	&ПрочиеДоходыЗаймЦБ,
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС),
	|	&ПрочиеДоходыИИС,
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям),
	|	&ПрочиеДоходыПоОблигациям,
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ),
	|	&ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ,
	|	9";
	Запрос.Выполнить();

	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛицаДляПолученияФИО");
	ОписательВременныхТаблиц.ИмяВТКадровыеДанныеФизическихЛиц = "ВТФИООтветственных";
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФИОПолные,ИОФамилия");

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.ИНН КАК Организация_ИНН,
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.КПП КАК Организация_КПП,
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане.Код КАК Организация_КодНалоговогоОргана,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|			ТОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ ФИОПредпринимателя.ФИОПолные
	|	КОНЕЦ КАК Организация_Наименование,
	|	ДанныеОФизЛице.ИНН КАК ФизическоеЛицо_ИНН,
	|	КадровыеДанныеФизЛиц.ФИОПолные КАК ФизическоеЛицо_ФИО,
	|	ФИОФизлицаОтветственного.ИОФамилия КАК Ответственный_ФИО,
	|	ДолжностьОтветственного.Должность.Наименование КАК Ответственный_Должность,
	|	КадровыеДанныеФизЛиц.ДокументВид.Наименование КАК ВидДокумента,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеФизЛиц.ДокументВид ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ КадровыеДанныеФизЛиц.ДокументВид.КодМВД
	|	КОНЕЦ КАК КодДокументаУдЛичн,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеФизЛиц.ДокументВид ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ КадровыеДанныеФизЛиц.ДокументСерия + "" "" + КадровыеДанныеФизЛиц.ДокументНомер
	|	КОНЕЦ КАК ФизическоеЛицо_СерияНомерДокументаУдЛичн,
	|	ДанныеОФизЛице.ДатаРождения КАК ФизическоеЛицо_ДатаРождения,
	|	ЕСТЬNULL(ГражданствоФизЛица.КодСтраны, ""643"") КАК ФизическоеЛицо_КодСтраны,
	|	ДоходыПредыдущегоМестаРаботыНДФЛ.Размер КАК ФизическоеЛицо_ДоходыПредыдущегоМестаРаботы,
	|	ЕСТЬNULL(КадровыеДанныеФизЛиц.АдресПоПрописке, """") КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА ЕСТЬNULL(ГражданствоФизЛица.КодСтраны, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизическоеЛицо_АдресКодСтраны,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА ЕСТЬNULL(КадровыеДанныеФизЛиц.АдресЗаПределамиРФ, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизическоеЛицо_ИностранныйАдрес
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИОПредпринимателя
	|		ПО (ФИОПредпринимателя.ФизическоеЛицо = СписокФизЛицОрганизация.ГоловнаяОрганизация.ИндивидуальныйПредприниматель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОФизЛице
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ДанныеОФизЛице.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОбОтветственном
	|		ПО (ДанныеОбОтветственном.Ссылка = &ФизлицоОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = КадровыеДанныеФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсторияРегистрацийВНалоговомОрганеСрезПоследних КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИОФизлицаОтветственного
	|		ПО (ФИОФизлицаОтветственного.ФизическоеЛицо = &ФизлицоОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ГражданствоФизЛица.ФизическоеЛицо
	|			И СписокФизЛицОрганизация.Год = ГражданствоФизЛица.Год
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ КАК ДоходыПредыдущегоМестаРаботыНДФЛ
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = ДоходыПредыдущегоМестаРаботыНДФЛ.ФизическоеЛицо
	|			И СписокФизЛицОрганизация.ГоловнаяОрганизация = ДоходыПредыдущегоМестаРаботыНДФЛ.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.Год = ГОД(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода))
	|			И (МЕСЯЦ(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода) = 12)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК ДолжностьОтветственного
	|		ПО (ДолжностьОтветственного.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство))
	|			И (ДолжностьОтветственного.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО СписокФизЛицОрганизация.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	Год";
	
	ДанныеОФизЛицеОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	УчетНДФЛ.СоздатьВТСтандартныеВычетыПоНДФЛЗаПериод(Запрос.МенеджерВременныхТаблиц, Ложь, ДатаПодписи, "ВТПрименениеВычетовВМесяцаРезидентства");
	УчетНДФЛ.СоздатьВТДополнительныеСвойстваКодаДохода(Запрос.МенеджерВременныхТаблиц);
	
	// АПК:96-выкл в таблице ВТСтрокиУчета строки должны быть уникальны
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛСведенияОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|				И НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА 0
	|		ИНАЧЕ НДФЛСведенияОДоходах.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|				И НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета
	|	КОНЕЦ КАК КодВычета,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ПериодДляОпределенияСтатуса,
	|	НДФЛСведенияОДоходах.КодДохода.Код КАК КодДоходаКод,
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода < &ДатаЗакона263ФЗ
	|		И СвойстваКодаДохода.СоответствуетОплатеТруда
	|		И (НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|			ИЛИ НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)) КАК УчитываетсяПоМесяцуНачисления,
	|	НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2025, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2025Года
	|	КОНЕЦ КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	НДФЛСведенияОДоходах.КодВычета.НеПредоставляетсяНерезидентам КАК ВычетНеПредоставляетсяНерезидентам,
	|	НДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	|	&УсловиеОблагаемостиУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	НДФЛСведенияОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	НДФЛСведенияОДоходах.ДокументОснование КАК ДокументОснование,
	|	НДФЛСведенияОДоходах.УстаревшаяДатаПолученияДохода КАК УстаревшаяДатаПолученияДохода
	|ПОМЕСТИТЬ ВТСтрокиДоходов
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахНДФЛ КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеСвойстваКодаДохода КАК СвойстваКодаДохода
	|		ПО НДФЛСведенияОДоходах.КодДохода = СвойстваКодаДохода.КодДохода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛСведенияОДоходах.Организация = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛСведенияОДоходах.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыСБюджетом.Сумма КАК Сумма,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышения КАК СуммаСПревышения,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	НДФЛРасчетыСБюджетом.ВариантУдержания КАК ВариантУдержания,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК ПериодДляОпределенияСтатуса,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛРасчетыСБюджетом.КрайнийСрокУплаты КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды))
	|			ТОГДА НДФЛРасчетыСБюджетом.НалогСДивидендовУплаченныйЗаРубежом
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов
	|ПОМЕСТИТЬ ВТСтрокиНалогов
	|ИЗ
	|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК НДФЛРасчетыСБюджетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И (ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) = СписокФизЛицОрганизация.Год)
	|			И НДФЛРасчетыСБюджетом.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛРасчетыСБюджетом.Организация = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтрокиДоходов.ПериодДляОпределенияСтатуса КАК Период,
	|	СтрокиДоходов.КодДохода КАК КодДохода,
	|	СтрокиДоходов.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СтрокиДоходов.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТСтрокиУчета
	|ИЗ
	|	ВТСтрокиДоходов КАК СтрокиДоходов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.ФизическоеЛицо,
	|	СтрокиНалогов.ПериодДляОпределенияСтатуса,
	|	СтрокиНалогов.КодДохода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(СтрокиНалогов.ПериодДляОпределенияСтатуса, ГОД),
	|	СтрокиНалогов.КодДохода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОблагаемостиУНалоговогоАгента", УчетНДФЛ.УсловиеОблагаемостиУНалоговогоАгента("НДФЛСведенияОДоходах"));
	Запрос.Выполнить();
	// АПК:96-вкл
	
	УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета",,,"ВТСтавкаНДФЛ");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтрокиУчета.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтрокиУчета.Период КАК Период,
	|	СтрокиУчета.КодДохода КАК КодДохода,
	|	СтрокиУчета.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СтрокиУчета.КатегорияДохода КАК КатегорияДохода
	|ИЗ
	|	ВТСтрокиУчета КАК СтрокиУчета
	|ГДЕ
	|	СтрокиУчета.Период < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)";
	Если Запрос.Выполнить().Пустой() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ПустаяСсылка) КАК Статус,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка) КАК КодДохода,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.ПустаяСсылка) КАК СтавкаНалогообложенияРезидента,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.ПустаяСсылка) КАК СтавкаНДФЛ,
		|	0 КАК СтавкаЧислом
		|ПОМЕСТИТЬ ВТСтавкаНДФЛПоСтавкеРезидента";
		Запрос.Выполнить();
	Иначе 	
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента2016(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СоответствиеНалоговыхБаз", УчетНДФЛПовтИсп.СоставНалоговыхБаз());
	Запрос.УстановитьПараметр("ДатаЗакона176ФЗ", УчетНДФЛ.ДатаЗакона176ФЗ());
	Запрос.УстановитьПараметр("ТаблицаПределовДляНалоговыхБаз", УчетНДФЛ.ТаблицаПределовДляНалоговыхБаз2025());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНалоговыхБаз.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	СоответствиеНалоговыхБаз.НалоговаяБаза КАК НалоговаяБаза,
	|	СоответствиеНалоговыхБаз.КатегорияДохода КАК КатегорияДохода,
	|	СоответствиеНалоговыхБаз.ПериодС КАК ПериодС,
	|	СоответствиеНалоговыхБаз.ПериодПо КАК ПериодПо,
	|	СоответствиеНалоговыхБаз.СтатусФизическогоЛица КАК Статус
	|ПОМЕСТИТЬ ВТСоответствиеНалоговыхБаз
	|ИЗ
	|	&СоответствиеНалоговыхБаз КАК СоответствиеНалоговыхБаз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПределов.НалоговаяБаза КАК НалоговаяБаза,
	|	ТаблицаПределов.Предел1 КАК Предел1
	|ПОМЕСТИТЬ ВТПределыДляНалоговыхБаз
	|ИЗ
	|	&ТаблицаПределовДляНалоговыхБаз КАК ТаблицаПределов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыСБюджетом.Сумма КАК Сумма,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышения КАК СуммаСПревышения,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	НДФЛРасчетыСБюджетом.ВариантУдержания КАК ВариантУдержания,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНДФЛ
	|		ИНАЧЕ СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНДФЛ
	|	КОНЕЦ КАК СтавкаПоИтогамГода,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.КатегорияДохода КАК КатегорияДохода,
	|	ЕСТЬNULL(СоответствиеНалоговыхБаз.НалоговаяБаза, ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)) КАК НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса КАК ПериодДляОпределенияСтатуса,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
	|	НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов КАК НалогНаПрибыльДляДивидендов
	|ПОМЕСТИТЬ ВТСтрокиНалоговСоСтавками
	|ИЗ
	|	ВТСтрокиНалогов КАК НДФЛРасчетыСБюджетом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КодДохода = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.КодДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛПоСтавкеРезидентаНаКонецНалоговогоПериода.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеНалоговыхБаз КАК СоответствиеНалоговыхБаз
	|		ПО НДФЛРасчетыСБюджетом.КатегорияДохода = СоответствиеНалоговыхБаз.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СоответствиеНалоговыхБаз.СтавкаНалогообложенияРезидента
	|			И (СтавкиНДФЛ.Статус = СоответствиеНалоговыхБаз.Статус)
	|			И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ СоответствиеНалоговыхБаз.ПериодС И СоответствиеНалоговыхБаз.ПериодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкаНДФЛНаКонецНалоговогоПериода
	|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛНаКонецНалоговогоПериода.ФизическоеЛицо
	|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛНаКонецНалоговогоПериода.КатегорияДохода
	|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛНаКонецНалоговогоПериода.СтавкаНалогообложенияРезидента
	|			И (КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.ПериодДляОпределенияСтатуса, ГОД) = СтавкаНДФЛНаКонецНалоговогоПериода.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВидДвижения КАК ВидДвижения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Сумма КАК Сумма,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Период КАК Период,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КодДохода КАК КодДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода КАК ПериодДляОпределенияСтатуса,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Ставка КАК Ставка,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.НалоговаяБаза КАК НалоговаяБаза
	|ПОМЕСТИТЬ ВТСтрокиАвансов
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК АвансовыеПлатежиИностранцевПоНДФЛ
	|ГДЕ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ГоловнаяОрганизация,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ФизическоеЛицо,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВидДвижения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СуммаСПревышения,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаНалогообложенияРезидента,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.Период,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КодДохода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.МесяцНалоговогоПериода,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.РегистрацияВНалоговомОргане,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.КатегорияДохода,
	|	ВЫБОР
	|		КОГДА АвансовыеПлатежиИностранцевПоНДФЛ.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ АвансовыеПлатежиИностранцевПоНДФЛ.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ АвансовыеПлатежиИностранцевПоНДФЛ.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	АвансовыеПлатежиИностранцевПоНДФЛ.НалоговаяБаза
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК АвансовыеПлатежиИностранцевПоНДФЛ
	|ГДЕ
	|	АвансовыеПлатежиИностранцевПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтандартныеВычетыПоНДФЛЗаПериод.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Месяц КАК Месяц,
	|	СтандартныеВычетыПоНДФЛЗаПериод.КодВычета КАК КодВычетаЛичный,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Количество КАК КоличествоДетей,
	|	СтандартныеВычетыПоНДФЛЗаПериод.Основание КАК Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыПоМесяцамРезидентства
	|ИЗ
	|	ВТСтандартныеВычетыПоНДФЛЗаПериод КАК СтандартныеВычетыПоНДФЛЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименениеВычетовВМесяцаРезидентства.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрименениеВычетовВМесяцаРезидентства.Период КАК Месяц,
	|	ПрименениеВычетовВМесяцаРезидентства.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета,
	|	СтандартныеВычетыПоМесяцамРезидентства.КоличествоДетей КАК КоличествоДетей,
	|	СтандартныеВычетыПоМесяцамРезидентства.Основание КАК Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыФизЛицОрганизации
	|ИЗ
	|	ВТПрименениеВычетовВМесяцаРезидентства КАК ПрименениеВычетовВМесяцаРезидентства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|		ПО ПрименениеВычетовВМесяцаРезидентства.ФизическоеЛицо = СтандартныеВычетыПоМесяцамРезидентства.ФизическоеЛицо
	|			И ПрименениеВычетовВМесяцаРезидентства.Период = СтандартныеВычетыПоМесяцамРезидентства.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета КАК КодВычета,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Сумма) КАК Размер,
	|	МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор,
	|	НДФЛИмущественныеВычетыФизлиц.Период КАК Дата
	|ПОМЕСТИТЬ ВТСоциальныеИИмущественныеВычеты
	|ИЗ
	|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛИмущественныеВычетыФизлиц.Организация = СписокФизЛицОрганизация.Организация)
	|			И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета,
	|	НДФЛИмущественныеВычетыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Сумма),
	|	НЕОПРЕДЕЛЕНО,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.ГруппаВычета = ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.Социальные))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.ФизическоеЛицо,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(НДФЛСведенияОДоходах.МесяцНалоговогоПериода) КАК Год,
	|	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ) КАК Месяц,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицПоГодам.Статус = &Резидент
	|			ТОГДА НДФЛСведенияОДоходах.СуммаВычета
	|		КОГДА НДФЛСведенияОДоходах.ВычетНеПредоставляетсяНерезидентам
	|			ТОГДА 0
	|		ИНАЧЕ НДФЛСведенияОДоходах.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НДФЛСведенияОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|	НДФЛСведенияОДоходах.КодДоходаКод КАК КодДоходаКод,
	|	НДФЛСведенияОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаНДФЛ
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом
	|		ИНАЧЕ СтавкиНДФЛ.СтавкаЧислом
	|	КОНЕЦ КАК СтавкаЧислом,
	|	НДФЛСведенияОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.УчитываетсяПоМесяцуНачисления
	|			ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК МесяцНачисления,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.УчитываетсяПоМесяцуНачисления
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ НДФЛСведенияОДоходах.ДатаПолученияДохода
	|	КОНЕЦ КАК ДатаВыплаты,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК Период,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	НДФЛСведенияОДоходах.Период КАК ДатаНачисления,
	|	НДФЛСведенияОДоходах.КодВычета КАК КодВычета,
	|	НДФЛСведенияОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|			ТОГДА СоответствиеНалоговыхБаз.НалоговаяБаза
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода < &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		КОГДА НДФЛСведенияОДоходах.КатегорияДохода В (&ОбщаяНалоговаяБаза)
	|				И НДФЛСведенияОДоходах.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛСведенияОДоходах.КатегорияДохода
	|	КОНЕЦ КАК НалоговаяБаза,
	|	НДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2017, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|							И НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОГДА НДФЛСведенияОДоходах.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|			ТОГДА НЕ СоответствиеНалоговыхБаз.НалоговаяБаза В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка))
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
	|					И НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|		КОГДА СтавкиНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА НДФЛСведенияОДоходах.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|					И НДФЛСведенияОДоходах.ДатаПолученияДохода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходРазделаПо13,
	|	НДФЛСведенияОДоходах.ДокументОснование КАК ДокументОснование,
	|	НДФЛСведенияОДоходах.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		И НДФЛСведенияОДоходах.ДатаПолученияДохода <> НДФЛСведенияОДоходах.УстаревшаяДатаПолученияДохода КАК ДатаПолученияДоходаПеренесена
	|ПОМЕСТИТЬ ВТДоходыПоСтавкам
	|ИЗ
	|	ВТСтрокиДоходов КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.КодДохода = СтавкаНДФЛПоСтавкеРезидента.КодДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
	|			И НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса = СтавкаНДФЛПоСтавкеРезидента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛ КАК СтавкиНДФЛ
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтавкиНДФЛ.ФизическоеЛицо
	|			И НДФЛСведенияОДоходах.КатегорияДохода = СтавкиНДФЛ.КатегорияДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СтавкиНДФЛ.СтавкаНалогообложенияРезидента
	|			И НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса = СтавкиНДФЛ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеНалоговыхБаз КАК СоответствиеНалоговыхБаз
	|		ПО НДФЛСведенияОДоходах.КатегорияДохода = СоответствиеНалоговыхБаз.КатегорияДохода
	|			И НДФЛСведенияОДоходах.СтавкаНалогообложенияРезидента = СоответствиеНалоговыхБаз.СтавкаНалогообложенияРезидента
	|			И (СтавкиНДФЛ.Статус = СоответствиеНалоговыхБаз.Статус)
	|			И (НДФЛСведенияОДоходах.ДатаПолученияДохода МЕЖДУ СоответствиеНалоговыхБаз.ПериодС И СоответствиеНалоговыхБаз.ПериодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицПоГодам
	|		ПО НДФЛСведенияОДоходах.ФизическоеЛицо = СтатусыФизЛицПоГодам.ФизическоеЛицо
	|			И (ГОД(НДФЛСведенияОДоходах.ПериодДляОпределенияСтатуса) = СтатусыФизЛицПоГодам.Год)
	|ГДЕ
	|	(НЕ НДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ
	|			ИЛИ СтатусыФизЛицПоГодам.Статус = &Резидент
	|			ИЛИ СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ДистанционныйРаботник)
	|				И НДФЛСведенияОДоходах.КатегорияДохода В (&ДоходыОтТрудовойДеятельности)
	|				И НДФЛСведенияОДоходах.ДатаПолученияДохода >= ДАТАВРЕМЯ(2024, 1, 1, 0, 0, 0))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК Месяц,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Сумма) КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза
	|	КОНЕЦ КАК НалоговаяБаза,
	|	НДФЛИмущественныеВычетыФизлиц.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета КАК КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК МесяцПериодаПредоставленияВычета
	|ПОМЕСТИТЬ ВТВычетыПоСтавкам
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|				И (ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация
	|			И СписокФизЛицОрганизация.ФизическоеЛицо = НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НДФЛИмущественныеВычетыФизлиц.Период МЕЖДУ &НачалоНП И &КонецНП)
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛИмущественныеВычетыФизлиц.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ),
	|	НДФЛИмущественныеВычетыФизлиц.РегистрацияВНалоговомОргане,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.Период < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.НалоговаяБаза
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Сумма),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.РегистрацияВНалоговомОргане,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцПериодаПредоставленияВычета
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизическоеЛицо
	|				И (ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация
	|			И ВТСписокФизЛицОрганизация.ФизическоеЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ ВТСписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.РегистрацияВНалоговомОргане,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцПериодаПредоставленияВычета,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.НалоговаяБаза
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.ФизическоеЛицо КАК ФизическоеЛицо,
	|	База.НалоговаяБаза КАК НалоговаяБаза,
	|	База.Год КАК Год,
	|	База.НачалоГода КАК НачалоГода
	|ПОМЕСТИТЬ ВТСотрудникиСПревышением
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза,
	|		ДоходыПоСтавкам.Год КАК Год,
	|		НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Месяц, ГОД) КАК НачалоГода
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|	ГДЕ
	|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		И ДоходыПоСтавкам.Год >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале
	|		И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
	|		СтандартныеИмущественныеВычеты.НалоговаяБаза,
	|		-СтандартныеИмущественныеВычеты.СуммаВычета,
	|		ГОД(СтандартныеИмущественныеВычеты.Месяц),
	|		НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.Месяц, ГОД)
	|	ИЗ
	|		ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
	|	ГДЕ
	|		СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		И ГОД(СтандартныеИмущественныеВычеты.Месяц) >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале) КАК База
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПределыДляНалоговыхБаз КАК ПределыДляНалоговыхБаз
	|		ПО База.НалоговаяБаза = ПределыДляНалоговыхБаз.НалоговаяБаза
	|
	|СГРУППИРОВАТЬ ПО
	|	База.ФизическоеЛицо,
	|	База.НалоговаяБаза,
	|	База.Год,
	|	ПределыДляНалоговыхБаз.Предел1,
	|	База.НачалоГода
	|
	|ИМЕЮЩИЕ
	|	СУММА(База.ОблагаемаяБаза) > ВЫБОР
	|		КОГДА База.НачалоГода >= &ДатаЗакона176ФЗ
	|			ТОГДА ПределыДляНалоговыхБаз.Предел1
	|		ИНАЧЕ &Предел
	|	КОНЕЦ";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.Год КАК Год,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК НачалоМесяца,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
		|	0 КАК ОблагаемыйДоходСНачалаГода,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
		|	ЛОЖЬ КАК ПределПревышен
		|ИЗ
		|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
		|			И СведенияОДоходахНДФЛ.Год = СотрудникиСПревышением.Год
		|ГДЕ
		|	СведенияОДоходахНДФЛ.ОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ДатаПолученияДохода < &ДатаЗакона176ФЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.Год,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	НалоговаяБаза,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода";
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			ТаблицаРасчетаНарастающимИтогом = Результат.Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СтандартныеИмущественныеВычеты.СуммаВычета) КАК Сумма,
			|	СтандартныеИмущественныеВычеты.Месяц КАК НачалоМесяца
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ГОД(СтандартныеИмущественныеВычеты.Месяц) = СотрудникиСПревышением.Год)
			|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
			|ГДЕ
			|	СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
			|	И ГОД(СтандартныеИмущественныеВычеты.Месяц) >= &ГодНачалаРасчетаНДФЛПоПрогрессивнойШкале
			|	И СтандартныеИмущественныеВычеты.Месяц < &ДатаЗакона176ФЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза,
			|	СтандартныеИмущественныеВычеты.Месяц";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НалоговаяБаза,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца,НалоговаяБаза");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			ТекущийГод = Неопределено;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Или ТекущийГод <> СтрокаТаблицы.Год Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущийГод = СтрокаТаблицы.Год;
					ТекущееНачалоМесяца = Неопределено;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК ДатаПолученияДохода,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Год КАК Год,
			|	ДоходыПоСтавкам.Месяц КАК Месяц,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	ДоходыПоСтавкам.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.СтавкаЧислом КАК СтавкаЧислом,
			|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыПоСтавкам.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыПоСтавкам.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыПоСтавкам.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	ДоходыПоСтавкам.Период КАК Период,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.ДокументОснование КАК ДокументОснование,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.ДатаПолученияДохода = РасчетНарастающимИтогом.ДатаПолученияДохода
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|ГДЕ
			|	ДоходыПоСтавкам.ДатаПолученияДохода < &ДатаЗакона176ФЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза
			|ПОМЕСТИТЬ ВТФизлицаБезПереносаДат
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация
			|
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена) = ЛОЖЬ И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане) > 1 И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.ДокументОснование) > 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизлицаБезПереносаДат.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ФизлицаБезПереносаДат.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ФизлицаБезПереносаДат.Период КАК Период,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	ФизлицаБезПереносаДат.НалоговаяБаза КАК НалоговаяБаза
			|ПОМЕСТИТЬ ВТОтборОснований
			|ИЗ
			|	ВТФизлицаБезПереносаДат КАК ФизлицаБезПереносаДат
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ПО ФизлицаБезПереносаДат.ФизическоеЛицо = РасширенныеДанныеОДоходах.ФизическоеЛицо
			|			И ФизлицаБезПереносаДат.НалоговаяБаза = РасширенныеДанныеОДоходах.НалоговаяБаза
			|			И ФизлицаБезПереносаДат.Период = РасширенныеДанныеОДоходах.Период
			|			И ФизлицаБезПереносаДат.ГоловнаяОрганизация = РасширенныеДанныеОДоходах.ГоловнаяОрганизация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтборОснований.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ОтборОснований.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОтборОснований.Период КАК ДатаПолученияДохода,
			|	ОтборОснований.НалоговаяБаза КАК НалоговаяБаза,
			|	ОтборОснований.ДокументОснование КАК ДокументОснование,
			|	ВЫБОР
			|		КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) <> 0
			|				И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) = 0
			|			ТОГДА 1
			|		КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
			|				И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) = 0
			|			ТОГДА 2
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОписаниеДокумента
			|ПОМЕСТИТЬ ВТОснованияВДниПревышения
			|ИЗ
			|	ВТОтборОснований КАК ОтборОснований
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
			|		ПО ОтборОснований.ФизическоеЛицо = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо
			|			И ОтборОснований.КатегорияДохода = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода
			|			И ОтборОснований.Период = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода
			|			И ОтборОснований.ДокументОснование = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
			|			И ОтборОснований.ГоловнаяОрганизация = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация
			|ГДЕ
			|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтборОснований.ФизическоеЛицо,
			|	ОтборОснований.Период,
			|	ОтборОснований.НалоговаяБаза,
			|	ОтборОснований.ДокументОснование,
			|	ОтборОснований.ГоловнаяОрганизация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом КАК СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасширенныеДанныеОДоходах.ПределПревышен КАК ПределПревышен,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0) КАК ОписаниеДокументаСПревышением
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВДниПревышения КАК ОснованияВДниПревышения
			|		ПО РасширенныеДанныеОДоходах.ФизическоеЛицо = ОснованияВДниПревышения.ФизическоеЛицо
			|			И РасширенныеДанныеОДоходах.НалоговаяБаза = ОснованияВДниПревышения.НалоговаяБаза
			|			И РасширенныеДанныеОДоходах.ДокументОснование = ОснованияВДниПревышения.ДокументОснование
			|			И РасширенныеДанныеОДоходах.Период = ОснованияВДниПревышения.ДатаПолученияДохода
			|			И РасширенныеДанныеОДоходах.ГоловнаяОрганизация = ОснованияВДниПревышения.ГоловнаяОрганизация
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|	И РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год,
			|	РасширенныеДанныеОДоходах.Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела,
			|	РасширенныеДанныеОДоходах.ПределПревышен,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0),
			|	РасширенныеДанныеОДоходах.КатегорияДохода
			|
			|ИМЕЮЩИЕ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	Год,
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
			
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущийГод = Неопределено;
			СтрокиРаспределения = Новый Массив;
			ОблагаемыйДоходДоПредела = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущийГод <> СтрокаТаблицы.Год Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					Если ОблагаемыйДоходДоПредела <> 0 Тогда
						ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
					КонецЕсли;
					СтрокиРаспределения = Новый Массив;
					ОблагаемыйДоходДоПредела = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущийГод = СтрокаТаблицы.Год;
				КонецЕсли;
				Если ОблагаемыйДоходДоПредела = 0 Тогда
					ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
				КонецЕсли;
				СтрокиРаспределения.Добавить(СтрокаТаблицы);
			КонецЦикла;
			Если ОблагаемыйДоходДоПредела <> 0 Тогда
				ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год КАК Год,
			|	ДоходыСУточненнымиСтавками.Месяц КАК Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.ОписаниеДокументаСПревышением = 2
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.Ставка
			|	КОНЕЦ КАК Ставка,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.ОписаниеДокументаСПревышением = 2
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.СтавкаЧислом
			|	КОНЕЦ КАК СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДокументОснование КАК ДокументОснование,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаЧислом
			|	КОНЕЦ КАК СтавкаЧислом,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета,
			|	РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТВременнаяТаблица
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	(НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|			ИЛИ НЕ РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета,
			|	ИСТИНА,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДокументОснование,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаПеренесена,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета,
			|	ДоходыСУточненнымиСтавками.ОблагаетсяУНалоговогоАгента,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДокументОснование,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаПеренесена,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыСУточненнымиСтавками
			|ГДЕ
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблица.СтавкаЧислом КАК СтавкаЧислом,
			|	ВременнаяТаблица.Ставка КАК Ставка,
			|	ВременнаяТаблица.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ВременнаяТаблица.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ВременнаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.Год КАК Год,
			|	ВременнаяТаблица.Месяц КАК Месяц,
			|	ВременнаяТаблица.СуммаДохода КАК СуммаДохода,
			|	ВременнаяТаблица.СуммаВычета КАК СуммаВычета,
			|	ВременнаяТаблица.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	ВременнаяТаблица.КодДохода КАК КодДохода,
			|	ВременнаяТаблица.КодДоходаКод КАК КодДоходаКод,
			|	ВременнаяТаблица.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ВременнаяТаблица.МесяцНачисления КАК МесяцНачисления,
			|	ВременнаяТаблица.ДатаВыплаты КАК ДатаВыплаты,
			|	ВременнаяТаблица.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ВременнаяТаблица.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ВременнаяТаблица.ДатаНачисления КАК ДатаНачисления,
			|	ВременнаяТаблица.КодВычета КАК КодВычета,
			|	ВременнаяТаблица.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ВременнаяТаблица.НалоговаяБаза КАК НалоговаяБаза,
			|	ВременнаяТаблица.КатегорияДохода КАК КатегорияДохода,
			|	ВременнаяТаблица.ДокументОснование КАК ДокументОснование,
			|	ВременнаяТаблица.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ВременнаяТаблица.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица";
			Запрос.Выполнить();
			
			ТвблицыКУдалению = Новый Массив;
			ТвблицыКУдалению.Добавить("ВТРасчетНарастающимИтогом");
			ТвблицыКУдалению.Добавить("ВТРасширенныеДанныеОДоходах");
			ТвблицыКУдалению.Добавить("ВТФизлицаБезПереносаДат");
			ТвблицыКУдалению.Добавить("ВТОтборОснований");
			ТвблицыКУдалению.Добавить("ВТОснованияВДниПревышения");
			ТвблицыКУдалению.Добавить("ВТДоходыСУточненнымиСтавками");
			ТвблицыКУдалению.Добавить("ВТВременнаяТаблица");
			ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, ТвблицыКУдалению);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.Год КАК Год,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК НачалоМесяца,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела1,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела2,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела3,
		|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела4,
		|	ЛОЖЬ КАК Предел1Превышен,
		|	ЛОЖЬ КАК Предел2Превышен,
		|	ЛОЖЬ КАК Предел3Превышен,
		|	ЛОЖЬ КАК Предел4Превышен,
		|	0 КАК ОблагаемыйДоходСНачалаГода
		|ИЗ
		|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
		|			И СведенияОДоходахНДФЛ.Год = СотрудникиСПревышением.Год
		|ГДЕ
		|	СведенияОДоходахНДФЛ.ОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.Год,
		|	СведенияОДоходахНДФЛ.НалоговаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	НалоговаяБаза,
		|	Период";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			ТаблицаРасчетаНарастающимИтогом = Результат.Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СтандартныеИмущественныеВычеты.СуммаВычета) КАК Сумма,
			|	СтандартныеИмущественныеВычеты.Месяц КАК НачалоМесяца
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ГОД(СтандартныеИмущественныеВычеты.Месяц) = СотрудникиСПревышением.Год)
			|			И СтандартныеИмущественныеВычеты.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
			|ГДЕ
			|	СтандартныеИмущественныеВычеты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
			|	И СтандартныеИмущественныеВычеты.Месяц >= &ДатаЗакона176ФЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	СтандартныеИмущественныеВычеты.НалоговаяБаза,
			|	СтандартныеИмущественныеВычеты.Месяц";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НалоговаяБаза,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НалоговаяБаза,НачалоМесяца");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			СоответствиеПараметровНалоговыхБаз = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкалеС2025Года().СоответствиеПараметровНалоговыхБаз;
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			ТекущийГод = Неопределено;
			Предел1 = 0; Предел2 = 0; Предел3 = 0; Предел4 = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Или ТекущийГод <> СтрокаТаблицы.Год Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущийГод = СтрокаТаблицы.Год;
					ТекущееНачалоМесяца = Неопределено;
					ПределыНалоговойБазы = СоответствиеПараметровНалоговыхБаз[СтрокаТаблицы.НалоговаяБаза];
					Предел1 = ПределыНалоговойБазы.Предел1;
					Предел2 = ПределыНалоговойБазы.Предел2;
					Предел3 = ПределыНалоговойБазы.Предел3;
					Предел4 = ПределыНалоговойБазы.Предел4;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела1 = ОблагаемыйДоходСНачалаГода < Предел1 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел1;
				Если Предел1 <> Предел2 Тогда
					СтрокаТаблицы.ЭтоДеньПревышенияПредела2 = ОблагаемыйДоходСНачалаГода < Предел2 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел2;
					Если Предел2 <> Предел3 Тогда
						СтрокаТаблицы.ЭтоДеньПревышенияПредела3 = ОблагаемыйДоходСНачалаГода < Предел3 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел3;
						Если Предел3 <> Предел4 Тогда
							СтрокаТаблицы.ЭтоДеньПревышенияПредела4 = ОблагаемыйДоходСНачалаГода < Предел4 И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > Предел4;
						Иначе 
							СтрокаТаблицы.ЭтоДеньПревышенияПредела4	= СтрокаТаблицы.ЭтоДеньПревышенияПредела3;
						КонецЕсли;
					Иначе 
						СтрокаТаблицы.ЭтоДеньПревышенияПредела3	= СтрокаТаблицы.ЭтоДеньПревышенияПредела2;
						СтрокаТаблицы.ЭтоДеньПревышенияПредела4	= СтрокаТаблицы.ЭтоДеньПревышенияПредела2;
					КонецЕсли;
				Иначе 
					СтрокаТаблицы.ЭтоДеньПревышенияПредела2	= СтрокаТаблицы.ЭтоДеньПревышенияПредела1;
					СтрокаТаблицы.ЭтоДеньПревышенияПредела3	= СтрокаТаблицы.ЭтоДеньПревышенияПредела1;
					СтрокаТаблицы.ЭтоДеньПревышенияПредела4	= СтрокаТаблицы.ЭтоДеньПревышенияПредела1;
				КонецЕсли;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.Предел1Превышен = ОблагаемыйДоходСНачалаГода > Предел1;
				Если Предел1 <> Предел2 Тогда
					СтрокаТаблицы.Предел2Превышен = ОблагаемыйДоходСНачалаГода > Предел2;
					Если Предел2 <> Предел3 Тогда
						СтрокаТаблицы.Предел3Превышен = ОблагаемыйДоходСНачалаГода > Предел3;
						Если Предел3 <> Предел4 Тогда
							СтрокаТаблицы.Предел4Превышен = ОблагаемыйДоходСНачалаГода > Предел4;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК ДатаПолученияДохода,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела1 КАК ЭтоДеньПревышенияПредела1,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела2 КАК ЭтоДеньПревышенияПредела2,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела3 КАК ЭтоДеньПревышенияПредела3,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела4 КАК ЭтоДеньПревышенияПредела4,
			|	РасчетНарастающимИтогом.Предел1Превышен КАК Предел1Превышен,
			|	РасчетНарастающимИтогом.Предел2Превышен КАК Предел2Превышен,
			|	РасчетНарастающимИтогом.Предел3Превышен КАК Предел3Превышен,
			|	РасчетНарастающимИтогом.Предел4Превышен КАК Предел4Превышен,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Год КАК Год,
			|	ДоходыПоСтавкам.Месяц КАК Месяц,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	ДоходыПоСтавкам.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.СтавкаЧислом КАК СтавкаЧислом,
			|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыПоСтавкам.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыПоСтавкам.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыПоСтавкам.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.ДокументОснование КАК ДокументОснование,
			|	ДоходыПоСтавкам.ДатаПолученияДоходаПеренесена КАК ДатаПолученияДоходаПеренесена,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела1, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела1,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела2, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела2,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела3, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела3,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела4, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела4,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел1Превышен, ЛОЖЬ) КАК Предел1Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел2Превышен, ЛОЖЬ) КАК Предел2Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел3Превышен, ЛОЖЬ) КАК Предел3Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.Предел4Превышен, ЛОЖЬ) КАК Предел4Превышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.ДатаПолученияДохода = РасчетНарастающимИтогом.ДатаПолученияДохода
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза
			|ПОМЕСТИТЬ ВТФизлицаБезПереносаДат
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	(РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация
			|
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(РасширенныеДанныеОДоходах.ДатаПолученияДоходаПеренесена) = ЛОЖЬ И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане) > 1 И
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенныеДанныеОДоходах.ДокументОснование) > 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизлицаБезПереносаДат.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ФизлицаБезПереносаДат.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ФизлицаБезПереносаДат.Период КАК Период,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	ФизлицаБезПереносаДат.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1 КАК ЭтоДеньПревышенияПредела1,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2 КАК ЭтоДеньПревышенияПредела2,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3 КАК ЭтоДеньПревышенияПредела3,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4 КАК ЭтоДеньПревышенияПредела4
			|ПОМЕСТИТЬ ВТОтборОснований
			|ИЗ
			|	ВТФизлицаБезПереносаДат КАК ФизлицаБезПереносаДат
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ПО ФизлицаБезПереносаДат.ФизическоеЛицо = РасширенныеДанныеОДоходах.ФизическоеЛицо
			|			И ФизлицаБезПереносаДат.НалоговаяБаза = РасширенныеДанныеОДоходах.НалоговаяБаза
			|			И ФизлицаБезПереносаДат.Период = РасширенныеДанныеОДоходах.ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтборОснований.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ОтборОснований.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОтборОснований.Период КАК ДатаПолученияДохода,
			|	ОтборОснований.НалоговаяБаза КАК НалоговаяБаза,
			|	ОтборОснований.ДокументОснование КАК ДокументОснование,
			|	ВЫБОР
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела1
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела2
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела3
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке18) = 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		КОГДА ОтборОснований.ЭтоДеньПревышенияПредела4
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) = 0
			|						ТОГДА 1
			|					КОГДА СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке22) <> 0
			|							И СУММА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышенияПоСтавке20) = 0
			|						ТОГДА 2
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОписаниеДокумента
			|ПОМЕСТИТЬ ВТОснованияВДниПревышения
			|ИЗ
			|	ВТОтборОснований КАК ОтборОснований
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
			|		ПО ОтборОснований.ФизическоеЛицо = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо
			|			И ОтборОснований.КатегорияДохода = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода
			|			И ОтборОснований.Период = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода
			|			И ОтборОснований.ДокументОснование = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
			|			И ОтборОснований.ГоловнаяОрганизация = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация
			|ГДЕ
			|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтборОснований.ФизическоеЛицо,
			|	ОтборОснований.Период,
			|	ОтборОснований.НалоговаяБаза,
			|	ОтборОснований.ДокументОснование,
			|	ОтборОснований.ГоловнаяОрганизация,
			|	ОтборОснований.ЭтоДеньПревышенияПредела1,
			|	ОтборОснований.ЭтоДеньПревышенияПредела2,
			|	ОтборОснований.ЭтоДеньПревышенияПредела3,
			|	ОтборОснований.ЭтоДеньПревышенияПредела4
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом КАК СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК Период,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование КАК ДокументОснование,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0) КАК ОписаниеДокументаСПревышением,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1 КАК ЭтоДеньПревышенияПредела1,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2 КАК ЭтоДеньПревышенияПредела2,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3 КАК ЭтоДеньПревышенияПредела3,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4 КАК ЭтоДеньПревышенияПредела4
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВДниПревышения КАК ОснованияВДниПревышения
			|		ПО РасширенныеДанныеОДоходах.ФизическоеЛицо = ОснованияВДниПревышения.ФизическоеЛицо
			|			И РасширенныеДанныеОДоходах.НалоговаяБаза = ОснованияВДниПревышения.НалоговаяБаза
			|			И РасширенныеДанныеОДоходах.ДокументОснование = ОснованияВДниПревышения.ДокументОснование
			|			И РасширенныеДанныеОДоходах.ДатаПолученияДохода = ОснованияВДниПревышения.ДатаПолученияДохода
			|			И РасширенныеДанныеОДоходах.ГоловнаяОрганизация = ОснованияВДниПревышения.ГоловнаяОрганизация
			|ГДЕ
			|	(РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3
			|			ИЛИ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4)
			|	И РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год,
			|	РасширенныеДанныеОДоходах.Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.СтавкаЧислом,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДокументОснование,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3,
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4,
			|	ЕСТЬNULL(ОснованияВДниПревышения.ОписаниеДокумента, 0)
			|
			|ИМЕЮЩИЕ
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	ДатаПолученияДохода,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			
			ДоходыСУточненнымиСтавками = УчетНДФЛЗаполнениеОтчетности.ДополнительныеСтрокиПревышения(ТаблицаРасчетаНарастающимИтогом, Ложь, Ложь);
			Для каждого СтрокаТаблицы Из ДоходыСУточненнымиСтавками Цикл
				Если СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.15
				ИначеЕсли СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка18 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.18
				ИначеЕсли СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка20 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.20
				ИначеЕсли СтрокаТаблицы.Ставка = Перечисления.НДФЛСтавки.Ставка22 Тогда
					СтрокаТаблицы.СтавкаЧислом = 0.22
				Иначе
					
				КонецЕсли;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год КАК Год,
			|	ДоходыСУточненнымиСтавками.Месяц КАК Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод КАК КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.Ставка КАК Ставка,
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом КАК СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления КАК МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты КАК ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления КАК ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.Предел4Превышен
			|			ТОГДА 0.22
			|		КОГДА РасширенныеДанныеОДоходах.Предел3Превышен
			|			ТОГДА 0.2
			|		КОГДА РасширенныеДанныеОДоходах.Предел2Превышен
			|			ТОГДА 0.18
			|		КОГДА РасширенныеДанныеОДоходах.Предел1Превышен
			|			ТОГДА 0.15
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаЧислом
			|	КОНЕЦ КАК СтавкаЧислом,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.Предел4Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
			|		КОГДА РасширенныеДанныеОДоходах.Предел3Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
			|		КОГДА РасширенныеДанныеОДоходах.Предел2Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
			|		КОГДА РасширенныеДанныеОДоходах.Предел1Превышен
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РасширенныеДанныеОДоходах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Год КАК Год,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета,
			|	РасширенныеДанныеОДоходах.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКод КАК КодДоходаКод,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.МесяцНачисления КАК МесяцНачисления,
			|	РасширенныеДанныеОДоходах.ДатаВыплаты КАК ДатаВыплаты,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
			|	РасширенныеДанныеОДоходах.ДатаНачисления КАК ДатаНачисления,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.КодВычетаКодДляОтчетности КАК КодВычетаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.ДоходРазделаПо13 КАК ДоходРазделаПо13
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела1
			|	И НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела2
			|	И НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела3
			|	И НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела4
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаЧислом,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.РегистрацияВНалоговомОргане,
			|	ДоходыСУточненнымиСтавками.ГоловнаяОрганизация,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Год,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.СуммаВычета,
			|	ИСТИНА,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.КодДоходаКод,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.МесяцНачисления,
			|	ДоходыСУточненнымиСтавками.ДатаВыплаты,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДоходаФиксирована,
			|	ДоходыСУточненнымиСтавками.ДатаНачисления,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.КодВычетаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.ДоходРазделаПо13
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
			Запрос.Выполнить();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) КАК ГОД,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНачислено,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения < НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|						ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов - НДФЛРасчетыСБюджетом.СуммаСПревышения
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогКЗачету,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогУдержано,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УдержаноКЗачетуПоСтавке13,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогПереданоНаВзыскание,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогВозвращено,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК Месяц,
	|	НДФЛРасчетыСБюджетом.Период КАК Период,
	|	НДФЛРасчетыСБюджетом.Ставка КАК Ставка,
	|	НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза КАК НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДанныеОНалогах
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения < НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|						ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|					ИНАЧЕ НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышения
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышения <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке18 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке20 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	|				И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|				И НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				И НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	|			ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	|			ТОГДА -НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Период,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.Ставка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|		ИНАЧЕ НДФЛРасчетыСБюджетом.СтавкаПоИтогамГода
	|	КОНЕЦ,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.НалоговаяБаза,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТСтрокиНалоговСоСтавками КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона176ФЗ
	|	И НДФЛРасчетыСБюджетом.СуммаСПревышенияПоСтавке22 <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Авансы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Авансы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГОД(Авансы.МесяцНалоговогоПериода) КАК ГОД,
	|	Авансы.Сумма КАК Зачтено,
	|	Авансы.МесяцНалоговогоПериода КАК Месяц,
	|	Авансы.Период КАК Период,
	|	Авансы.Ставка КАК Ставка,
	|	Авансы.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	Авансы.НалоговаяБаза КАК НалоговаяБаза,
	|	Авансы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДанныеОЗачтенныхАвансах
	|ИЗ
	|	ВТСтрокиАвансов КАК Авансы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахПоРазделам.Месяц КАК Месяц,
	|	СУММА(СведенияОДоходахПоРазделам.СуммаДохода) КАК СуммаДохода,
	|	СведенияОДоходахПоРазделам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДоходыПоМесяцамПоСтавке13Итог
	|ИЗ
	|	ВТДоходыПоСтавкам КАК СведенияОДоходахПоРазделам
	|ГДЕ
	|	СведенияОДоходахПоРазделам.ДоходРазделаПо13
	|	И СведенияОДоходахПоРазделам.ОблагаетсяУНалоговогоАгента
	|	И (СведенияОДоходахПоРазделам.Месяц < &ДатаЗакона176ФЗ
	|			ИЛИ СведенияОДоходахПоРазделам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда))
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизическоеЛицо,
	|	СведенияОДоходахПоРазделам.Месяц,
	|	СведенияОДоходахПоРазделам.РегистрацияВНалоговомОргане
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыПоСтавкам.Год КАК Год,
	|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ДоходыПоСтавкам.Месяц КАК Месяц,
	|	ДоходыПоСтавкам.Ставка КАК Ставка,
	|	ЕСТЬNULL(МАКСИМУМ(ПредыдущийМесяц.Месяц), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Месяц, ГОД), СЕКУНДА, -1)) КАК ПредыдущийМесяц,
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТДоходыПо13
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ПредыдущийМесяц
	|		ПО ДоходыПоСтавкам.ГоловнаяОрганизация = ПредыдущийМесяц.ГоловнаяОрганизация
	|			И ДоходыПоСтавкам.ФизическоеЛицо = ПредыдущийМесяц.ФизическоеЛицо
	|			И ДоходыПоСтавкам.Год = ПредыдущийМесяц.Год
	|			И ДоходыПоСтавкам.НалоговаяБаза = ПредыдущийМесяц.НалоговаяБаза
	|			И ДоходыПоСтавкам.Месяц > ПредыдущийМесяц.Месяц
	|			И ДоходыПоСтавкам.РегистрацияВНалоговомОргане = ПредыдущийМесяц.РегистрацияВНалоговомОргане
	|			И ДоходыПоСтавкам.ДоходРазделаПо13 = ПредыдущийМесяц.ДоходРазделаПо13
	|			И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента = ПредыдущийМесяц.ОблагаетсяУНалоговогоАгента
	|ГДЕ
	|	ДоходыПоСтавкам.ДоходРазделаПо13
	|	И ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоСтавкам.ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизическоеЛицо,
	|	ДоходыПоСтавкам.НалоговаяБаза,
	|	ДоходыПоСтавкам.Год,
	|	ДоходыПоСтавкам.Месяц,
	|	ДоходыПоСтавкам.Ставка,
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПо13.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПо13.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоходыПо13.Год КАК Год,
	|	ДоходыПо13.Месяц КАК Месяц,
	|	ДоходыПо13.НалоговаяБаза КАК НалоговаяБаза,
	|	ДоходыПо13.Ставка КАК Ставка,
	|	ДоходыПо13.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ДоходыПоСтавкам.СуммаДохода) КАК СуммаДохода,
	|	СУММА(ДоходыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ПОМЕСТИТЬ ВТДоходыДоПолученияСтатусаРезидента
	|ИЗ
	|	ВТДоходыПо13 КАК ДоходыПо13
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ПО ДоходыПо13.ГоловнаяОрганизация = ДоходыПоСтавкам.ГоловнаяОрганизация
	|			И ДоходыПо13.ФизическоеЛицо = ДоходыПоСтавкам.ФизическоеЛицо
	|			И (ДоходыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И ДоходыПо13.Месяц > ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.ПредыдущийМесяц < ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.Год = ДоходыПоСтавкам.Год
	|			И ДоходыПо13.НалоговаяБаза = ДоходыПоСтавкам.НалоговаяБаза
	|			И ДоходыПо13.РегистрацияВНалоговомОргане = ДоходыПоСтавкам.РегистрацияВНалоговомОргане
	|			И (ДоходыПоСтавкам.ОблагаетсяУНалоговогоАгента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПо13.Год,
	|	ДоходыПо13.ГоловнаяОрганизация,
	|	ДоходыПо13.ФизическоеЛицо,
	|	ДоходыПо13.Месяц,
	|	ДоходыПо13.НалоговаяБаза,
	|	ДоходыПо13.Ставка,
	|	ДоходыПо13.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Период,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РеквизитыПлатежногоПоручения КАК РеквизитыПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбособленныеПодразделения КАК СписокФизЛицОрганизация
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация = СписокФизЛицОрганизация.Организация
	|ГДЕ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма <> 0
	|	И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК Месяц,
	|	МИНИМУМ(ДанныеОНалогах.Период) КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.ГОД КАК ГОД,
	|	ДанныеОНалогах.Месяц КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК Ставка,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК Налог,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТУдержаноНДФЛПоМесяцам
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.Месяц < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.ГОД,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ДанныеОНалогах.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТПеречисленоНДФЛПоМесяцам
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Перечислено.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Перечислено.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Перечислено.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	Перечислено.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Перечислено.Сумма - (ВЫРАЗИТЬ(Перечислено.Сумма * ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) / (ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0)) КАК ЧИСЛО(22, 0)))
	|	КОНЕЦ КАК КЗачетуПоСтавке13
	|ПОМЕСТИТЬ ВТКЗачетуПоПеречислениям
	|ИЗ
	|	ВТПеречисленоНДФЛПоМесяцам КАК Перечислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке13
	|		ПО Перечислено.ФизическоеЛицо = УдержаноНДФЛПоСтавке13.ФизическоеЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке13.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке13.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке13.ГоловнаяОрганизация
	|			И Перечислено.РегистрацияВНалоговомОргане = УдержаноНДФЛПоСтавке13.РегистрацияВНалоговомОргане
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке30
	|		ПО Перечислено.ФизическоеЛицо = УдержаноНДФЛПоСтавке30.ФизическоеЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке30.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке30.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке30.ГоловнаяОрганизация
	|			И Перечислено.РегистрацияВНалоговомОргане = УдержаноНДФЛПоСтавке30.РегистрацияВНалоговомОргане
	|ГДЕ
	|	Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецНП КАК Период,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета
	|ПОМЕСТИТЬ ВТСтандартныеВычетыВсе
	|ИЗ
	|	ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТВсеРегистрации
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОЗачтенныхАвансах.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОЗачтенныхАвансах КАК ДанныеОЗачтенныхАвансах";
	Запрос.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"РазмерВычетовНДФЛ",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСтандартныеВычетыВсе",
			"Период,КодВычета"));
			
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗачтенныеАвансы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЗачтенныеАвансы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗачтенныеАвансы.Месяц КАК Месяц,
	|	ЗачтенныеАвансы.Период КАК Дата,
	|	ЗачтенныеАвансы.Ставка КАК Ставка,
	|	ЗачтенныеАвансы.Зачтено КАК ЗачтеноАвансов,
	|	ЗачтенныеАвансы.НалоговаяБаза КАК НалоговаяБаза,
	|	ЗачтенныеАвансы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЗачтенныеАвансы.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода
	|ИЗ
	|	ВТДанныеОЗачтенныхАвансах КАК ЗачтенныеАвансы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацииВНалоговомОргане.КодПоОКАТО КАК КодПоОКАТО,
	|	РегистрацииВНалоговомОргане.КодПоОКТМО КАК КодПоОКТМО,
	|	РегистрацииВНалоговомОргане.КПП КАК КПП,
	|	РегистрацииВНалоговомОргане.Ссылка КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Ссылка В
	|			(ВЫБРАТЬ
	|				ВсеРегистрации.РегистрацияВНалоговомОргане
	|			ИЗ
	|				ВТВсеРегистрации КАК ВсеРегистрации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВычетыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|ГДЕ
	|	ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.НалоговаяБаза,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц
	|ИТОГИ
	|	СУММА(СуммаВычета)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Месяц,
	|	СтатусФизЛицНаКонецМесяца.Статус КАК Статус
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	Месяц
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПодтверждения.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерУведомления) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ИмущественныеВычетыНДФЛ КАК НДФЛИмущественныеВычетыФизлиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизическоеЛицо = ВТСписокФизЛицОрганизация.ФизическоеЛицо
	|				И НДФЛИмущественныеВычетыФизлиц.ГоловнаяОрганизация = ВТСписокФизЛицОрганизация.ГоловнаяОрганизация
	|				И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	|					ИЛИ НДФЛИмущественныеВычетыФизлиц.Организация = ВТСписокФизЛицОрганизация.Организация)
	|				И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|				И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСписокФизЛицОрганизация.ФизическоеЛицо,
	|		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация) КАК ДокументыПодтверждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|		ПО ДокументыПодтверждения.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|			И ДокументыПодтверждения.ФизическоеЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыПодтверждения.ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизическоеЛицо
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата КАК ДатаСправки,
	|	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки) КАК НомерСправки,
	|	МаксимальныеДатыСправок.Сотрудник КАК ФизическоеЛицо,
	|	1 КАК ТипСправки,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетностьЗаРеорганизованнуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетность)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане) КАК МаксимальныеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|			И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата,
	|	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки),
	|	МаксимальныеДатыСправок.Сотрудник,
	|	3,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛЗаРеорганизованнуюОрганизацию), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛ)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник,
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.РегистрацияВНалоговомОргане) КАК МаксимальныеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Сотрудники КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|			И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата,
	|	ПРЕДСТАВЛЕНИЕ(МаксимальныеДатыСправок.РегистрацияВНалоговомОргане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоследниеДатыСправок.Дата,
	|	МАКСИМУМ(СправкаПоНДФЛСотруднику.Номер),
	|	ПоследниеДатыСправок.ФизическоеЛицо,
	|	2,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокФизЛицОрганизация.ФизическоеЛицо КАК ФизическоеЛицо,
	|		МАКСИМУМ(СправкаПоНДФЛСотруднику.Дата) КАК Дата
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛ КАК СправкаПоНДФЛСотруднику
	|			ПО СписокФизЛицОрганизация.ФизическоеЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛСотруднику.Организация.ГоловнаяОрганизация
	|				И (СправкаПоНДФЛСотруднику.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛСотруднику.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокФизЛицОрганизация.ФизическоеЛицо) КАК ПоследниеДатыСправок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаНДФЛ КАК СправкаПоНДФЛСотруднику
	|		ПО ПоследниеДатыСправок.Дата = СправкаПоНДФЛСотруднику.Дата
	|			И ПоследниеДатыСправок.ФизическоеЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|			И (СправкаПоНДФЛСотруднику.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДатыСправок.ФизическоеЛицо,
	|	ПоследниеДатыСправок.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ТипСправки
	|ИТОГИ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтандартныеВычетыФизЛицОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтандартныеВычетыФизЛицОрганизации.Месяц КАК Месяц,
	|	ВЫБОР
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СтандартныеВычетыФизЛицОрганизации.Месяц < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ ВидыВычетовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычета,
	|	СтандартныеВычетыФизЛицОрганизации.КоличествоДетей КАК КоличествоДетей,
	|	СтандартныеВычетыФизЛицОрганизации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(СтандартныеВычетыФизЛицОрганизации.КоличествоДетей, 1) * ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0) КАК Размер,
	|	ВЫРАЗИТЬ(СтандартныеВычетыФизЛицОрганизации.Основание КАК СТРОКА(1000)) КАК Основание
	|ИЗ
	|	ВТСтандартныеВычетыФизЛицОрганизации КАК СтандартныеВычетыФизЛицОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРазмерВычетовНДФЛСрезПоследних КАК НДФЛРазмерВычетовСрезПоследних
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО СтандартныеВычетыФизЛицОрганизации.ФизическоеЛицо = СписокФизЛицОрганизация.ФизическоеЛицо
	|			И СтандартныеВычетыФизЛицОрганизации.ГоловнаяОрганизация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовНДФЛ КАК ВидыВычетовНДФЛ
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = ВидыВычетовНДФЛ.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	КодВычета,
	|	Месяц
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СоциальныеИИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ КАК КодВычетаКод,
	|	СоциальныеИИмущественныеВычеты.Размер КАК Размер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерУведомления) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(СоциальныеИИмущественныеВычеты.Дата, МЕСЯЦ) = СтатусФизЛицНаКонецМесяца.Месяц
	|				ТОГДА СоциальныеИИмущественныеВычеты.Дата
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Месяц
	|		КОНЕЦ) КАК Дата
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоциальныеИИмущественныеВычеты КАК СоциальныеИИмущественныеВычеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|			ПО СоциальныеИИмущественныеВычеты.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|				И СоциальныеИИмущественныеВычеты.ФизическоеЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Сотрудник
	|		ПО СтатусФизЛицНаКонецМесяца.ФизическоеЛицо = СоциальныеИИмущественныеВычеты.ФизическоеЛицо
	|			И (КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) >= СоциальныеИИмущественныеВычеты.Дата)
	|ГДЕ
	|	СтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоциальныеИИмущественныеВычеты.ФизическоеЛицо,
	|	СоциальныеИИмущественныеВычеты.Размер,
	|	СоциальныеИИмущественныеВычеты.Дата,
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2015, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2016, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2015Года
	|		КОГДА СоциальныеИИмущественныеВычеты.Дата < ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2023Года
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	КодВычетаКод,
	|	Дата
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Доходы.Раздел КАК Раздел,
	|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	МАКСИМУМ(Доходы.СуммаДоходаДоРезидентства) КАК СуммаДоходаДоРезидентства,
	|	МАКСИМУМ(Доходы.СуммаВычетаДоРезидентства) КАК СуммаВычетаДоРезидентства,
	|	МАКСИМУМ(Доходы.ОблагаемаяСуммаДоходаДоРезидентства) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|	Доходы.ДатаНачисления КАК ДатаНачисления,
	|	Доходы.МесяцНачисления КАК МесяцНачисления,
	|	Доходы.ДатаВыплаты КАК ДатаВыплаты,
	|	Доходы.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	Доходы.КодДоходаСсылка КАК КодДоходаСсылка,
	|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
	|	Доходы.КодВычетаСсылка КАК КодВычетаСсылка,
	|	СУММА(Доходы.СуммаВычета) КАК СуммаВычета,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.ОблагаетсяУНалоговогоАгента
	|				ТОГДА Доходы.ОблагаемаяСуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяСуммаДохода,
	|	СУММА(Доходы.НалогНачислено) КАК НалогНачислено,
	|	Доходы.КодДохода КАК КодДохода,
	|	Доходы.КодВычета КАК КодВычета,
	|	Доходы.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА Доходы.НалоговаяБаза
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА &ОбъединеннаяНалоговаяБазаСтрокой
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПредставлениеНалоговойБазы
	|	КОНЕЦ КАК НалоговаяБаза,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|						ТОГДА 1
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки)
	|						ТОГДА 2
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ)
	|						ТОГДА 3
	|					ИНАЧЕ 4
	|				КОНЕЦ
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПорядокНалоговойБазы
	|	КОНЕЦ КАК ПорядокНалоговойБазы,
	|	Доходы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода13,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода15,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода18,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода20,
	|	СУММА(ВЫБОР
	|			КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|				ТОГДА Доходы.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода22,
	|	СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ НЕ NULL  КАК ЭтоФизическоеЛицоСПревышением,
	|	ВЫБОР
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА 13
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА 15
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|			ТОГДА 18
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|			ТОГДА 20
	|		КОГДА Доходы.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|			ТОГДА 22
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокСтавки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыПоМесяцам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		ДоходыПоМесяцам.ФизическоеЛицо КАК ФизическоеЛицо,
	|		""Раздел4_Ставка13"" КАК Раздел,
	|		ДоходыПоМесяцам.Месяц КАК МесяцНалоговогоПериода,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) КАК СуммаДоходаДоРезидентства,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0) КАК СуммаВычетаДоРезидентства,
	|		ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) - ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|		ДоходыПоМесяцам.ДатаНачисления КАК ДатаНачисления,
	|		ДоходыПоМесяцам.МесяцНачисления КАК МесяцНачисления,
	|		ДоходыПоМесяцам.ДатаВыплаты КАК ДатаВыплаты,
	|		ДоходыПоМесяцам.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|		ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента КАК ОблагаетсяУНалоговогоАгента,
	|		ДоходыПоМесяцам.КодДохода КАК КодДоходаСсылка,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) КАК СуммаДохода,
	|		ДоходыПоМесяцам.КодВычета КАК КодВычетаСсылка,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0) КАК СуммаВычета,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0) КАК ОблагаемаяСуммаДохода,
	|		0 КАК НалогНачислено,
	|		ДоходыПоМесяцам.КодДоходаКодДляОтчетности КАК КодДохода,
	|		ДоходыПоМесяцам.КодВычетаКодДляОтчетности КАК КодВычета,
	|		ДоходыПоМесяцам.Ставка КАК Ставка,
	|		ДоходыПоМесяцам.НалоговаяБаза КАК НалоговаяБаза,
	|		ДоходыПоМесяцам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|		ДоходыПоМесяцам.Год КАК Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДоПолученияСтатусаРезидента КАК ДоходыДоПолученияСтатусаРезидента
	|			ПО ДоходыПоМесяцам.ГоловнаяОрганизация = ДоходыДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ДоходыПоМесяцам.ФизическоеЛицо = ДоходыДоПолученияСтатусаРезидента.ФизическоеЛицо
	|				И ДоходыПоМесяцам.Год = ДоходыДоПолученияСтатусаРезидента.Год
	|				И ДоходыПоМесяцам.Месяц = ДоходыДоПолученияСтатусаРезидента.Месяц
	|				И ДоходыПоМесяцам.РегистрацияВНалоговомОргане = ДоходыДоПолученияСтатусаРезидента.РегистрацияВНалоговомОргане
	|				И ДоходыПоМесяцам.Ставка = ДоходыДоПолученияСтатусаРезидента.Ставка
	|				И ДоходыПоМесяцам.НалоговаяБаза = ДоходыДоПолученияСтатусаРезидента.НалоговаяБаза
	|	ГДЕ
	|		ДоходыПоМесяцам.ДоходРазделаПо13
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоходыПоМесяцам.ГоловнаяОрганизация,
	|		ДоходыПоМесяцам.ФизическоеЛицо,
	|		ВЫБОР
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|				ТОГДА ""Раздел4_Ставка13""
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|				ТОГДА ""Раздел4_Дивиденды""
	|			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				ТОГДА ""Раздел4_Ставка30""
	|			ИНАЧЕ ""Раздел4_Ставка35_15_9""
	|		КОНЕЦ,
	|		ДоходыПоМесяцам.Месяц,
	|		0,
	|		0,
	|		0,
	|		ДоходыПоМесяцам.ДатаНачисления,
	|		ДоходыПоМесяцам.МесяцНачисления,
	|		ДоходыПоМесяцам.ДатаВыплаты,
	|		ДоходыПоМесяцам.ДатаПолученияДохода,
	|		ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента,
	|		ДоходыПоМесяцам.КодДохода,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|		ДоходыПоМесяцам.КодВычета,
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|		ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|		ВЫБОР
	|			КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|				ТОГДА 0
	|			КОГДА НЕ ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|				ТОГДА 0
	|			ИНАЧЕ (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * ДоходыПоМесяцам.СтавкаЧислом
	|		КОНЕЦ,
	|		ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|		ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|		ДоходыПоМесяцам.Ставка,
	|		ДоходыПоМесяцам.НалоговаяБаза,
	|		ДоходыПоМесяцам.РегистрацияВНалоговомОргане,
	|		ДоходыПоМесяцам.Год
	|	ИЗ
	|		ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|	ГДЕ
	|		НЕ ДоходыПоМесяцам.ДоходРазделаПо13
	|		И НЕ ДоходыПоМесяцам.ДатаПолученияДоходаФиксирована) КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеНалоговыхБаз КАК ОписаниеНалоговыхБаз
	|		ПО Доходы.НалоговаяБаза = ОписаниеНалоговыхБаз.КатегорияДохода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
	|		ПО Доходы.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
	|			И Доходы.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
	|			И Доходы.Год = СотрудникиСПревышением.Год
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ФизическоеЛицо,
	|	Доходы.ГоловнаяОрганизация,
	|	Доходы.Раздел,
	|	Доходы.МесяцНалоговогоПериода,
	|	Доходы.ДатаНачисления,
	|	Доходы.МесяцНачисления,
	|	Доходы.ДатаВыплаты,
	|	Доходы.ДатаПолученияДохода,
	|	Доходы.КодДоходаСсылка,
	|	Доходы.КодВычетаСсылка,
	|	Доходы.Ставка,
	|	Доходы.КодВычета,
	|	Доходы.РегистрацияВНалоговомОргане,
	|	Доходы.КодДохода,
	|	СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ НЕ NULL ,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА Доходы.НалоговаяБаза
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаОбъединенияНалоговыхБаз
	|			ТОГДА &ОбъединеннаяНалоговаяБазаСтрокой
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПредставлениеНалоговойБазы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Доходы.ДатаПолученияДохода >= &ДатаЗакона176ФЗ
	|			ТОГДА ВЫБОР
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|						ТОГДА 1
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки)
	|						ТОГДА 2
	|					КОГДА Доходы.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ)
	|						ТОГДА 3
	|					ИНАЧЕ 4
	|				КОНЕЦ
	|		ИНАЧЕ ОписаниеНалоговыхБаз.ПорядокНалоговойБазы
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(Доходы.СуммаДоходаДоРезидентства) <> 0
	|		ИЛИ МАКСИМУМ(Доходы.СуммаВычетаДоРезидентства) <> 0
	|		ИЛИ МАКСИМУМ(Доходы.ОблагаемаяСуммаДоходаДоРезидентства) <> 0
	|		ИЛИ СУММА(Доходы.СуммаДохода) <> 0
	|		ИЛИ СУММА(Доходы.СуммаВычета) <> 0
	|		ИЛИ СУММА(Доходы.ОблагаемаяСуммаДохода) <> 0
	|		ИЛИ СУММА(Доходы.НалогНачислено) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|			ТОГДА ""Раздел4_Ставка30""
	|		КОГДА ДоходыПоМесяцам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|			ТОГДА ""Раздел4_Дивиденды""
	|		ИНАЧЕ ""Раздел4_Ставка35_15_9""
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.Месяц,
	|	0,
	|	0,
	|	0,
	|	ДоходыПоМесяцам.ДатаНачисления,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДохода,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|	ДоходыПоМесяцам.КодВычета,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|			ТОГДА ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.ОблагаетсяУНалоговогоАгента
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * ДоходыПоМесяцам.СтавкаЧислом
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	"""",
	|	99,
	|	ДоходыПоМесяцам.РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА ДоходыПоМесяцам.СуммаДохода
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА ДоходыПоМесяцам.СуммаДохода
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	99
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|ГДЕ
	|	НЕ ДоходыПоМесяцам.ДоходРазделаПо13
	|	И ДоходыПоМесяцам.ДатаПолученияДоходаФиксирована
	|	И ДоходыПоМесяцам.СуммаДохода <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Раздел,
	|	ПорядокНалоговойБазы,
	|	МесяцНалоговогоПериода,
	|	МесяцНачисления,
	|	ДатаНачисления,
	|	ДатаВыплаты,
	|	КодДохода,
	|	КодВычета,
	|	ПорядокСтавки
	|ИТОГИ
	|	МАКСИМУМ(СуммаДоходаДоРезидентства),
	|	МАКСИМУМ(СуммаВычетаДоРезидентства),
	|	МАКСИМУМ(ОблагаемаяСуммаДоходаДоРезидентства),
	|	СУММА(СуммаДохода),
	|	СУММА(СуммаВычета),
	|	СУММА(ОблагаемаяСуммаДохода),
	|	МАКСИМУМ(НалогНачислено),
	|	СУММА(СуммаДохода13),
	|	СУММА(СуммаДохода15),
	|	СУММА(СуммаДохода18),
	|	СУММА(СуммаДохода20),
	|	СУММА(СуммаДохода22),
	|	МАКСИМУМ(ЭтоФизическоеЛицоСПревышением)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Раздел,
	|	НалоговаяБаза,
	|	МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	ВычетыПоСтавкам.МесяцПериодаПредоставленияВычета КАК МесяцПериодаПредоставленияВычета,
	|	ВычетыПоСтавкам.КодВычета КАК КодВычетаСсылка,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыПоМесяцамПоСтавке13Итог.СуммаДохода, 0)) КАК СуммаДохода,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	ВычетыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцамПоСтавке13Итог КАК ДоходыПоМесяцамПоСтавке13Итог
	|		ПО (ДоходыПоМесяцамПоСтавке13Итог.ГоловнаяОрганизация = ВычетыПоСтавкам.ГоловнаяОрганизация)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.ФизическоеЛицо = ВычетыПоСтавкам.ФизическоеЛицо)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.Месяц = ВычетыПоСтавкам.Месяц)
	|			И (ДоходыПоМесяцамПоСтавке13Итог.РегистрацияВНалоговомОргане = ВычетыПоСтавкам.РегистрацияВНалоговомОргане)
	|			И (ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.КодВычета,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.НалоговаяБаза,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.МесяцПериодаПредоставленияВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц,
	|	МесяцПериодаПредоставленияВычета,
	|	КодВычета
	|ИТОГИ
	|	СУММА(СуммаВычета),
	|	МАКСИМУМ(СуммаДохода)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	СУММА(ДанныеОНалогах.НалогНачислено) КАК НалогНачислено,
	|	СУММА(ДанныеОНалогах.НалогКЗачету) КАК НалогКЗачету,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК СтавкаПоИтогамГода,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА 13
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА 15
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|			ТОГДА 18
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|			ТОГДА 20
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|			ТОГДА 22
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокСтавки
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеОНалогах.НалогНачислено) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	ПорядокСтавки,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА 13
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА 15
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка18)
	|			ТОГДА 18
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка20)
	|			ТОГДА 20
	|		КОГДА ДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка22)
	|			ТОГДА 22
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокСтавки,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаНачалаРасчетаСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ КАК СрокПеречисления,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК НалогУдержано,
	|	СУММА(ДанныеОНалогах.УдержаноКЗачетуПоСтавке13) КАК КЗачетуПоСтавке13,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогУдержано <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаНачалаРасчетаСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	ПорядокСтавки,
	|	Ставка,
	|	СрокПеречисления
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	ДанныеОНалогах.НалогВозвращено КАК НалогВозвращено,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогВозвращено <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалоговаяБаза КАК НалоговаяБаза,
	|	ДанныеОНалогах.НалогПереданоНаВзыскание КАК НалогПереданоНаВзыскание,
	|	ДанныеОНалогах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогПереданоНаВзыскание <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	ДанныеОНалогах.НалоговаяБаза,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Месяц,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Дата,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	ЕСТЬNULL(ПеречисленоДоПолученияСтатусаРезидента.КЗачетуПоСтавке13, 0) КАК КЗачетуПоСтавке13,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РеквизитыПП КАК РеквизитыПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц КАК ПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКЗачетуПоПеречислениям КАК ПеречисленоДоПолученияСтатусаРезидента
	|			ПО ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация = ПеречисленоДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизическоеЛицо = ПеречисленоДоПолученияСтатусаРезидента.ФизическоеЛицо
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц = ПеречисленоДоПолученияСтатусаРезидента.МесяцНалоговогоПериода
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.РегистрацияВНалоговомОргане = ПеречисленоДоПолученияСтатусаРезидента.РегистрацияВНалоговомОргане
	|				И (ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизическоеЛицо
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.РегистрацияВНалоговомОргане
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизическоеЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.РегистрацияВНалоговомОргане
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо,
	|	РегистрацияВНалоговомОргане,
	|	КодВычета
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизическоеЛицо;  
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокСтавок.Ставка КАК Ставка,
	|	ВТ_ПорядокСтавок.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТ_ПорядокСтавок
	|ИЗ
	|	&ВТ_ПорядокСтавок КАК ВТ_ПорядокСтавок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДоходыДоПолученияСтатусаРезидента.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТДоходыДоПолученияСтатусаРезидента.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТДоходыДоПолученияСтатусаРезидента.Год КАК Год,
	|	ВТДоходыДоПолученияСтатусаРезидента.Месяц КАК Месяц,
	|	ВТДоходыДоПолученияСтатусаРезидента.Ставка КАК Ставка,
	|	ВТ_ПорядокСтавок.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТ_Выборка_ПоследняяСтавка
	|ИЗ
	|	ВТДоходыДоПолученияСтатусаРезидента КАК ВТДоходыДоПолученияСтатусаРезидента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПорядокСтавок КАК ВТ_ПорядокСтавок
	|		ПО ВТДоходыДоПолученияСтатусаРезидента.Ставка = ВТ_ПорядокСтавок.Ставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ВТ_Выборка_ПоследняяСтавка.Месяц) КАК Месяц,
	|	МАКСИМУМ(ВТ_ПорядокСтавок.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_Выборка_ПоследняяСтавка_МаксМес
	|ИЗ
	|	ВТ_Выборка_ПоследняяСтавка КАК ВТ_Выборка_ПоследняяСтавка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокСтавок КАК ВТ_ПорядокСтавок
	|		ПО ВТ_Выборка_ПоследняяСтавка.Ставка = ВТ_ПорядокСтавок.Ставка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_Выборка_ПоследняяСтавка.Год КАК Год,
	|	ВТ_Выборка_ПоследняяСтавка.Месяц КАК Месяц,
	|	ВТ_Выборка_ПоследняяСтавка.Ставка КАК Ставка
	|ИЗ
	|	ВТ_Выборка_ПоследняяСтавка_МаксМес КАК ВТ_Выборка_ПоследняяСтавка_МаксМес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Выборка_ПоследняяСтавка КАК ВТ_Выборка_ПоследняяСтавка
	|		ПО ВТ_Выборка_ПоследняяСтавка_МаксМес.Месяц = ВТ_Выборка_ПоследняяСтавка.Месяц
	|			И ВТ_Выборка_ПоследняяСтавка_МаксМес.ГоловнаяОрганизация = ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация
	|			И ВТ_Выборка_ПоследняяСтавка_МаксМес.ФизическоеЛицо = ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо
	|			И ВТ_Выборка_ПоследняяСтавка_МаксМес.Порядок = ВТ_Выборка_ПоследняяСтавка.Порядок;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_Выборка_ПоследняяСтавка.Год КАК Год,
	|	ВТ_Выборка_ПоследняяСтавка.Месяц КАК Месяц,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Выборка_ПоследняяСтавка.Ставка) КАК Ставка
	|ПОМЕСТИТЬ ВТ_Выборка_РазличныеСтавки
	|ИЗ
	|	ВТ_Выборка_ПоследняяСтавка КАК ВТ_Выборка_ПоследняяСтавка
	|ГДЕ
	|	ВТ_Выборка_ПоследняяСтавка.Месяц = НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация,
	|	ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо,
	|	ВТ_Выборка_ПоследняяСтавка.Год,
	|	ВТ_Выборка_ПоследняяСтавка.Месяц
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Выборка_ПоследняяСтавка.Ставка) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выборка_РазличныеСтавки.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВТ_Выборка_РазличныеСтавки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_Выборка_РазличныеСтавки.Год КАК Год,
	|	ВТ_Выборка_РазличныеСтавки.Месяц КАК Месяц,
	|	ВТ_Выборка_ПоследняяСтавка.Ставка КАК Ставка,
	|	ВТ_Выборка_ПоследняяСтавка.Порядок КАК Порядок
	|ИЗ
	|	ВТ_Выборка_ПоследняяСтавка КАК ВТ_Выборка_ПоследняяСтавка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Выборка_РазличныеСтавки КАК ВТ_Выборка_РазличныеСтавки
	|		ПО ВТ_Выборка_ПоследняяСтавка.ГоловнаяОрганизация = ВТ_Выборка_РазличныеСтавки.ГоловнаяОрганизация
	|			И ВТ_Выборка_ПоследняяСтавка.ФизическоеЛицо = ВТ_Выборка_РазличныеСтавки.ФизическоеЛицо
	|			И ВТ_Выборка_ПоследняяСтавка.Год = ВТ_Выборка_РазличныеСтавки.Год
	|			И ВТ_Выборка_ПоследняяСтавка.Месяц = ВТ_Выборка_РазличныеСтавки.Месяц";
	
	//RSN_ОбщегоНазначенияНаСервере.СохранитьЗапрос(Запрос);
	
	Результат = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результат.Количество();
	ТЗНДФЛ = Результат[21].Выгрузить();
	ЗаписьЖР(СобытиеЖР, "Конец сбора данных по зарплате");
	
	Возврат  ТЗНДФЛ;

КонецФункции // ВыполнитьHRИзменениеЗП()

Процедура HRИзменениеЗП_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез, дФайла)
	
	Если сРез.Количество() > 0 Тогда 
		
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");	
		
		сВложения = Новый Структура("Данные, ИмяФайла");
		сВложения.Вставить("Данные",Новый ДвоичныеДанные(дФайла.Путь));
		сВложения.Вставить("ИмяФайла",дФайла.ИмяФайла);
		Вложения = Новый Массив;
		
		Вложения.Добавить(сВложения);
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_ОтправитьHRИзменениеЗПНДФЛП", Истина);
		
		//ТекстHTML =  BirthDay_ТекстПисьма(СобытиеЖР,сРез);  
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Тема", "ЗУП: Уведомление об изменении ставки НДФЛ");    
		ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		//ПараметрыПисьма.Вставить("Текст", ТекстHTML);
		//ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
		ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыПисьма.Вставить("ПолучателиПисьма",ПолучателиПисьма);
		ПараметрыПисьма.Вставить("Вложения", Вложения);

		ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
		
		УдалитьФайлы(дФайла.Путь);
	КонецЕсли;	
	
КонецПроцедуры

Функция  ЗаписьВФайлИзменениеНДФЛ(СобытиеЖР,сРез)
	
	Шаблон = " Изменение ставки НДФЛ за";  
	ТипФайла = "XLSX";     
	
	дФайла = Новый Структура("ИмяФайла,Путь");
	
	Путь = КаталогВременныхФайлов(); 
	элДата =  Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");

	//КаталогВФ = КаталогВременныхФайлов();
    Уин = Новый УникальныйИдентификатор;
	ИмяФайла =  Шаблон +" "+ элДата;
	//ВременныйФайл = КаталогВФ + Строка(Уин) + ".pdf";
	
	Если сРез.Количество() > 0 Тогда   
		
				
		ПутьКФайлу = Путь + ИмяФайла + ".xlsx"; 
		СформироватьТД(СобытиеЖР,сРез, ИмяФайла, ПутьКФайлу, ТипФайла);
				
	КонецЕсли;
	
	
	дФайла.Вставить("ИмяФайла",ИмяФайла + ".xlsx");
	дФайла.Вставить("Путь",ПутьКФайлу); 
	
	Возврат дФайла;

КонецФункции


//ПолучитьТелефоныИзSD

Процедура ПолучитьТелефоныИзSD()

	СобытиеЖР = "ХД.ПолучитьТелефоныИзSD";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ПолучитьТелефоныИзSD";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	token_work   = "7A8107BF-8ED3-460A-B6B9-6A994276AC9A";  
	
	Рез = ВыборкаПолучитьIDСотрудников();
	
	ВыполнитьHttpПолучитьТелефоны(token_work, Рез);

	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Функция ВыборкаПолучитьIDСотрудников()

Запрос = Новый Запрос;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("СотрудникСтрока", "Alla Androse");
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦЗ_УчетнаяИнформацияПользователей.Почта КАК Почта1,
	|	ЦЗ_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|	ЦЗ_УчетнаяИнформацияПользователей.id_sd КАК id_sd1
	|ИЗ
	|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ЦЗ_УчетнаяИнформацияПользователей
	|ГДЕ
	|	ЦЗ_УчетнаяИнформацияПользователей.id_sd <> """"";

	//|	И ЦЗ_УчетнаяИнформацияПользователей.СотрудникСтрока = &СотрудникСтрока";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	

КонецФункции // ВыборкаПолучитьIDСотрудников()

Функция ВыполнитьHttpПолучитьТелефоны(token_work, Рез)
	
	Путь           = "sd.phoenixtrading.ltd";
	
	Для каждого эл Из Рез Цикл
		
		Если Не  ЗначениеЗаполнено(эл.id_sd1) Тогда
			Продолжить;	
		КонецЕсли;
		
			Запрос= "/api/v3/users/"+ эл.id_sd1; //+"?input_data=" + input_data;
		
		Попытка 
			
			//2741
			Файл           = КаталогВременныхФайлов()+"sd.txt";  
			
			
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8"); 
			Заголовки.Вставить("Authtoken", token_work);
			
			Запрос = Новый HTTPЗапрос(Запрос, Заголовки);
			Запрос.УстановитьТелоИзСтроки("", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);   //"UTF-8"
			HTTPСоединение = Новый HTTPСоединение(Путь,,,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));  //Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено)
			
			//Ответ = HTTPСоединение.ВызватьHTTPМетод("GET",Запрос);
			Ответ = HTTPСоединение.Получить(Запрос);
			
			Если Ответ.КодСостояния = 200 Тогда
				
				//ДанныеJSON =  Ответ.ПолучитьТелоКакСтроку();
				Данные = unJSON(Ответ.ПолучитьТелоКакСтроку());
				Тел = ПолучитьТелефон_SDпоID(Данные);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Тел)  Тогда  
				
				КлючЗаписи = Новый Структура("Почта,СотрудникСтрока");
				КлючЗаписи.Вставить("Почта", эл.Почта1);
				КлючЗаписи.Вставить("СотрудникСтрока", эл.СотрудникСтрока);
				
				ЗаписатьТелефонВУчетнуюИнформациюИзSD(КлючЗаписи, Тел);
				
			КонецЕсли;
			
			УдалитьФайлы(Файл);
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат "Ошибка обмена";
			
		КонецПопытки;
		
		
	КонецЦикла;
	
КонецФункции  

Процедура ЗаписатьТелефонВУчетнуюИнформациюИзSD(КлючЗаписи, Тел)
	
	Запись = РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();   
	
	Тел = ПривестиКШаблонуТел(Тел);
	
	Если Запись.Выбран() Тогда
		
		Запись.ОсновнойТелефон = Тел;		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПривестиКШаблонуТел(Тел)
	
	Если Лев(Тел,1) = "7" Тогда
	
		Тел = "+" + Тел;	
	
	КонецЕсли;
	
	Тел = СтрЗаменить(Тел," ","");
	Тел = СтрЗаменить(Тел,"(","");
	Тел = СтрЗаменить(Тел,")",""); 
	Тел = СтрЗаменить(Тел,"-","");
	
Возврат Тел;

КонецФункции // ПривестиКШаблонуТел()

Функция ПолучитьТелефон_SDпоID(МассивДанных)
	
	Попытка
		
		Тел = МассивДанных.Получить("user").Получить("mobile");
		
	Исключение
		
		Тел = Неопределено;
		
	КонецПопытки;	
	
	Возврат Тел;
	
КонецФункции // ПолучитьИД_SD()


//ВыровнятьМаскуТелефонов
Процедура ВыровнятьМаскуТелефонов()

	СобытиеЖР = "ХД.ВыровнятьМаскуТелефонов";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ВыровнятьМаскуТелефонов";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  

	
	
	ВыполнитьВыровнятьМаскуТелефонов();
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура ВыполнитьВыровнятьМаскуТелефонов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ZUPC_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|	ZUPC_УчетнаяИнформацияПользователей.ОсновнойТелефон КАК ОсновнойТелефон
	|ИЗ
	|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ZUPC_УчетнаяИнформацияПользователей";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать(); 
	
	Т = Новый Массив;
	Н = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		
		Если Лев(Выборка.ОсновнойТелефон,1)<>"+" и Лев(Выборка.ОсновнойТелефон,1)="9" Тогда
			
			Телефон =  "+7" + Выборка.ОсновнойТелефон;
			Н.Добавить(Телефон);
			
			Запись = РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				
				Запись.ОсновнойТелефон = Телефон;		
				Запись.Записать();	  
				
			КонецЕсли;
			
			
		Иначе
			
			Т.Добавить(Выборка.ОсновнойТелефон)
			
		КонецЕсли;
		
		
		//
		
		
	КонецЦикла;	 
	
	
КонецПроцедуры

//СравнитьТелефоныBB

Процедура СравнитьТелефоныBBЭксель() 
	
	СобытиеЖР = "ХД.СравнитьТелефоныBB";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	нОстутствуют = Новый Структура; 
	
	СтрокаРегламентноеЗадание = "СравнитьТелефоныBB";
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;
	
	//КаталогФайлаКИ = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("КаталогФайлаЗагрузкиБазыКлиентов- selecom.pro");
	
	КаталогФайлаКИ = "E:\temp\bl\Tel.xlsx";
	
	СравнитьТелефоныBB_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ);
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура СравнитьТелефоныBB_Выполнение(СобытиеЖР, нОстутствуют, КаталогФайлаКИ)
	
	Рез =  ПодготовитьТаблицуТелефоныBB(СобытиеЖР, КаталогФайлаКИ);
	
	Путь =  "E:\temp\bl\fs2.xlsx";
	
	Если Рез.Количество() > 0  Тогда
	//	
		 тРез = СравнитьТаблицуТелефоныBBсТелефонами( СобытиеЖР, Рез); 
	//	
	//	 Если  тРез.Количество() > 0 Тогда
	//	 
	//	 	 Телефоны_ЗаписьвФайл(СобытиеЖР, тРез, Путь)
	//	 
	//	 КонецЕсли;
	//	 
	КонецЕсли;
	
КонецПроцедуры 

Функция ПодготовитьТаблицуТелефоныBB(СобытиеЖР, КаталогФайлаКИ)
	
	мСтруктура = Новый Структура;
	
	ИмяФайла =  КаталогФайлаКИ;
	
	РезультатПоследнейЗагрузки = Истина;  
	
	СообщениеОбОшибке ="";
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда    
		ЗаписьЖР(СобытиеЖР, "Файл загрузки контактной информации не найден: " + ИмяФайла);
		
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла); 
	    
	//мРез = o_EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);

	мРез = EXCELВТаблицуЗначений(ДвоичныеДанные, Файл.Расширение,СобытиеЖР);
	Если мРез = Неопределено  Тогда
		мСтруктура.Вставить("Рез",Неопределено);
		Возврат мСтруктура;
	КонецЕсли;  
	

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);  
	
	ИмяФайлаБезРасширения = СтрЗаменить(ИмяФайла,".xls","");  	РасширениеБезТочки =   СтрЗаменить(Файл.Расширение,".","");
	
	//ДобавитьПрисоединенныйФайл(СправочникОбъект.Ссылка, ИмяФайлаБезРасширения, РасширениеБезТочки, ИмяФайла);

	тРез = мРез[0].Скопировать();   
	тРез.Очистить();
	//тРез.Свернуть("NO_,Name_Surname,DateOfRecruitment,JobTitle,MonthlySalary,InRubles,Exch_rate");
	//
	//нОтсутствуют = тРез.Скопировать();   
	//
	КЧ = Новый КвалификаторыЧисла(15,2);
	КСИНН = Новый КвалификаторыСтроки(150);
	КСКПП = Новый КвалификаторыСтроки(9);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	ОписаниеТиповД = Новый ОписаниеТипов(Массив, , );
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСИНН = Новый ОписаниеТипов(Массив, , ,КСИНН);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСКПП = Новый ОписаниеТипов(Массив, , ,КСКПП);
	//

	//тРез.Колонки.Добавить("ZUPC_ActualDepartmentName",ОписаниеТиповСИНН);  

	Рез = ПодготовитьТаблицуTel(мРез[0],тРез);
	
	Возврат Рез;
	
КонецФункции // ПодготовитьТаблицуКИ()

Функция ПодготовитьТаблицуTel(мРез, тРез)
	
	//ZUPC_ActualDepartmentName ="";
	
	Для каждого эл Из мРез Цикл
		
		//Если  ЗначениеЗаполнено(эл.Name_Surname) и  ЗначениеЗаполнено(эл.JobTitle)  Тогда
		  НоваяСтрока =  тРез.Добавить();   
		  ЗаполнитьЗначенияСвойств(НоваяСтрока,эл);  
		   //НоваяСтрока.ZUPC_ActualDepartmentName = ZUPC_ActualDepartmentName; 
		   //MonthlySalary = СтрЗаменить(эл.MonthlySalary,",","");
		   //НоваяСтрока.MonthlySalary = СтрЗаменить(MonthlySalary,"$","");

		   //НоваяСтрока.InRubles = СтрЗаменить(эл.InRubles,",","");

			
		//Иначе 
		   //ZUPC_ActualDepartmentName =  эл.NO_;    
		//КонецЕсли;
		   
	
	КонецЦикла;
	
   Возврат  тРез;
КонецФункции // ПодготовитьТаблицуHR()

Функция СравнитьТаблицуТелефоныBBсТелефонами(СобытиеЖР, Рез)    
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	HR.Name_Surname КАК Name_Surname,
	|	HR.DateOfRecruitment КАК DateOfRecruitment,
	|	HR.JobTitle КАК JobTitle,
	|	HR.PhoneNumber КАК PhoneNumber
	|ПОМЕСТИТЬ HR
	|ИЗ
	|	&HR КАК HR
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	HR.Name_Surname КАК Name_Surname,
	|	HR.DateOfRecruitment КАК DateOfRecruitment,
	|	HR.JobTitle КАК JobTitle,
	|	HR.PhoneNumber КАК PhoneNumber,
	|	ZUPC_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|	ZUPC_УчетнаяИнформацияПользователей.ОсновнойТелефон КАК ОсновнойТелефон
	|ИЗ
	|	HR КАК HR
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ZUPC_УчетнаяИнформацияПользователей
	|		ПО ((ВЫРАЗИТЬ(HR.Name_Surname КАК СТРОКА(150))) = ZUPC_УчетнаяИнформацияПользователей.Спеллинг)";
	
	
	Запрос.УстановитьПараметр("HR",Рез);
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура  Телефоны_ЗаписьвФайл(СобытиеЖР, тРез, Путь)
	
	Шаблон = "HR Establishment";  
	ТипФайла = "XLSX";     
	
	элДата =  Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ПутьКФайлу = Путь  +""+ элДата+Шаблон+".xlsx"; 
	СформироватьТД(СобытиеЖР, тРез, Шаблон, Путь, ТипФайла)
	
	
КонецПроцедуры



//ПолучитьIDИзSD
Процедура ПолучитьIDИзSD()

	СобытиеЖР = "ХД.ПолучитьIDИзSD";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ПолучитьIDИзSD";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	
	ПолучитьIDИзSDВыполнение();
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура ПолучитьIDИзSDВыполнение()
	Рез = ВыполнитьЗапросУИ();	
	Рез.Очистить();
	token_work = "7A8107BF-8ED3-460A-B6B9-6A994276AC9A";
	РазмерСтраницы = 100;
	НачальныйИндекс = 1;
	Пока Истина Цикл
		ЕстьСледующаяСтраница = ВыполнитьHttpIdSd(token_work, НачальныйИндекс, РазмерСтраницы, Рез);
		Если Не ЕстьСледующаяСтраница Тогда
			Прервать;
		КонецЕсли;
		НачальныйИндекс = НачальныйИндекс + РазмерСтраницы;
	КонецЦикла;
	Сообщить("Количество пользователей: " +Рез.Количество());
	ОбновитьИДВРегистре(Рез);
КонецПроцедуры

Функция ВыполнитьЗапросУИ()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦЗ_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ЦЗ_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|   ЦЗ_УчетнаяИнформацияПользователей.id_sd как id_sd
	|ИЗ
	|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ЦЗ_УчетнаяИнформацияПользователей
	|ГДЕ
	|	ЦЗ_УчетнаяИнформацияПользователей.Почта <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Почта";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВыполнитьHttpIdSd(token_work, НачальныйИндекс, РазмерСтраницы, Рез)
	Путь           = "sd.phoenixtrading.ltd";
	
	Файл           = КаталогВременныхФайлов()+"sd.txt";
	
	//ПоляПоиска = Новый Структура;   
	//ПоляПоиска.Вставить("email_id", эл.Почта);//"rinat.galimov@phoenixtrading.ltd");
	
	мДет  = Новый Структура;
	мДет.Вставить("row_count", РазмерСтраницы);
	мДет.Вставить("start_index", НачальныйИндекс);
	//мДет.Вставить("search_fields",ПоляПоиска);
	
	сЛистИнфо = Новый Структура;  	
	сЛистИнфо.Вставить("list_info",мДет); 
	
	ДанныеЗапроса  = новый СТруктура; 
	ДанныеЗапроса.Вставить("input_data",сЛистИнфо);  
	
	input_data = JSON(сЛистИнфо);
	Запрос= "/api/v3/users?input_data=" + input_data;
	
	//https://sd.phoenixtrading.ltd/api/v3/users?input_data={"list_info":{"row_count":"25"}}}
	
	Попытка 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8"); 
		Заголовки.Вставить("Authtoken", token_work);
		//Заголовки.Вставить("HTTP_X_HTTP_METHOD_OVERRIDE","GET");
		
		ЗапросМ = Новый HTTPЗапрос(Запрос,Заголовки);
		HTTPСоединение = Новый HTTPСоединение(
			Путь, , , , , 60, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
		Ответ = HTTPСоединение.Получить(ЗапросМ,Файл);              
		//Рез = Ответ.ПолучитьТелоКакСтроку();   
		
		Если Ответ.КодСостояния <> 200 Тогда
			ТекстСообщения = "Не удалось выполнить запрос веб-сервиса. Код ответа: " + Ответ.КодСостояния;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		ЧтениеJSON     = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьФайл(Файл);
		МассивДанных   = ПрочитатьJSON(ЧтениеJSON,Истина);
		ЧтениеJSON.Закрыть();
		
		Если Не ОбработатьПакет(МассивДанных, Рез) Тогда
			Сообщить("Данные кончились на шаге: " + НачальныйИндекс);
			Возврат Ложь;
		КонецЕсли;
		
		ЕстьСледующаяСтраница = ЕстьСледующаяСтраницаSD(МассивДанных);
		Если ЕстьСледующаяСтраница <> Неопределено Тогда
			Возврат ЕстьСледующаяСтраница;
		КонецЕсли;
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Возврат Ложь;
КонецФункции 

Функция ЕстьСледующаяСтраницаSD(МассивДанных)
	ЛистИнфо = МассивДанных.Получить("list_info");
	Если ЛистИнфо = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Признак = ЛистИнфо.Получить("has_more_rows");
	Если Признак = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Признак) = Тип("Булево") Тогда
		Возврат Признак;
	КонецЕсли;
	ПризнакСтрокой = НРег(Строка(Признак));
	Если ПризнакСтрокой = "true" Или ПризнакСтрокой = "истина" Или ПризнакСтрокой = "1" Тогда
		Возврат Истина;
	КонецЕсли;
	Если ПризнакСтрокой = "false" Или ПризнакСтрокой = "ложь" Или ПризнакСтрокой = "0" Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ОбновитьИДВРегистре(Рез)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;     
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рез.Почта КАК Почта,
	|	Рез.СотрудникСтрока КАК СотрудникСтрока,
	|	Рез.id_sd КАК id_sd
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Рез КАК Рез
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Почта КАК Почта,
	|	вт.СотрудникСтрока КАК СотрудникСтрока,
	|	вт.id_sd КАК id_sd,
	|	ЦЗ_УчетнаяИнформацияПользователей.Почта КАК Почта1,
	|	ЦЗ_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока1,
	|	ЦЗ_УчетнаяИнформацияПользователей.id_sd КАК id_sd1
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ЦЗ_УчетнаяИнформацияПользователей
	|		ПО (вт.Почта = ЦЗ_УчетнаяИнформацияПользователей.Почта)"; 
	
	Запрос.УстановитьПараметр("Рез",Рез);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Почта1) Тогда
			МЗ = РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
			МЗ.Почта 			= ВыборкаДетальныеЗаписи.Почта1; 
			МЗ.СотрудникСтрока  = ВыборкаДетальныеЗаписи.СотрудникСтрока1;
			МЗ.Прочитать();    
			
			Если МЗ.Выбран() Тогда
				МЗ.id_sd   = ВыборкаДетальныеЗаписи.id_sd;
			КонецЕсли;
				МЗ.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	//Для каждого эл Из Рез Цикл
	//	МЗ = РегистрыСведений.ЦЗ_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
	//	МЗ.Почта = эл.Почта;
	//	МЗ.Прочитать();    
	//	
	//	Если МЗ.Выбран() Тогда
	//		МЗ.id_sd   = эл.id_sd;
	//	КонецЕсли;
	//	//	МЗ.Записать();
	//КонецЦикла;
	

КонецПроцедуры // ОбновитьИДВРегистре()

Функция МассивВТаблицуЗначений(МассивСоответствий, мРез) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Если ТипЗнч(МассивСоответствий) = Тип("Массив")
		И МассивСоответствий.Количество() <> 0 Тогда
		
		
		Для каждого МСоответствие Из МассивСоответствий  Цикл
			
			МассивВТаблицуЗначений(МСоответствие,мРез);
			
		КонецЦикла; 
		
	ИначеЕсли  ТипЗнч(МассивСоответствий) = Тип("Соответствие") Тогда 
		
		СтрСтруктура = Новый Структура;
		
		мСтр = Новый Массив; 
		Для каждого МСоответствие  Из МассивСоответствий Цикл
			
			Если ТипЗнч(МСоответствие.Значение) = Тип("Соответствие") 
				или ТипЗнч(МСоответствие.Значение) = Тип("Массив") Тогда
				
				мСтрЭтаж = Новый Массив; 
				
				МассивВТаблицуЗначений(МСоответствие.Значение, мСтрЭтаж);
				СтрСтруктура.Вставить(МСоответствие.Ключ, мСтрЭтаж);
				
			Иначе
				
				Если ТипЗнч(МСоответствие.Ключ) = Тип("Строка")Тогда
					
					КлючДопустимый = МСоответствие.Ключ;
					КлючДопустимый = СтрЗаменить(КлючДопустимый,"-","_");
				
				КонецЕсли; 
				
				СтрСтруктура.Вставить(КлючДопустимый, МСоответствие.Значение);
				
			КонецЕсли;
		
		КонецЦикла;	
		
		мСтр.Добавить(СтрСтруктура); 
		мРез.Добавить(мСтр);
		
	Иначе

		//Для Каждого МСоответствие Из МассивСоответствий Цикл
		//	СтрСтруктура = Новый Структура;
		//	Если ТипЗнч(МСоответствие) = Тип("Соответствие") Тогда
		//		Для каждого Соотв Из МСоответствие Цикл
		//			СтрСтруктура.Вставить(МСоответствие.Ключ,МСоответствие.Значение);
		//		КонецЦикла;
		//	КонецЕсли;
		//	
		//КонецЦикла;
		

	КонецЕсли; 
	
	
	Возврат Таблица;
КонецФункции

Функция ОбработатьПакет(МассивДанных, Рез)
	Если  МассивДанных.Получить("users").Количество()>0  Тогда
		
		Для каждого эл Из  МассивДанных.Получить("users") Цикл
			
			НоваяСтрока = Рез.Добавить();
			НоваяСтрока.id_sd           =  эл.Получить("id");
			НоваяСтрока.СотрудникСтрока =  эл.Получить("name");
			НоваяСтрока.Почта           =  эл.Получить("email_id");
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
		
КонецФункции // ОбработатьПакет()

Функция ПолучитьИД_SD(МассивДанных)
	
	Попытка
		
		ид = МассивДанных.Получить("users")[0].Получить("id")
		
	Исключение
		
		ид = Неопределено;
		
	КонецПопытки;	
	
	Возврат ид;
	
КонецФункции // ПолучитьИД_SD()



////ПосмотретьТаблицаМонитораОбменаДанными

Процедура ПосмотретьТаблицаМонитораОбменаДанными()

	СобытиеЖР = "ХД.ТаблицаМонитораОбменаДанными";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ТаблицаМонитораОбменаДанными";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  

	
	
	ВыполнитьТаблицаМонитораОбменаДанными();
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

///ВыполнитьТаблицаМонитораОбменаДанными
Процедура ВыполнитьТаблицаМонитораОбменаДанными()
	
	ПланыОбменаБСП = ОбменДаннымиПовтИсп.ПланыОбменаБСП();
	
	ТаблицаМонитора = ОбменДаннымиСервер.ТаблицаМонитораОбменаДанными(ПланыОбменаБСП);
	
КонецПроцедуры


//ВыполнитьПодставлениеФизЛицаВУчетнойИнформации

Процедура ВыполнитьПодставлениеФизЛицаВУчетнойИнформации()
	
		СобытиеЖР = "ХД.ВыполнитьПодставлениеФизЛицаВУчетнойИнформации";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ВыполнитьПодставлениеФизЛицаВУчетнойИнформации";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	ЗаписатьПодставлениеФизЛицаВУчетнойИнформации();
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

КонецПроцедуры


Процедура ЗаписатьПодставлениеФизЛицаВУчетнойИнформации()
	
	Запрос = Новый Запрос;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|	ZUPC_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ZUPC_УчетнаяИнформацияПользователей.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	ZUPC_НовыеCотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ZUPC_НовыеCотрудники.Перевод КАК Перевод,
	|	ZUPC_НовыеCотрудники.Увольнение КАК Увольнение,
	|	ZUPC_НовыеCотрудники.СотрудникСтрока КАК СотрудникСтрока1,
	|	ZUPC_НовыеCотрудники.Сотрудник КАК Сотрудник,
	|	ZUPC_НовыеCотрудники.УникальныйИдентификатор КАК УникальныйИдентификатор1
	|ИЗ
	|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ZUPC_УчетнаяИнформацияПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_НовыеCотрудники КАК ZUPC_НовыеCотрудники
	|		ПО (ZUPC_УчетнаяИнформацияПользователей.УникальныйИдентификатор = ZUPC_НовыеCотрудники.УникальныйИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ZUPC_НовыеCотрудники.Сотрудник, 0) <> 0";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
			Запись = РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
			Запись.СотрудникСтрока = Выборка.СотрудникСтрока;  
			Запись.Почта 		   = Выборка.Почта;
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				
				Запись.ФизическоеЛицо = Выборка.ФизическоеЛицо;		
				Запись.Записать();
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	//
КонецПроцедуры

 ///ЗаполнитьФизЛицоПоИмениВУчИнф
 Процедура ЗаполнитьФизЛицоПоИмениВУчИнф()
	 
	 СобытиеЖР = "ХД.ЗаполнитьФизЛицоПоИмениВУчИнф";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ЗаполнитьФизЛицоПоИмениВУчИнф";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	ЗаписатьФизЛицоПоИмениВУчИнф();
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
 КонецПроцедуры

Процедура ЗаписатьФизЛицоПоИмениВУчИнф()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ZUPC_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|	ZUPC_УчетнаяИнформацияПользователей.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ZUPC_УчетнаяИнформацияПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ((ВЫРАЗИТЬ(ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СТРОКА(200))) = (ВЫРАЗИТЬ(ФизическиеЛица.ФИО КАК СТРОКА(200))))
	|ГДЕ
	|	ZUPC_УчетнаяИнформацияПользователей.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СотрудникСтрока) Тогда
			Запись = РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
			Запись.СотрудникСтрока = Выборка.СотрудникСтрока;  
			Запись.Почта 		   = Выборка.Почта;
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				
				Запись.ФизическоеЛицо = Выборка.Ссылка;		
				Запись.Записать();
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры
 

///
Процедура ВыполнитьСверкуДанных()
	
	СобытиеЖР = "ХД.ВыполнитьСверкуДанных";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ВыполнитьСверкуДанных";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;  
	
	ВыполнитьСверкуДанныхРегламентно();
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

КонецПроцедуры

Процедура ВыполнитьСверкуДанныхРегламентно() 
	
	Имя = "КоннекторФормОбработок";

	ФормаОбработки = ПолучитьФорму("Обработка." + Имя + ".Форма"); 
	
	//ПолучитьФорму("Обработка.кон
	//
	//Обработки.КоннекторФормОбработок.
	//
	//Справочники.Физи    
	
	//РеквизитыФормыВЗначение
	
КонецПроцедуры


// упр штатка
Процедура ВыполнитьВыгрузкуУправленческойШтатки()
	
	СобытиеЖР = "ХД.ВыполнитьВыгрузкуУправленческойШтатки";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ВыполнитьВыгрузкуУправленческойШтатки";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;   
	
	Путь =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("УпрШтатка", Истина)[0];
	
	Рез = ВыгрузитьУправленческуюШтатку();
	
	УпрШтатка_ЗаписьвФайл(СобытиеЖР,Рез,Путь);
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

КонецПроцедуры


Функция ВыгрузитьУправленческуюШтатку()
	
	Запрос =   Новый запрос; 
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|   УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо) КАК GUID,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualPositionTitle КАК Position,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName КАК Department,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Desk_Team КАК Desk_Team,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Locations КАК Location,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо.ZUPC_DateJoingGroup КАК DateJoingGroup,
	|	ВЫБОР
	|		КОГДА ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг <> """"
	|			ТОГДА ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг
	|		ИНАЧЕ ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|	КОНЕЦ КАК Спеллинг,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Приоритет, 0) КАК Приоритет
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_NonEstablishedEmployees = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

 Процедура УпрШтатка_ЗаписьвФайл(СобытиеЖР, нВыборка, Путь)
	  
	  //ИмяБазы = СтрЗаменить(СтрРазделить(СтрокаСоединенияИнформационнойБазы(), """")[3], "Acc-", "");
	  //ЕстьРасширениеRSN = Булево(РасширенияКонфигурации.Получить(Новый Структура("Имя", "RSN_ЗУП")).Количество());    
	  //Если ЕстьРасширениеRSN Тогда  
	  //    //МодульОбщегоНазначенияПовтИсп = ОбщегоНазначения.ОбщийМодуль("RSN_ОбщегоНазначенияПовтИсп");
	  //КонецЕсли;
	  	  
	  Если нВыборка.Количество() > 0 Тогда
		  
		  ПутьКФайлу = Путь +"УпрШтатка"+".xlsx"; 
		  
		  ТипФайла = "XLSX";
		  
		  СформироватьТД(СобытиеЖР,нВыборка, "УпрШтатка", ПутьКФайлу, ТипФайла);
		  
		  //ASPECT_ОтправитьПоSFTP(СобытиеЖР, ПутьКФайлу, ПутьЗагрузкиНаФТП);
		  
	  КонецЕсли;
	  
  КонецПроцедуры


//ВыполнитьВыгрузкуПосадкиСотрудников, перемещает предыдущие версии файлов в указанный каталог.  
//
Процедура ВыполнитьВыгрузкуПосадкиСотрудников()
	
	СобытиеЖР = "ХД.ВыполнитьВыгрузкуПосадкиСотрудников";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ВыполнитьВыгрузкуПосадкиСотрудников";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;   
	Данные =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ПутьПосадкаСотрудников", Истина);
	Путь =  Данные[0];
	ПереместитьПредыдущиеФайлы(Данные);
	
	Рез = ВыгрузитьПосадкуСотрудников();
	
	ПутьПосадкаСотрудников_ЗаписьвФайл(СобытиеЖР,Рез,Путь);
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

КонецПроцедуры

Процедура ПереместитьПредыдущиеФайлы(Данные)
	Путь =  Данные[0];
	ПутьПредыдущиеВерсии = Данные[1];
	ПредыдущиеФайлы = НайтиФайлы(Путь, "*.xlsx", Ложь);
	Для Каждого Файл Из ПредыдущиеФайлы Цикл
		ПереместитьФайл(Файл.ПолноеИмя, СтрШаблон("%1%2", ПутьПредыдущиеВерсии, Файл.Имя));
	КонецЦикла;
КонецПроцедуры

Функция ВыгрузитьПосадкуСотрудников()
	
	Запрос =   Новый запрос; 
	
	Запрос.УстановитьПараметр("ZUPC_Locations", Справочники.ZUPC_Locations.ПолучитьСсылку(Новый УникальныйИдентификатор("b8551897-21b5-11ef-a6f6-00505601b51a")));//MOSCOW (Справочник.ZUPC_Locations)
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Код КАК СотрудникКод,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Спеллинг КАК Спеллинг,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualPositionTitle КАК Position,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName КАК Department,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Приоритет КАК Приоритет,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Desk_Team КАК Desk_Team,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Locations КАК Location,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_ActualDepartmentName.Director КАК DepartmentDirector,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Desk_Team.TeamManager КАК Desk_TeamManager,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.НомерМеста КАК СотрудникНомерМеста,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Офис КАК СотрудникОфис
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_NonEstablishedEmployees = ЛОЖЬ
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_Locations = &ZUPC_Locations
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

 Процедура ПутьПосадкаСотрудников_ЗаписьвФайл(СобытиеЖР, нВыборка, Путь)
	  
	  //ИмяБазы = СтрЗаменить(СтрРазделить(СтрокаСоединенияИнформационнойБазы(), """")[3], "Acc-", "");
	  //ЕстьРасширениеRSN = Булево(РасширенияКонфигурации.Получить(Новый Структура("Имя", "RSN_ЗУП")).Количество());    
	  //Если ЕстьРасширениеRSN Тогда  
	  //    //МодульОбщегоНазначенияПовтИсп = ОбщегоНазначения.ОбщийМодуль("RSN_ОбщегоНазначенияПовтИсп");
	  //КонецЕсли;
	  
	  Нейминг =  "Staff accommodation " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	  
	  Если нВыборка.Количество() > 0 Тогда
		  
		  ПутьКФайлу = Путь +Нейминг+".xlsx"; 
		  		  ТипФайла = "XLSX";
		  
		  СформироватьТД(СобытиеЖР,нВыборка, Нейминг, ПутьКФайлу, ТипФайла);
		  
		  //ASPECT_ОтправитьПоSFTP(СобытиеЖР, ПутьКФайлу, ПутьЗагрузкиНаФТП);
		  
	  КонецЕсли;
	  
  КонецПроцедуры
  
  
  //ЗаполнитьУчетныеДанныевРСУчетнаяИнформация  

Процедура ЗаполнитьУчетныеДанныевРСУчетнаяИнформация()
	
	СобытиеЖР = "ХД.ЗаполнитьУчетныеДанныевРСУчетнаяИнформация";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	СтрокаРегламентноеЗадание = "ЗаполнитьУчетныеДанныевРСУчетнаяИнформация";
	
	//Если НЕ РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание) Тогда
	//	ЗаписьЖР(СобытиеЖР, "Не все условия проверки выполнены!");
	//	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	//	Возврат;
	//КонецЕсли;   
	
	//
	 ЗаписатьФизЛицоВУчИнфПоЛокации();
	//
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");

КонецПроцедуры


Процедура ЗаписатьФизЛицоВУчИнфПоЛокации()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ZUPC_УчетнаяИнформацияПользователей.Почта КАК Почта,
	|	ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СотрудникСтрока,
	|	ZUPC_УчетнаяИнформацияПользователей.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ZUPC_УчетнаяИнформацияПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ((ВЫРАЗИТЬ(ZUPC_УчетнаяИнформацияПользователей.СотрудникСтрока КАК СТРОКА(200))) = (ВЫРАЗИТЬ(ФизическиеЛица.ФИО КАК СТРОКА(200))))
	|ГДЕ
	|	ZUPC_УчетнаяИнформацияПользователей.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СотрудникСтрока) Тогда
			Запись = РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
			Запись.СотрудникСтрока = Выборка.СотрудникСтрока;  
			Запись.Почта 		   = Выборка.Почта;
			Запись.Прочитать();
			
			Если Не Запись.Выбран() Тогда
				
				//Запись.ФизическоеЛицо = Выборка.Ссылка;		
				//Запись.Записать();
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры

  


///  сервисные функции  

Функция РазницаДатВМесяцах(Дата1,Дата2)
	
	ДатаНач = ?(Дата1 < Дата2, Дата1, Дата2);
	ДатаКон = ?(Дата1 < Дата2, Дата2, Дата1);
	
	Годы = Год(ДатаКон) - Год(ДатаНач);
	Месяцы = Месяц(ДатаКон) - Месяц(ДатаНач);
	
	Разность = Месяцы + Годы * 12;
	
	Возврат Разность; 
	
КонецФункции	

Функция JSON(Данные, СОтступами = Истина) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Если СОтступами Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, "	");
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
    ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции  

Функция unJSON(Файл) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON; 
	
	Если  ТипЗнч(Файл) = Тип("Строка") Тогда
		ЧтениеJSON.УстановитьСтроку(Файл);    
	Иначе 
		ЧтениеJSON.ОткрытьФайл(Файл);
	КонецЕсли;
		
	Результат = ПрочитатьJSON(ЧтениеJSON,Истина);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийВТаблицуХТМЛ(ТабЗначений, СтруктураПараметрыТаблицыХТМЛ = Неопределено) Экспорт
	
	//СтруктураПараметрыТаблицыХТМЛ
	//
	//Общие параметры:
	//СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы - общая ширина таблица
	//СтруктураПараметрыТаблицыХТМЛ.ЦветШапки - цвет шапки таблицы пример "eadbaf"
	//СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется - по умолчанию ЛОЖЬ
	//
	//Индивиуальные для каждой колонки:
	//СтруктураПараметрыТаблицыХТМЛ.Заголовок1 - заголовок для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Ширина1 - ширина для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Положение1 - отвечает за положение текста в колонке (по умол. лево), передовать "center" или "right"
	
	//ТабЗначений = Новый ТаблицаЗначений;
	МассивИменКолонок = Новый Массив;
	
	Если ТипЗнч(СтруктураПараметрыТаблицыХТМЛ) <> Тип("Структура") Тогда
		СтруктураПараметрыТаблицыХТМЛ = Новый Структура;
	КонецЕсли;
				
	КоличествоКолонок = ТабЗначений.Колонки.Количество();
	ПунктПорядкуИспользуется = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ПунктПорядкуИспользуется"),СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется,ЛОЖЬ);	
	
	Если КоличествоКолонок < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	ЦветШапки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ЦветШапки")," bgcolor=""#" + СтруктураПараметрыТаблицыХТМЛ.ЦветШапки + """","");
	ШиринаТаблицы = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ШиринаТаблицы")," style=""width:" + СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы + "px""",""); 
	ТаблицаХТМЛ = "<table border=""1"" cellpadding=""1"" cellspacing=""0"" " + ШиринаТаблицы + ">
				|<tbody>
				|<tr>";
	
	//Первым выводим столбик П/П если он задан в шапку
	Если ПунктПорядкуИспользуется Тогда
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td" + ЦветШапки + " style=""width:30px"" align=""center"">п/п</td>";	
	КонецЕсли;
	
	//Формируем шапку
	Для Счетчик = 1 по КоличествоКолонок Цикл
		ИмяСвойстваШирина = "Ширина" + Счетчик;
		ШиринаСтолбца = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваШирина)," style=""width:" + СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваШирина] + "px""","");
		ИмяКолонки = ТабЗначений.Колонки[Счетчик-1].Имя;	
		ИмяСвойстваЗаголовок = "Заголовок" + Счетчик;
		Если ЗначениеЗаполнено(ТабЗначений.Колонки[Счетчик-1].Заголовок) Тогда
			ЗаголовокКолонки = ТабЗначений.Колонки[Счетчик-1].Заголовок;
		Иначе
			ЗаголовокКолонки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваЗаголовок),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваЗаголовок],ИмяКолонки);
		КонецЕсли;
		ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|<td" + ЦветШапки + ШиринаСтолбца + " align=""center"">" + ЗаголовокКолонки + "</td>";	
		МассивИменКолонок.Добавить(ИмяКолонки);
	КонецЦикла;
	ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	
	//Заполняем таблицу	
	ПунктПорядку = 0;
	Для каждого СтрокаТаблицы Из ТабЗначений Цикл
		ПунктПорядку = ПунктПорядку + 1;
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<tr>" + ?(ПунктПорядкуИспользуется, Символы.ПС + "<td align=""center"">" + ПунктПорядку + "</td>","") + "";
		Для Счетчик = 0 по КоличествоКолонок - 1 Цикл
			ИмяСвойстваПоложение = "Положение" + Строка(Счетчик + 1);
			Положение = " align=""" + ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваПоложение),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваПоложение],"left") + """";
			ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td " + Положение + ">" + СтрокаТаблицы[МассивИменКолонок[Счетчик]] + "</td>";			
		КонецЦикла;				
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	КонецЦикла;	
	
	ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|</tbody>
				|</table>";
	
	Возврат ТаблицаХТМЛ;

КонецФункции

 
  Процедура СформироватьТД(СобытиеЖР, ТабЗначений, ИмяФ, Путь, ТипФайла)
	  
	  Попытка
		  
		  ТабДок = Новый ТабличныйДокумент;// ЭлементыФормы.ПолеТабличногоДокумента;
		  ОбластьЗаголовка = ТабДок.ПолучитьОбласть(1, , 1, );
		  ДетальнаяСтрока = ТабДок.ПолучитьОбласть(1, , 1, );
		  КоличествоКолонок = ТабЗначений.Колонки.Количество();
		  
		  Для КолонкаТЗ = 0 По КоличествоКолонок - 1 Цикл //Формирование заголовков колонок
			  Область = ОбластьЗаголовка.Область(1, КолонкаТЗ + 1);
			  Область.Текст = ТабЗначений.Колонки[КолонкаТЗ].Имя;
			  Область.ЦветФона = WEBЦвета.СветлоЖелтый;
		  КонецЦикла;
		  ТабДок.Вывести(ОбластьЗаголовка);
		  
		  Для Каждого СтрокаТЗ Из ТабЗначений Цикл  //Заполнение Табличного Документа данными из Таблицы Значений
			  Для ТекущееПоле = 0 По КоличествоКолонок - 1 Цикл
				  Область = ДетальнаяСтрока.Область(1, ТекущееПоле + 1);
				  Область.СодержитЗначение = Истина;
				  
				  КС = Новый КвалификаторыСтроки(50);
				  Массив = Новый Массив;
				  Массив.Добавить(ТипЗнч(СтрокаТЗ[ТекущееПоле]));
				  ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
				  
				  Область.ТипЗначения = ОписаниеТиповС;
				  Область.Значение = СтрокаТЗ[ТекущееПоле];
			  КонецЦикла;
			  ТабДок.Вывести(ДетальнаяСтрока);
		  КонецЦикла;          
		  ТабДок.ОтображатьСетку = Истина;  
		  
		  ЗаписьЖР(СобытиеЖР, "тз записано в табличный документ! " + ИмяФ)
		  
	  Исключение
		  
		  ТекстПисьма =  "Ошибка запись тз в табличный документ! " + ИмяФ;
		  
		  ЗаписьЖР(СобытиеЖР, ТекстПисьма);
		  
		  //ВыполнитьОтправкуЭлектронногоПисьма(СобытиеЖР, ТекстПисьма);
		  
	  КонецПопытки;
	  
	  
	  ЗаписатьТабДок(СобытиеЖР,ТабДок, ИмяФ, Путь, ТипФайла);
	  
	  //ТабДок.Показать();
	  
  КонецПроцедуры 
  
  Процедура ЗаписатьТабДок(СобытиеЖР, ТабличныйДокумент, ИмяФ, Путь, ТипФайла)
	  
	  
	  Если ТипФайла = "XLSX"  Тогда
		  
		  ТипФайлаТД =  ТипФайлаТабличногоДокумента.XLSX;
		  
	  ИначеЕсли  ТипФайла = "XLS"  Тогда
		  
		  ТипФайлаТД =  ТипФайлаТабличногоДокумента.XLS;    
		  
	  ИначеЕсли  ТипФайла = "CSV"  Тогда
		  
		  ТипФайлаТД =  ТипФайлаТабличногоДокумента.TXT;    
		  
	  Иначе
		  
		  ТипФайлаТД =  ТипФайлаТабличногоДокумента.TXT;	 
		  
	  КонецЕсли;
	  
	  
	  Попытка
		  
		  ФайлНаДиске = Новый Файл(Путь);
		  
		  ТабличныйДокумент.Записать(Путь, ТипФайлаТД);
		  
		  ЗаписьЖР(СобытиеЖР, "Файл записан!");
		  
	  Исключение 
		  
		  ТекстПисьма = "Ошибка записи файла!" + ОписаниеОшибки(); 
		  
		  ЗаписьЖР(СобытиеЖР, ТекстПисьма);
		  
		  //ВыполнитьОтправкуЭлектронногоПисьма(СобытиеЖР, ТекстПисьма);
		  
	  КонецПопытки;
	  
  КонецПроцедуры
  


Функция ПоискПоИННОбъекта(ИНН)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотенциальныеКлиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПотенциальныеКлиенты КАК ПотенциальныеКлиенты
	|ГДЕ
	|	ПотенциальныеКлиенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Ссылка_ИНН_Найден =  Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка_ИНН_Найден = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
Возврат	Ссылка_ИНН_Найден

КонецФункции // ПоискПоИННОбъекта()

Процедура КонтактнаяИнформацияПредставлениеПриИзмененииНаСервере(СтруктураКИ, ОбъектП)
	
	
	Если СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон  Тогда
		
		//ТелефонСтруктура = Новый Структура;
		
		Телефон = СтруктураКИ.Представление;
		ТелефонКодСтраны = Сред(Телефон,2,1);  
		ТелефонКодГорода = Сред(Телефон,3,3);  
		ТелефонНомер     = Сред(Телефон,6,7);
		
		СтруктураКИ.Вставить("Представление", Телефон);
		СтруктураКИ.Вставить("Комментарий",  "тестовый номер 2");
		
		СтруктураКИ.Вставить("КодСтраны",     ТелефонКодСтраны);
		СтруктураКИ.Вставить("КодГорода",     ТелефонКодГорода);
		СтруктураКИ.Вставить("НомерТелефона", ТелефонНомер);
		
		Тип = Перечисления.ТипыКонтактнойИнформации.Телефон; 
	КонецЕсли;
	
	КИ_XML 	=  УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураКИ,"", СтруктураКИ.Тип);
	
	КИ_JSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(КИ_XML);
	
	//ОбъектП = РеквизитФормыВЗначение("Объект");
	
	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектП, КИ_JSON, СтруктураКИ.Вид, ТекущаяДата(), Ложь);
	
	//ЗначениеВРеквизитФормы(ОбъектП, "Объект");
	
КонецПроцедуры

Функция EXCELВТаблицуЗначений(ДвоичныеДанные, Расширение,СобытиеЖР)
	
	Попытка 
		ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
		ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ФайлEXCELНаСервере);
	Исключение
		ЗаписьЖР(СобытиеЖР, "Ошибка чтения файла: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	УдалитьФайлы(ФайлEXCELНаСервере);
	
	Результат = Новый СписокЗначений;
	Области = ТабличныйДокумент.Области;
	Если Области.Количество()=0 Тогда 
		ВызватьИсключение("В файле нет областей");
	КонецЕсли;
	
	ФункцияОбработкиСтрок = "СокрЛП(?)";
	
	МассивДанных = Новый Массив;

	Для Каждого Обл Из Области Цикл
		ТекТабДок = Новый ТабличныйДокумент;   
		ТД = Новый Структура;
		ОгрОбласть = ПолучитьОграниченнуюОбласть(ТабличныйДокумент, Обл);
		// вставим область в табдок
		ОгрОбласть.Имя = Обл.Имя;
		ТекТабДок.ВставитьОбласть(ОгрОбласть, 
		ТекТабДок.Область(1, ОгрОбласть.Лево, ОгрОбласть.Низ - ОгрОбласть.Верх + 1, ОгрОбласть.Право)
		);
		
		ОбластьТ = ТекТабДок.Область(ОгрОбласть.Верх, ОгрОбласть.Лево, ОгрОбласть.Низ - ОгрОбласть.Верх + 1, ОгрОбласть.Право);  
		
		СократитьСтроки(ТекТабДок, ФункцияОбработкиСтрок);
		
		ТД.Вставить("ОгрОбластьИмя",ОгрОбласть.Имя);
		ТД.Вставить("ТекТабДок",ТекТабДок); 
		ТД.Вставить("ОбластьТ",ОбластьТ);
       
		МассивДанных.Добавить(ТД);
		Результат.Добавить(ТекТабДок, Обл.Имя);
	КонецЦикла;
	
	
	//ОбластьТаблицы = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
	    Рез = Новый Массив;
		Для каждого эл Из МассивДанных Цикл  
			//ОбластьТаблицы = эл.Значение.Область(1, 1,  эл.Значение.ВысотаТаблицы,  эл.Значение.ШиринаТаблицы);
			ОбластьТаблицы = эл.ОбластьТ;
			ПостроительЗапроса = Новый ПостроительЗапроса;
			ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);
			ПостроительЗапроса.Выполнить();
			ТаблицаДанных = ПостроительЗапроса.Результат.Выгрузить();  
			Рез.Добавить(ТаблицаДанных);
		КонецЦикла;
	
	Возврат Рез;
	
КонецФункции       

Функция o_EXCELВТаблицуЗначений(ДвоичныеДанные, Расширение,СобытиеЖР)
	
	Попытка 
		ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
		ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ФайлEXCELНаСервере);
	Исключение
		ЗаписьЖР(СобытиеЖР, "Ошибка чтения файла: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	УдалитьФайлы(ФайлEXCELНаСервере);
	
	ОбластьТаблицы = ТабличныйДокумент.Область(2, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);
	ПостроительЗапроса.Выполнить();
	ТаблицаДанных = ПостроительЗапроса.Результат.Выгрузить();
	
	Возврат ТаблицаДанных;
	
КонецФункции 

Процедура СократитьСтроки(ТабДок, ФункцияОбработкиСтрок = "СокрЛП(?)")
    
    Если ПустаяСтрока(ФункцияОбработкиСтрок) Тогда 
        Возврат;
    КонецЕсли;
    
    Если Ложь Тогда ТабДок = Новый ТабличныйДокумент; КонецЕсли; // фейк
    
    Для Стр = 1 По ТабДок.ВысотаТаблицы Цикл 
        Для Кол = 1 По ТабДок.ШиринаСтраницы Цикл 
            ТекОбласть = ТабДок.Область(Стр, Кол);
            ТекстОбласти = ТекОбласть.Текст;
            Если Не ТекОбласть.СодержитЗначение И Не ПустаяСтрока(ТекОбласть.Текст)    Тогда 
                Выражение = СтрЗаменить(ФункцияОбработкиСтрок, "?", "ТекстОбласти");
                ТекОбласть.Текст = Вычислить(Выражение);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

Функция ПолучитьОграниченнуюОбласть(ТабДок, ОбластьЯчеек,
    ОграничиватьСверху = Истина, ОграничиватьСлева = Истина, ОграничиватьСнизу = Истина, ОграничиватьСправа = Истина)
    
    Если Не ОграничиватьСверху И Не ОграничиватьСлева И Не ОграничиватьСправа И Не ОграничиватьСнизу Тогда 
        Возврат ОбластьЯчеек;
    КонецЕсли;
    
    Если Ложь Тогда // фейк
        ТабДок = Новый ТабличныйДокумент;
        ОбластьЯчеек = ТабДок.Области[0];
    КонецЕсли;
    
    Лево = Неопределено; Право = Неопределено; Верх = Неопределено; Низ = Неопределено;
    МаксШирина = ТабДок.ШиринаТаблицы;
    Для Стр = ОбластьЯчеек.Верх По ОбластьЯчеек.Низ Цикл
        Для Кол = 1 По МаксШирина Цикл 
            ТекОбласть = ТабДок.Область(Стр, Кол);
            Если ЭтоЗначащаяОбласть(ТекОбласть) Тогда 
                Лево = ?(Лево=Неопределено, Кол, Мин(Лево, Кол));
                Право = ?(Право=Неопределено, Кол, Макс(Право, Кол));
                Верх = ?(Верх=Неопределено, Стр, Верх);
                Низ = ?(Низ=Неопределено, Стр, Макс(Низ, Стр));
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
    Результат = ТабДок.Область(
        ?(ОграничиватьСверху, ?(Верх=Неопределено, ОбластьЯчеек.Верх, Верх), ОбластьЯчеек.Верх),
        ?(ОграничиватьСлева, ?(Лево=Неопределено, ОбластьЯчеек.Лево, Лево), ОбластьЯчеек.Лево),
        ?(ОграничиватьСнизу, ?(Низ=Неопределено, ОбластьЯчеек.Низ, Низ), ОбластьЯчеек.Низ),
        ?(ОграничиватьСправа, ?(Право=Неопределено, ОбластьЯчеек.Право, Право), ОбластьЯчеек.Право)
    );
    
    Возврат Результат;
    
КонецФункции 

Функция ЭтоЗначащаяОбласть(ОбластьЯчеек)
    Возврат Не ПустаяСтрока(ОбластьЯчеек.Текст) 
        Или ОбластьЯчеек.Гиперссылка
        Или ОбластьЯчеек.СодержитЗначение
        //Или ОбластьЯчеек.ГраницаСверху.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
        //Или ОбластьЯчеек.ГраницаСнизу.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
        Или ОбластьЯчеек.ГраницаСлева.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
        Или ОбластьЯчеек.ГраницаСправа.ТипЛинии<>ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
    ;
КонецФункции

Функция ТаблицаЗначенийВТабличныйДокумент(ТаблицаДанных)

ПостроительОтчета = Новый ПостроительОтчета;
ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
ДокументРезультат = Новый ТабличныйДокумент;
Построительотчета.Вывести(ДокументРезультат);
Возврат ДокументРезультат;

КонецФункции

Функция ПодготовитьКИ(мРез,тРез)
	Для каждого эл Из мРез Цикл
		Если ЗначениеЗаполнено(эл.ИНН) или  ЗначениеЗаполнено(эл.ЭлектронныйАдрес)  или  ЗначениеЗаполнено(эл.Email) или  ЗначениеЗаполнено(эл.Email) или  ЗначениеЗаполнено(эл.Телефоны) Тогда
			//Если ЗначениеЗаполнено(эл.ПаспортНомер) и  ЗначениеЗаполнено(эл.ПаспортСерия) Тогда
				НоваяСтрока =  тРез.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,эл);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат тРез;
КонецФункции // ПодготовитьКИ()     
  
Функция ПолучитьИННКПП(СтрокаИННКПП)
	
  мСтруктура = Новый Структура;
  	 
  ИННПОЗ  = СтрНайти(СтрокаИННКПП,"ИНН");
  ПОЗ = 10;
  ИНН = Сред(СтрокаИННКПП,ИННПОЗ+4,ПОЗ);
  мСтруктура.Вставить("ИНН",ИНН);

  КПППОЗ  = СтрНайти(СтрокаИННКПП,"КПП");
  ПОЗКПП = 9;
  КПП = Сред(СтрокаИННКПП,КПППОЗ+4,ПОЗКПП);
  мСтруктура.Вставить("КПП",КПП);
 Возврат мСтруктура;
КонецФункции // ПолучитьИННКПП()

Процедура  ОбновитьКИВнешнееСоединение(КодВладельцаДоговора,Вид, Значение,ВнешнееСоединение) 
	
	КонтрагнетНайден = ВнешнееСоединение.Справочники.Контрагенты.НайтиПоКоду(КодВладельцаДоговора);
	
	НаборЗаписей = ВнешнееСоединение.РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(КонтрагнетНайден);  
	НаборЗаписей.Прочитать();
	
	Для каждого эл Из НаборЗаписей  Цикл
		Если ВнешнееСоединение.String(эл.Вид) = Вид Тогда
				эл.Представление = Значение	
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция  ПолучитьКИВнешнееСоединение(КодВладельцаДоговора,ВнешнееСоединение)

	Запрос = ВнешнееСоединение.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|КонтактнаяИнформация.Объект КАК Объект,
	|ПРЕДСТАВЛЕНИЕ(КонтактнаяИнформация.Тип) КАК Тип,
	|ПРЕДСТАВЛЕНИЕ(КонтактнаяИнформация.Вид) КАК Вид,
	|КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект.Код = &Код";
	
	Запрос.УстановитьПараметр("Код",КодВладельцаДоговора);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если  РезультатЗапроса.Количество()=0 Тогда
		  РезультатЗапроса = Неопределено;
	КонецЕсли;
	
    Возврат   РезультатЗапроса

КонецФункции //  ПолучитьКИВнешнееСоединение(КодВладельцаДоговора,ВнешнееСоединение)()

Функция ИщемПОДоговору(КодДоговора,Рез)
	
	Для каждого эл Из Рез Цикл
	       Если СтрНайти(эл.Наименование,КодДоговора)>0 Тогда
		   	  КодВладельца = эл.ВладелецКод;
		      Возврат КодВладельца
		  Иначе 
			 КодВладельца = Неопределено; 
		   КонецЕсли;
	КонецЦикла;
	
	Возврат КодВладельца

КонецФункции // ИщемПОДоговору(эл.Документ,Рез)()

Функция ПолучитьКонтрагентаВнешнееСоединение(ФИО,ВнешнееСоединение)
	
	мФИО =  СинтезСтрокиПробел(ФИО);
	
	Запрос = ВнешнееСоединение.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Владелец КАК Владелец,
	|	ТИПЗНАЧЕНИЯ(Договоры.Владелец) КАК Тип,
	|	Договоры.Наименование КАК Наименование,
	|	Договоры.Владелец.Код КАК ВладелецКод,
	|	Договоры.Владелец.ИНН КАК ВладелецИНН,
	|	Договоры.Владелец.НаименованиеПолное КАК ВладелецНаименованиеПолное
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Владелец.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","%"+мФИО[0]+"%");
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если  РезультатЗапроса.Количество()=0 Тогда
		  РезультатЗапроса = Неопределено;
	КонецЕсли;
	
    Возврат   РезультатЗапроса

КонецФункции // ПолучитьКонтрагентаВнешнееСоединение()

/////////  

Процедура ЗаписатьЗавершениеЗаданияВРегистр(ИмяРегламентногоЗадания, УдалитьПредыдущие = Истина)
	
	Если НеРегистрироватьВыполнениеЗаданияВРегистрВыполненных Тогда
		Возврат;
	КонецЕсли;
	
	Если УдалитьПредыдущие Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыполнениеРегламентныхЗаданий.Период,
			|	ВыполнениеРегламентныхЗаданий.РегламентноеЗадание
			|ИЗ
			|	РегистрСведений.ВыполнениеРегламентныхЗаданий КАК ВыполнениеРегламентныхЗаданий
			|ГДЕ
			|	ВыполнениеРегламентныхЗаданий.РегламентноеЗадание = &РегламентноеЗадание";
		
		Запрос.УстановитьПараметр("РегламентноеЗадание", ИмяРегламентногоЗадания);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ВыполнениеРегламентныхЗаданий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
			НаборЗаписей.Отбор.РегламентноеЗадание.Установить(ВыборкаДетальныеЗаписи.РегламентноеЗадание);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
	
	КонецЕсли;
	
	мз = РегистрыСведений.ВыполнениеРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	мз.Период = ТекущаяДата();
	мз.РегламентноеЗадание = ИмяРегламентногоЗадания;
	мз.ДатаЗавершения = ТекущаяДата();
	
	мз.Записать(Истина);
	
КонецПроцедуры

Функция РегламентноеЗадание_ВсеУсловияВыполнены(СобытиеЖР, СтрокаРегламентноеЗадание)
	
	Если НЕ ИгнорироватьПроверкиДнейРаботыОбработки Тогда
		//
		////Если СегодняВыходной() Тогда
		////	ЗаписьЖР(СобытиеЖР, "Сегодня выходной - выполнение не требуется");
		////	Возврат Ложь;
		////КонецЕсли;
		//
		//Если РегламентноеЗаданиеВыполнялосьСегодня(СтрокаРегламентноеЗадание) Тогда    //"ДУ_ПолучениеДатыИсполнения"
		//	ЗаписьЖР(СобытиеЖР, "Задание было выполнено сегодня ранее");
		//	Возврат Ложь;
		//КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции   

Процедура РегламентноеЗадание_РассылкаВыполнена(СобытиеЖР, Получатели, Рассылка, УдалитьПредыдущие, ЭлектронноеПисьмоИсходящее)
	
	Если НеРегистрироватьВыполнениеРассылки Тогда
		Возврат;
	КонецЕсли;
	
	Если УдалитьПредыдущие Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыполнениеРегламентныхЗаданий.Рассылка
		|ИЗ
		|	РегистрСведений.ВыполненныеРассылки КАК ВыполненныеРассылки
		|ГДЕ
		|	ВыполненныеРассылки.Рассылка = &Рассылка";
		
		Запрос.УстановитьПараметр("Рассылка", Рассылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ВыполнениеРегламентныхЗаданий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Рассылка.Установить(ВыборкаДетальныеЗаписи.Рассылка);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
		мз = РегистрыСведений.ВыполненныеРассылки.СоздатьМенеджерЗаписи();
		мз.ДатаСоздания = ТекущаяДата();
		мз.Рассылка = Рассылка;
		мз.Объект = Получатели.Ссылка;
		мз.ЭлектронноеПисьмоИсходящее = ЭлектронноеПисьмоИсходящее;
		мз.Записать(Истина);	
	
	ЗаписьЖР(СобытиеЖР, "Рассылки выполненны: " + ТекущаяДата());
	
КонецПроцедуры
 
Процедура ЗаписьЖР(СобытиеЖР, Комментарий, ЖурналОбработки = Неопределено, ЕстьОшибки = Ложь, ОписаниеОшибки = Неопределено, ИзменитьНаУровень = Неопределено)
	
	УровеньЖР = УровеньЖурналаРегистрации.Информация;
	
	Если ЕстьОшибки Тогда
		
		УровеньЖР = УровеньЖурналаРегистрации.Ошибка;
		
		Если НЕ ОписаниеОшибки = Неопределено Тогда
			
			ОписаниеОшибки = ОписаниеОшибки + Комментарий + Символы.ПС;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ИзменитьНаУровень = Неопределено Тогда
		УровеньЖР = ИзменитьНаУровень;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(СобытиеЖР,УровеньЖР,,,Комментарий);
	
	Если Не ЖурналОбработки = Неопределено Тогда
		
		ЖурналОбработки = ЖурналОбработки + ТекущаяДатаСеанса() + ": " + Комментарий + Символы.ПС + Символы.ПС;
		
	КонецЕсли;
	
КонецПроцедуры


//Процедура Пауза(Миллисекунд)
//	
//	СтрокаЗапроса = "ping -n 1 -w "+Формат(Миллисекунд, "ЧДЦ=0; ЧГ=") + " 127.255.255.255"; 
//	
//	WshShell = Новый COMОбъект("WScript.Shell"); 
//	WshShell.Run(СтрокаЗапроса, 0, -1); 
//		
//КонецПроцедуры

//Процедура ДополнитьПолучателяКопииПочтойРуководителяСейла(СейлзМенеджер, ПолучателиКопий)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Пользователи.Ссылка КАК Ссылка
//		|ПОМЕСТИТЬ ПользовательСейлз
//		|ИЗ
//		|	Справочник.Пользователи КАК Пользователи
//		|ГДЕ
//		|	Пользователи.ФизическоеЛицо = &СейлзМенеджер
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	ВЫРАЗИТЬ(ФизическиеЛицаКонтактнаяИнформация.Представление КАК СТРОКА(150)) КАК Руководитель_Email
//		|ИЗ
//		|	Справочник.Подразделения.Сотрудники КАК ПодразделенияСотрудники
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПользовательСейлз КАК ПользовательСейлз
//		|		ПО ПодразделенияСотрудники.Пользователь = ПользовательСейлз.Ссылка
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Подразделения.Руководители КАК ПодразделенияРуководители
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
//		|			ПО ПодразделенияРуководители.Пользователь.ФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
//		|				И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизическогоЛица))
//		|		ПО ПодразделенияСотрудники.Ссылка = ПодразделенияРуководители.Ссылка
//		|ГДЕ
//		|	НЕ ПодразделенияРуководители.Пользователь.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
//		|	И НЕ ПодразделенияРуководители.Пользователь В
//		|				(ВЫБРАТЬ
//		|					ПользовательСейлз.Ссылка
//		|				ИЗ
//		|					ПользовательСейлз КАК ПользовательСейлз)";
//	
//	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица);
//	Запрос.УстановитьПараметр("СейлзМенеджер", СейлзМенеджер);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

//		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Руководитель_Email) 
//			И ПолучателиКопий.Найти(ВыборкаДетальныеЗаписи.Руководитель_Email) = Неопределено Тогда
//			ПолучателиКопий.Добавить(ВыборкаДетальныеЗаписи.Руководитель_Email);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//Функция ПолучитьСоединениесБазой(СтрокаБаза,СобытиеЖР) 
//	
//	УзелИнформационнойБазы = ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты(СтрокаБаза); // БО_ДУ
//	
//	Результат = ОбменДаннымиПовтИсп.ВнешнееСоединениеДляУзлаИнформационнойБазы(УзелИнформационнойБазы);
//	
//	Если Результат.Соединение = Неопределено Тогда
//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка,,, СтрокаБаза +". Не удалось подключится к базе|
//		|"+Результат.ПодробноеОписаниеОшибки);
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ВнешнееСоединение = Результат.Соединение;
//	
//	Возврат ВнешнееСоединение;
//	
//КонецФункции

Функция СинтезСтрокиПробел(сСтрока)
	
	сМассив =  СтрРазделить(сСтрока," "); 
	Возврат сМассив;
	
	//РазложитьНаСловаДоговор();
КонецФункции // СинтезКодДоговора()

Функция СинтезСтрокиЗапятая(сСтрока)
	
	сМассив =  СтрРазделить(сСтрока,","); 
	Возврат сМассив;
	
	//РазложитьНаСловаДоговор();
КонецФункции // СинтезКодДоговора()


Функция АдаптироватьТелефон(Тел, НекоррТелМассив)

	Тел = СтрЗаменить(Тел,"-",""); 
	Тел = СтрЗаменить(Тел,"(","");
	Тел = СтрЗаменить(Тел,")","");
	Тел = СтрЗаменить(Тел," ","");
	Если Лев(Тел,1)<>"+"  Тогда
		с_кол = СтрДлина(Тел);   
		Тел = Прав(Тел, с_кол-1);
		Тел = "+7" + Тел;
	КонецЕсли;
	//+79257711158 -  12 символов   
	с_кол = СтрДлина(Тел);
	Если с_кол>12  Тогда
		ПозТел = СтрНайти(Тел,"+"); 
		Тел = Сред(Тел,ПозТел,12);  
	ИначеЕсли  с_кол<12 Тогда  
		НеправильныйНомер = Истина;
		НекоррТелМассив.Добавить(Тел); 
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат Тел;
КонецФункции // АдаптироватьТелефон(эл.МобильныйТелефон)()


Функция АдаптироватьДату(мДата)

 кДата = xmlЗначение(Тип("Дата"),мДата);
 
 Возврат кДата;

КонецФункции // АдаптироватьДату()


Функция АдаптироватьЧисло(мЧисло)
	Если мЧисло =""  Тогда
		мЧисло = 0;
	Иначе 
		мЧисло = Число(СтрЗаменить(мЧисло,",",""));
	КонецЕсли;
		
	Возврат   мЧисло;
КонецФункции // АдаптироватьЧисло()


//Процедура СоздатьКлиентскийДокумент(СтруктураПараметров)
//	
//	ДокументОбъект = Документы.КлиентскийДокумент.СоздатьДокумент();
//	
//	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураПараметров);
//	
//	ДокументОбъект.Дата = ТекущаяДата();
//	ДокументОбъект.УстановитьНовыйНомер();
//	
//	ДокументОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
//	
//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);

//КонецПроцедуры

//Функция СохранитьИПодписать(ПолноеИмяФайлаMXL, ФормаОтправки, ДатаПодписи, ПерсональныйСертификат = Неопределено)
//	
//	Файл = Новый Файл(ПолноеИмяФайлаMXL);
//	
//	ПолноеИмяФайла = Файл.Путь + Файл.ИмяБезРасширения + ".pdf";
//	
//	Результат = Новый Структура;
//	Результат.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
//	Результат.Вставить("ПолноеИмяФайлаПодписи", Неопределено);
//	Результат.Вставить("ПерсональныйСертификат", Неопределено);
//	
//	Если НЕ ФормаОтправки = Перечисления.ФормыОтправкиОтчетовКлиентов.НаБумажномНосителе Тогда
//			
//		ПолноеИмяФайлаПодписи = ПолноеИмяФайла + ".sig";
//		
//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("ДатаПодписи", ДатаПодписи);
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ГрафикПодписантовСрезПоследних.ФизЛицо,
//			|	ГрафикПодписантовСрезПоследних.ФизЛицо.Сертификат КАК Сертификат,
//			|	ГрафикПодписантовСрезПоследних.ФизЛицо.Сертификат.Штамп КАК Штамп
//			|ИЗ
//			|	РегистрСведений.ГрафикПодписантов.СрезПоследних(&ДатаПодписи, ) КАК ГрафикПодписантовСрезПоследних";
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		Если НЕ РезультатЗапроса.Пустой() Тогда
//		
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			ВыборкаДетальныеЗаписи.Следующий();
//			
//			СертификатПодписи = ВыборкаДетальныеЗаписи.Сертификат;
//		    ДвоичныеДанные = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.Штамп);
//			
//			тчМакет = ПолучитьМакет("Штамп");
//			
//			ОбластьКартинка = тчМакет.ПолучитьОбласть("Картинка");
//			ОбластьКартинка.Область("КартинкаШтампа").Картинка = Новый Картинка(ДвоичныеДанные, Истина);
//			
//			Попытка
//				
//				ТабличныйДокумент = Новый ТабличныйДокумент;
//				ТабличныйДокумент.Прочитать(ПолноеИмяФайлаMXL);
//				
//				ТабличныйДокумент.Вывести(ОбластьКартинка);
//				
//				ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
//				
//				Если СертификатПодписи.ДействителенДо < ТекущаяДата() Тогда
//					ВызватьИсключение "Срок действия сертификата шифрования истек!";
//				КонецЕсли;
//				
//				МенеджерКриптографии = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider", "", 80);
//			    ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
//				
//				ПерсональныйСертификат = Неопределено;
//				
//				МассивСертификатов = ХранилищеСертификатов.ПолучитьВсе();
//				
//				Для Каждого Сертификат Из МассивСертификатов Цикл
//					
//					Если Base64Значение(СертификатПодписи.Отпечаток) = Сертификат.Отпечаток Тогда
//						ПерсональныйСертификат = Сертификат;
//						Прервать;
//					КонецЕсли;
//					
//				КонецЦикла;
//				
//				Если ПерсональныйСертификат = Неопределено Тогда
//					ВызватьИсключение "Не найден сертификат на сервере с отпечатком: " + Base64Значение(СертификатПодписи.Отпечаток);
//				КонецЕсли;
//				
//				МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = "";
//			    МенеджерКриптографии.Подписать(ПолноеИмяФайла, ПолноеИмяФайлаПодписи, ПерсональныйСертификат);
//				
//				Результат.ПолноеИмяФайлаПодписи = ПолноеИмяФайлаПодписи;
//				Результат.ПерсональныйСертификат = ПерсональныйСертификат;
//				
//			Исключение
//				
//				// отправим ошибку подписания файлов
//				ТекстПисьма = "Обнаружены ошибки при попытке подписания отчета клиента!
//				|
//				|Отчет клиента отправлен без подписи!
//				|
//				|Описание ошибки: " + ОписаниеОшибки();
//				
//				ПараметрыПисьма = Новый Структура;
//				ПараметрыПисьма.Вставить("Тема", "ИИС. Ошибка подписания отчета клиента");
//				ПараметрыПисьма.Вставить("Текст", ТекстПисьма);
//				ПараметрыПисьма.Вставить("УчетнаяЗапись", ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ИИС_УчетнаяЗаписьЭлектроннойПочты"));
//				ПараметрыПисьма.Вставить("ПолучателиПисьма", ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_Консолидация_ИИС_ОповещениеОбОшибкеПодписанияОтчетаКлиента_Получатели", Истина));
//				ПараметрыПисьма.Вставить("Важность", Перечисления.ВариантыВажностиВзаимодействия.Высокая);
//				
//				УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
//				
//			КонецПопытки;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(Результат.ПолноеИмяФайлаПодписи) Тогда
//		
//		// видимо неудалось подписать/либо не нужно подписывать документ - сохраняем и отправляем без штампа и подписи
//		ТабличныйДокумент = Новый ТабличныйДокумент;
//		ТабличныйДокумент.Прочитать(ПолноеИмяФайлаMXL);
//		
//		ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
//		
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции



//Функция ПерсональныйСертификатПоГрафикуПодписантов(ДатаПодписи)
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ДатаПодписи", ДатаПодписи);
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ГрафикПодписантовСрезПоследних.ФизЛицо,
//		|	ГрафикПодписантовСрезПоследних.ФизЛицо.Сертификат КАК Сертификат,
//		|	ГрафикПодписантовСрезПоследних.ФизЛицо.Сертификат.Штамп КАК Штамп
//		|ИЗ
//		|	РегистрСведений.ГрафикПодписантов.СрезПоследних(&ДатаПодписи, ) КАК ГрафикПодписантовСрезПоследних";
//	
//	РезультатЗапроса = Запрос.Выполнить();  
//	Если РезультатЗапроса.Пустой() Тогда
//		ВызватьИсключение "Не заполнен график подписантов";
//	КонецЕсли;
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	ВыборкаДетальныеЗаписи.Следующий();
//	
//	СертификатПодписи = ВыборкаДетальныеЗаписи.Сертификат;
//	
//	Если СертификатПодписи.ДействителенДо < ТекущаяДата() Тогда
//		ВызватьИсключение "Срок действия сертификата шифрования истек!";
//	КонецЕсли;
//	
//	МенеджерКриптографии = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider", "", 80);
//    ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
//	
//	ПерсональныйСертификат = Неопределено;
//	
//	МассивСертификатов = ХранилищеСертификатов.ПолучитьВсе();
//	
//	Для Каждого Сертификат Из МассивСертификатов Цикл
//		
//		Если Base64Значение(СертификатПодписи.Отпечаток) = Сертификат.Отпечаток Тогда
//			ПерсональныйСертификат = Сертификат;
//			Прервать;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Если ПерсональныйСертификат = Неопределено Тогда
//		ВызватьИсключение "Не найден сертификат на сервере с отпечатком: " + Base64Значение(СертификатПодписи.Отпечаток);
//	КонецЕсли;
//		
//	Возврат ПерсональныйСертификат;	
//	
//КонецФункции

//Функция ПерсональныйСертификат()
//	
//	//СертификатШифрования = ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ЭЦП_ОПИФ_ШифрованиеПодписьИОтправка_ПСБ_Ритейл_ПерсональныйСертификат");
//	ПодписантРеквизиты = ЗначенияПериодическихРеквизитовПовтИсп.Подписант(НачалоДня(ТекущаяДата()), "ПодписантДокументовДляПСБ");
//	СертификатШифрования = ПодписантРеквизиты.Сертификат;
//	
//	Если СертификатШифрования.ДействителенДо < ТекущаяДата() Тогда
//		ВызватьИсключение "Срок действия сертификата шифрования истек!";
//	КонецЕсли;
//	
//	МенеджерКриптографии = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider", "", 80);
//    ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
//	
//	ПерсональныйСертификат = Неопределено;
//	
//	МассивСертификатов = ХранилищеСертификатов.ПолучитьВсе();
//	
//	Для Каждого Сертификат Из МассивСертификатов Цикл
//		
//		Если Base64Значение(СертификатШифрования.Отпечаток) = Сертификат.Отпечаток Тогда
//			ПерсональныйСертификат = Сертификат;
//			Прервать;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Если ПерсональныйСертификат = Неопределено Тогда
//		ВызватьИсключение "Не найден сертификат на сервере с отпечатком: " + Base64Значение(СертификатШифрования.Отпечаток);
//	КонецЕсли;
//	
//	Возврат ПерсональныйСертификат;
//	
//КонецФункции

//Функция СертификатПолучателя()
//	
//	СертификатШифрования = ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ЭЦП_ОПИФ_ШифрованиеПодписьИОтправка_ПСБ_Ритейл_СертификатПолучателя");
//	
//	Если СертификатШифрования.ДействителенДо < ТекущаяДата() Тогда
//		ВызватьИсключение "Срок действия сертификата шифрования истек!";
//	КонецЕсли;
//	
//	МенеджерКриптографии = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider", "", 80);
//    ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.СертификатыПолучателей);
//	
//	СертификатПолучателя = Неопределено;
//	
//	МассивСертификатов = ХранилищеСертификатов.ПолучитьВсе();
//	
//	Для Каждого Сертификат Из МассивСертификатов Цикл
//		
//		Если Base64Значение(СертификатШифрования.Отпечаток) = Сертификат.Отпечаток Тогда
//			СертификатПолучателя = Сертификат;
//			Прервать;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Если СертификатПолучателя = Неопределено Тогда
//		ВызватьИсключение "Не найден сертификат получателя на сервере с отпечатком: " + Base64Значение(СертификатШифрования.Отпечаток);
//	КонецЕсли;
//	
//	Возврат СертификатПолучателя;
//	
//КонецФункции

//Процедура ШифрованиеИПодпись(Адрес, ИмяБезРасширения)
//	
//	ПолноеИмяФайла = КаталогВременныхФайлов() + ИмяБезРасширения + ".xml";
//	ПолноеИмяФайлаZIP = КаталогВременныхФайлов() + ИмяБезРасширения + ".zip";
//	ПолноеИмяФайлаENC = КаталогВременныхФайлов() + ИмяБезРасширения + ".zip.enc";
//	ПолноеИмяФайлаSIG = КаталогВременныхФайлов() + ИмяБезРасширения + ".zip.enc.sig";
//	ПолноеИмяФайлаФинальногоZIP = КаталогВременныхФайлов() + ИмяБезРасширения + "_enc_sig.zip";
//	
//	// 1. Закачиваем сходный файл на сервер
//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
//	ДвоичныеДанные.Записать(ПолноеИмяФайла);
//	
//	// 2. Архивируем файл в zip
//	ЗаписьZipФайла = Новый ЗаписьZipФайла(ПолноеИмяФайлаZIP,,,МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
//	ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
//	ЗаписьZipФайла.Записать();
//	
//	// 3. Шифруем для ЭЦП банка и своего ЭЦП
//	// 3.1 Открываем менеджер криптографии Crypto-Pro GOST R 34.10-2012
//    МенеджерКриптографии = Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider", "", 80);
//	
//	МассивДляШифрования = Новый Массив;
//	
//	// 3.2 Получаем сертификат для банка
//	СертификатПолучателя = СертификатПолучателя();
//    МассивДляШифрования.Добавить(СертификатПолучателя);
//	
//	// 3.3 Получаем свой сертификат
//	ПерсональныйСертификат = ПерсональныйСертификат();
//	МассивДляШифрования.Добавить(ПерсональныйСертификат);
//	
//	// 3.4 Получаем свой сертификат
//	МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = "";
//    МенеджерКриптографии.Зашифровать(ПолноеИмяФайлаZIP, ПолноеИмяФайлаENC, МассивДляШифрования);
//	
//	// 4. Подписываем зашифрованный файл
//	МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = "";
//    МенеджерКриптографии.Подписать(ПолноеИмяФайлаENC, ПолноеИмяФайлаSIG, ПерсональныйСертификат);
//	
//	// 2. Архивируем файл в zip
//	ЗаписьZipФайла = Новый ЗаписьZipФайла(ПолноеИмяФайлаФинальногоZIP,,,МетодСжатияZIP.Сжатие,УровеньСжатияZIP.Максимальный);
//	ЗаписьZipФайла.Добавить(ПолноеИмяФайлаENC);
//	ЗаписьZipФайла.Добавить(ПолноеИмяФайлаSIG);
//	ЗаписьZipФайла.Записать();
//	
//	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайлаФинальногоZIP);
//	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор());
//	
//	Файл = Новый Файл(ПолноеИмяФайлаФинальногоZIP);
//	ИмяБезРасширения = Файл.ИмяБезРасширения;
//	
//КонецПроцедуры

Функция СтрокаИзОбъектаXDTO(ОбъектXDTO)
	
	Результат = "";
	
	Если ТипЗнч(ОбъектXDTO) = Тип("Строка") Тогда
		
		Результат = ОбъектXDTO;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьОбъектXDTO(ВнешняяФабрикаXDTO, ИмяТипа)
	
	ТипОбъектаXDTO = ВнешняяФабрикаXDTO.Тип("http://psbam_exchange/agent_exchange", ИмяТипа);
	
	ОбъектXDTO = ВнешняяФабрикаXDTO.Создать(ТипОбъектаXDTO);
	
	Возврат ОбъектXDTO;
	
КонецФункции

//Функция ЗначениеУзла(ЭлементDOM, ИмяЭлемента, ТипЗначения = "Строка")
//	
//	СписокЭлементов = ЭлементDOM.ПолучитьЭлементыПоИмени(ИмяЭлемента);
//	Если СписокЭлементов.Количество() = 0 Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	Значение = СокрЛП(СписокЭлементов[0].ТекстовоеСодержимое);
//	
//	Если ТипЗначения = "Число" ИЛИ Найти(Врег(ИмяЭлемента),"_ID") ИЛИ Врег(ИмяЭлемента)="ID" Тогда
//		Значение = Число(Значение);    
//	ИначеЕсли ТипЗначения = "Дата" ИЛИ Найти(Врег(ИмяЭлемента),"DATE") Тогда
//		Значение = XMLЗначение(Тип("Дата"), Значение);
//	КонецЕсли;
//		
//	Возврат Значение;
//	
//КонецФункции


//Функция УстановитьСоединениеSQL(СобытиеЖР, ИмяСервераSQL, ИмяБазыSQL)
//	
//	ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"Проверка доступности SQL-сервера");

//	СтрокаПодключения = "Driver={SQL Server};Server="+ИмяСервераSQL+";Trusted_Connection=Yes;Database="+ИмяБазыSQL+";LANGUAGE=русский";

//	Попытка
//		
//		SQL = Новый COMОбъект("ADODB.Connection");
//		SQL.Open(СтрокаПодключения);
//		SQL.CommandTimeout = 60000;
//		
//	Исключение
//		
//		ЗаписьЖР(СобытиеЖР, "Неудалось подключиться к базе MS SQL. Описание ошибки: " + ОписаниеОшибки(),, Истина);
//		Возврат Неопределено;
//		
//	КонецПопытки;  
//	
//	Возврат SQL;
//	
//КонецФункции

//Функция БазаДУ_Подготовлена(СобытиеЖР, ПроверятьДУ_ИИС = Ложь, ПроверятьЗакрытиеДня = Ложь, ПроверятьЗагрузкуРегистров = Истина) 
//	
//	УзелИнформационнойБазы = ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Узел_БО_ДУ"); // БО_ДУ
//	
//	Если ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
//		ПредыдущийРабочийДень = НачалоДня(Период.ДатаОкончания);
//	Иначе
//		ПредыдущийРабочийДень = ПредыдущийРабочийДень();
//	КонецЕсли;
//	
//	Результат = ОбменДаннымиПовтИсп.ВнешнееСоединениеДляУзлаИнформационнойБазы(УзелИнформационнойБазы);
//	
//	Если Результат.Соединение = Неопределено Тогда
//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка,,,"ДУ. Не удалось подключится к базе|
//		|"+Результат.ПодробноеОписаниеОшибки);
//		Возврат Ложь;
//	КонецЕсли;

//	ВнешнееСоединение = Результат.Соединение;

//	ДатаГотовностиБаза = ВнешнееСоединение.Константы.ДатаГотовностиБаза.Получить();

//	Если ДатаГотовностиБаза < ПредыдущийРабочийДень Тогда
//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. Дата готовности базы не соответствует требуемой: " + ДатаГотовностиБаза);
//		Возврат Ложь;
//	КонецЕсли;   
//	
//	Запрос = ВнешнееСоединение.NewObject("Запрос");
//	Запрос.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 1
//		|	ОчередьСЧА.Период
//		|ИЗ
//		|	РегистрСведений.ОчередьСЧА КАК ОчередьСЧА";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда
//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. Очередь СЧА не разобрана полностью!");
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ПроверятьДУ_ИИС Тогда
//	
//		ДатаГотовностиБазаДУИИС = ВнешнееСоединение.Константы.ДатаГотовностиБазаДУИИС.Получить();

//		Если ДатаГотовностиБазаДУИИС < ПредыдущийРабочийДень Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. Дата готовности базы (ИИС) не соответствует требуемой: " + ДатаГотовностиБазаДУИИС);
//			Возврат Ложь;
//		КонецЕсли;
//		
//		// проверим на то, что доходность вся расчитана
//		Запрос = ВнешнееСоединение.NewObject("Запрос");
//		Запрос.Текст = 
//			"ВЫБРАТЬ ПЕРВЫЕ 1
//			|	ДопроведениеДокументов.Период
//			|ИЗ
//			|	РегистрСведений.ДопроведениеДокументов КАК ДопроведениеДокументов
//			|ГДЕ
//			|	ДопроведениеДокументов.РазделУчета = ЗНАЧЕНИЕ(Перечисление.ДопроведениеДокументовРазделыУчета.ДоходностьДоговоров)
//			|	И ДопроведениеДокументов.ДатаОкончанияПроведения = ДАТАВРЕМЯ(1, 1, 1)";
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		Если НЕ РезультатЗапроса.Пустой() Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. Доходность не расчитана полностью!");
//			Возврат Ложь;
//		КонецЕсли;
//		
//	КонецЕсли;   
//	
//	Если ПроверятьЗагрузкуРегистров Тогда
//			
//		Результат = ОпределениеКоличествоЗаписей(УзелИнформационнойБазы, ВнешнееСоединение, "ПараметрыСЧА", ПредыдущийРабочийДень);

//		Если НЕ Результат.КоличествоЗаписей_КОМ = Результат.КоличествоЗаписей_Консолидация Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. ПараметрыСЧА. Не все записи загружены в Консолидацию");
//			Возврат Ложь;
//		КонецЕсли;
//		
//		Результат = ОпределениеКоличествоЗаписей(УзелИнформационнойБазы, ВнешнееСоединение, "РыночнаяСтоимостьЦенныхБумаг", ПредыдущийРабочийДень);

//		Если НЕ Результат.КоличествоЗаписей_КОМ = Результат.КоличествоЗаписей_Консолидация Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. РыночнаяСтоимостьЦенныхБумаг. Не все записи загружены в Консолидацию");
//			Возврат Ложь;
//		КонецЕсли;
//		
//		Результат = ОпределениеСумм(УзелИнформационнойБазы, ВнешнееСоединение, "ПараметрыСЧА", "СЧА", ПредыдущийРабочийДень);

//		Если НЕ Результат.Сумма_КОМ = Результат.Сумма_Консолидация Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. ПараметрыСЧА. Не все записи по суммам загружены в Консолидацию");
//			Возврат Ложь;
//		КонецЕсли;
//		
//		Результат = ОпределениеСумм(УзелИнформационнойБазы, ВнешнееСоединение, "РыночнаяСтоимостьЦенныхБумаг", "Стоимость", ПредыдущийРабочийДень);

//		Если НЕ Результат.Сумма_КОМ = Результат.Сумма_Консолидация Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. РыночнаяСтоимостьЦенныхБумаг. Не все записи по суммам загружены в Консолидацию");
//			Возврат Ложь;
//		КонецЕсли;  
//		
//	КонецЕсли;
//	
//	//Если ПроверятьДУ_ИИС Тогда
//	//
//	//	Результат = ОпределениеДоходностьДоговоров(УзелИнформационнойБазы, ВнешнееСоединение, "ДоходностьДоговоровДУ", "Доход", ПредыдущийРабочийДень);

//	//	Если НЕ Результат.Сумма_КОМ = Результат.Сумма_Консолидация Тогда
//	//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. ДоходностьДоговоров. Не все записи по суммам загружены в Консолидацию");
//	//		Возврат Ложь;
//	//	КонецЕсли;
//	//	
//	//КонецЕсли;

//	Если ПроверятьЗакрытиеДня Тогда
//			
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ЗакрытиеДня.Ссылка КАК Ссылка
//			|ИЗ
//			|	Документ.ЗакрытиеДня КАК ЗакрытиеДня
//			|ГДЕ
//			|	НАЧАЛОПЕРИОДА(ЗакрытиеДня.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
//			|	И ЗакрытиеДня.ИнформационнаяБаза = &ИнформационнаяБаза
//			|	И ЗакрытиеДня.Проведен";
//		
//		Запрос.УстановитьПараметр("Дата", ПредыдущийРабочийДень);
//		Запрос.УстановитьПараметр("ИнформационнаяБаза", Справочники.ИнформационныеБазы.БэкОфисРоссия);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		Если РезультатЗапроса.Пустой() Тогда
//			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Информация,,,"ДУ. Не создан документ ""Закрытие дня""");
//			Возврат Ложь;
//		КонецЕсли;
//		
//	КонецЕсли;

//	Возврат Истина;
//	
//КонецФункции

//Функция ОпределениеКоличествоЗаписей(Узел, ВнешнееСоединение, ИмяТаблицы, Период)
//	
//	Результат = Новый Структура;
//	Результат.Вставить("КоличествоЗаписей_КОМ", 0);
//	Результат.Вставить("КоличествоЗаписей_Консолидация", 0);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА(1) КАК КоличествоЗаписей
//		|ИЗ
//		|	РегистрСведений." + ИмяТаблицы + " КАК РыночнаяСтоимостьЦенныхБумаг
//		|ГДЕ
//		|	РыночнаяСтоимостьЦенныхБумаг.Период = &Период
//		|	И РыночнаяСтоимостьЦенныхБумаг.ИнформационнаяБаза = &ИнформационнаяБаза";
//	
//	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
//	Запрос.УстановитьПараметр("ИнформационнаяБаза", Узел.ИнформационнаяБаза);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Результат.КоличествоЗаписей_Консолидация = ?(НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КоличествоЗаписей), 0, ВыборкаДетальныеЗаписи.КоличествоЗаписей);
//	КонецЕсли;
//	
//	Запрос = ВнешнееСоединение.NewObject("Запрос");
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА(1) КАК КоличествоЗаписей
//		|ИЗ
//		|	РегистрСведений." + ИмяТаблицы + " КАК РыночнаяСтоимостьЦенныхБумаг
//		|ГДЕ
//		|	РыночнаяСтоимостьЦенныхБумаг.Период = &Период";
//	
//	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Результат.КоличествоЗаписей_КОМ = ?(НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КоличествоЗаписей), 0, ВыборкаДетальныеЗаписи.КоличествоЗаписей);
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

//Функция ОпределениеСумм(Узел, ВнешнееСоединение, ИмяТаблицы, ИмяПоляСумма, Период)
//	
//	Результат = Новый Структура;
//	Результат.Вставить("Сумма_КОМ", 0);
//	Результат.Вставить("Сумма_Консолидация", 0);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА("+ИмяПоляСумма+") КАК Сумма
//		|ИЗ
//		|	РегистрСведений." + ИмяТаблицы + " КАК РыночнаяСтоимостьЦенныхБумаг
//		|ГДЕ
//		|	РыночнаяСтоимостьЦенныхБумаг.Период = &Период
//		|	И РыночнаяСтоимостьЦенныхБумаг.ИнформационнаяБаза = &ИнформационнаяБаза";
//	
//	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
//	Запрос.УстановитьПараметр("ИнформационнаяБаза", Узел.ИнформационнаяБаза);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Результат.Сумма_Консолидация = ?(НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма), 0, ВыборкаДетальныеЗаписи.Сумма);
//	КонецЕсли;
//	
//	Запрос = ВнешнееСоединение.NewObject("Запрос");
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА("+ИмяПоляСумма+") КАК Сумма
//		|ИЗ
//		|	РегистрСведений." + ИмяТаблицы + " КАК РыночнаяСтоимостьЦенныхБумаг
//		|ГДЕ
//		|	РыночнаяСтоимостьЦенныхБумаг.Период = &Период";
//	
//	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Результат.Сумма_КОМ = ?(НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма), 0, ВыборкаДетальныеЗаписи.Сумма);
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

//Функция ОпределениеДоходностьДоговоров(Узел, ВнешнееСоединение, ИмяТаблицы, ИмяПоляСумма, Период)
//	
//	Результат = Новый Структура;
//	Результат.Вставить("Сумма_КОМ", 0);
//	Результат.Вставить("Сумма_Консолидация", 0);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА("+ИмяПоляСумма+") КАК Сумма
//		|ИЗ
//		|	РегистрСведений." + ИмяТаблицы + " КАК РыночнаяСтоимостьЦенныхБумаг
//		|ГДЕ
//		|	РыночнаяСтоимостьЦенныхБумаг.Период = &Период";
//	
//	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
//	Запрос.УстановитьПараметр("ИнформационнаяБаза", Узел.ИнформационнаяБаза);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Результат.Сумма_Консолидация = ?(НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма), 0, ВыборкаДетальныеЗаписи.Сумма);
//	КонецЕсли;
//	
//	Запрос = ВнешнееСоединение.NewObject("Запрос");
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА("+ИмяПоляСумма+") КАК Сумма
//		|ИЗ
//		|	РегистрСведений." + ИмяТаблицы + " КАК РыночнаяСтоимостьЦенныхБумаг
//		|ГДЕ
//		|	РыночнаяСтоимостьЦенныхБумаг.Период = &Период";
//	
//	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Результат.Сумма_КОМ = ?(НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма), 0, ВыборкаДетальныеЗаписи.Сумма);
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

//Процедура ЗаписьЖР(СобытиеЖР, Комментарий, ЖурналОбработки = Неопределено, ЕстьОшибки = Ложь, ОписаниеОшибки = Неопределено, ИзменитьНаУровень = Неопределено)
//	
//	УровеньЖР = УровеньЖурналаРегистрации.Информация;
//	
//	Если ЕстьОшибки Тогда
//		
//		УровеньЖР = УровеньЖурналаРегистрации.Ошибка;
//		
//		Если НЕ ОписаниеОшибки = Неопределено Тогда
//			
//			ОписаниеОшибки = ОписаниеОшибки + Комментарий + Символы.ПС;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если НЕ ИзменитьНаУровень = Неопределено Тогда
//		УровеньЖР = ИзменитьНаУровень;
//	КонецЕсли;
//	
//	ЗаписьЖурналаРегистрации(СобытиеЖР,УровеньЖР,,,Комментарий);
//	
//	Если Не ЖурналОбработки = Неопределено Тогда
//		
//		ЖурналОбработки = ЖурналОбработки + ТекущаяДатаСеанса() + ": " + Комментарий + Символы.ПС + Символы.ПС;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

Функция ДобавитьПрисоединенныйФайл(ВладелецФайлов, 
									ИмяБезРасширения, 
									РасширениеБезТочки, 
									ПолноеИмяФайла_ДвоичныеДанные, 
									ВыгружатьВЛК = Неопределено,
									ВидФайла = Неопределено)
	
	Если ТипЗнч(ПолноеИмяФайла_ДвоичныеДанные) = Тип("Строка") Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла_ДвоичныеДанные);
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор());
		
	Иначе
		
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПолноеИмяФайла_ДвоичныеДанные, Новый УникальныйИдентификатор());
		
	КонецЕсли;
	
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("ВладелецФайлов",              ВладелецФайлов);
	ПараметрыФайла.Вставить("Автор",                       Неопределено);
	ПараметрыФайла.Вставить("ИмяБезРасширения",            ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки",          РасширениеБезТочки);
	ПараметрыФайла.Вставить("ВремяИзменения",              Неопределено);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
	
	Если НЕ ВыгружатьВЛК = Неопределено 
		ИЛИ НЕ ВидФайла = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		
		Если НЕ ВыгружатьВЛК = Неопределено Тогда
			ДопПараметры.Вставить("ВыгружатьВЛК", ВыгружатьВЛК);
		КонецЕсли;
		
		Если НЕ ВидФайла = Неопределено Тогда
			ДопПараметры.Вставить("ВидФайла", ВидФайла);
		КонецЕсли;
		
		ПараметрыФайла.Вставить("ДопПараметры", ДопПараметры);
		
	КонецЕсли;
	
	//Возврат ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(ПараметрыФайла, АдресВоВременномХранилище, "");
	
КонецФункции

//Функция ЕстьДоступККаталогу(ИмяКаталога)
//	
//	Файл = Новый Файл(ИмяКаталога);
//	
//	Если НЕ Файл.Существует() ИЛИ НЕ Файл.ЭтоКаталог() Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Возврат Истина;
//	
//КонецФункции

//Функция УИД(Строка)
//	
//	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
//	ХешированиеДанных.Добавить(Строка);
//	
//	ХешСумма = СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ","");
//	
//	УИДСтрока = Лев(ХешСумма, 8) + "-" + Сред(ХешСумма, 9, 4) + "-" + Сред(ХешСумма, 13, 4) + "-" + Сред(ХешСумма, 17, 4) + "-" + Прав(ХешСумма, 12);
//	
//	УИД = Новый УникальныйИдентификатор(УИДСтрока);
//	
//	Возврат УИД;
//	
//КонецФункции

//Функция РабочийДеньСоСдвигом(ДатаОт, Сдвиг)
//	
//	ДатаОкончания = НачалоДня(ДатаОт);
//	
//	Разность = 0;
//	Счетчик = 0;
//	
//	Пока Разность<Сдвиг Цикл
//	
//		РабочийДеньСоСдвигом = ДатаОкончания - Счетчик * 24 * 3600;
//		
//		Разность = КалендарныеГрафики.РазностьДатПоКалендарю(КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации(), РабочийДеньСоСдвигом, ДатаОкончания);
//		
//		Счетчик = Счетчик + 1;
//		
//	КонецЦикла;
//	
//	Возврат РабочийДеньСоСдвигом;
//	
//КонецФункции

//Функция РабочийДеньСоСдвигомВперед(ДатаОт, КоличествоДней)
//	
//	НачальныеДаты = Новый Массив;
//	НачальныеДаты.Добавить(НачалоДня(ДатаОт));
//	
//	ДатыБлижайшихРабочихДней = КалендарныеГрафики.ДатыБлижайшихРабочихДней(КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации(), НачальныеДаты, Истина);
//	
//	ПредыдущийРабочийДень = ДатыБлижайшихРабочихДней.Получить(НачалоДня(ДатаОт));
//	
//	РабочийДень = КалендарныеГрафики.ДатаПоКалендарю(КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации(), ПредыдущийРабочийДень, КоличествоДней);
//	
//	Возврат РабочийДень;
//	
//КонецФункции

//Функция ПредыдущийРабочийДень(ДатаОт = Неопределено)
//	
//	Если ДатаОт = Неопределено Тогда
//		ДатаПоискаПредыдущегоРабочегоДня = НачалоДня(НачалоДня(ТекущаяДата()) - 1);
//	Иначе
//		ДатаПоискаПредыдущегоРабочегоДня = НачалоДня(НачалоДня(ДатаОт) - 1);
//	КонецЕсли;
//	
//	НачальныеДаты = Новый Массив;
//	НачальныеДаты.Добавить(ДатаПоискаПредыдущегоРабочегоДня);
//	
//	ДатыБлижайшихРабочихДней = КалендарныеГрафики.ДатыБлижайшихРабочихДней(КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации(), НачальныеДаты, Истина);
//	
//	ПредыдущийРабочийДень = ДатыБлижайшихРабочихДней.Получить(ДатаПоискаПредыдущегоРабочегоДня);
//	
//	Возврат ПредыдущийРабочийДень;
//	
//КонецФункции

Функция СегодняВыходной()
	
	ДатаОпределения = НачалоДня(ТекущаяДата());
	
	НачальныеДаты = Новый Массив;
	НачальныеДаты.Добавить(ДатаОпределения);
	ПР_К = Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ");
	
	ДатыБлижайшихРабочихДней = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПР_К, НачальныеДаты, Истина);
	
	ПредыдущийРабочийДень = ДатыБлижайшихРабочихДней.Получить(ДатаОпределения);
	
	Возврат НЕ ПредыдущийРабочийДень = ДатаОпределения;
	
КонецФункции

Функция РегламентноеЗаданиеВыполнялосьСегодня(ИмяРегламентногоЗадания)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыполнениеРегламентныхЗаданийСрезПоследних.ДатаЗавершения
		|ИЗ
		|	РегистрСведений.ВыполнениеРегламентныхЗаданий.СрезПоследних(, РегламентноеЗадание = &ИмяРегламентногоЗадания) КАК ВыполнениеРегламентныхЗаданийСрезПоследних";
	
	Запрос.УстановитьПараметр("ИмяРегламентногоЗадания", ИмяРегламентногоЗадания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ТипЗнч(Выборка.ДатаЗавершения) = Тип("Дата") Тогда
		
		Результат = НачалоДня(Выборка.ДатаЗавершения) = НачалоДня(ТекущаяДата());
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

//Процедура ЗаписатьЗавершениеЗаданияВРегистр(ИмяРегламентногоЗадания, УдалитьПредыдущие = Истина)
//	
//	Если НеРегистрироватьВыполнениеЗаданияВРегистрВыполненных Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если УдалитьПредыдущие Тогда
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ВыполнениеРегламентныхЗаданий.Период,
//			|	ВыполнениеРегламентныхЗаданий.РегламентноеЗадание
//			|ИЗ
//			|	РегистрСведений.ВыполнениеРегламентныхЗаданий КАК ВыполнениеРегламентныхЗаданий
//			|ГДЕ
//			|	ВыполнениеРегламентныхЗаданий.РегламентноеЗадание = &РегламентноеЗадание";
//		
//		Запрос.УстановитьПараметр("РегламентноеЗадание", ИмяРегламентногоЗадания);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//		
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			
//			НаборЗаписей = РегистрыСведений.ВыполнениеРегламентныхЗаданий.СоздатьНаборЗаписей();
//			НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
//			НаборЗаписей.Отбор.РегламентноеЗадание.Установить(ВыборкаДетальныеЗаписи.РегламентноеЗадание);
//			НаборЗаписей.Записать(Истина);
//			
//		КонецЦикла;
//	
//	КонецЕсли;
//	
//	мз = РегистрыСведений.ВыполнениеРегламентныхЗаданий.СоздатьМенеджерЗаписи();
//	мз.Период = ТекущаяДата();
//	мз.РегламентноеЗадание = ИмяРегламентногоЗадания;
//	мз.ДатаЗавершения = ТекущаяДата();
//	
//	мз.Записать(Истина);
//	
//КонецПроцедуры

//Функция ДатаГотовностиБазы(СобытиеЖР, ИмяБазы, ВнешнееСоединение = Неопределено)
//	
//	Если ВнешнееСоединение = Неопределено Тогда
//		
//		УзелИнформационнойБазы = ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты(ИмяБазы); 
//		
//		Результат = ОбменДаннымиПовтИсп.ВнешнееСоединениеДляУзлаИнформационнойБазы(УзелИнформационнойБазы);
//		
//		Если Результат.Соединение = Неопределено Тогда
//			ЗаписьЖР(СобытиеЖР, "ОПИФ. Не удалось подключится к базе|
//			|"+Результат.ПодробноеОписаниеОшибки);
//			Возврат Неопределено;
//		КонецЕсли;

//		ВнешнееСоединение = Результат.Соединение;
//		
//	КонецЕсли;
//	
//	ДатаГотовностиБаза = Неопределено;
//	
//	Если ИмяБазы = "Узел_ОПИФ" Тогда
//		
//		// база готова тогда - когда по всем фондам рассчитан СЧА (т.е. период СЧА по всем фондам должен быть равен)
//		// определим самую раннюю дату расчета СЧА по всем фондам - она и будет являться датой готовности
//		Запрос = ВнешнееСоединение.NewObject("Запрос");
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ПИФ.Ссылка КАК Ссылка
//			|ПОМЕСТИТЬ ПИФыДействующие
//			|ИЗ
//			|	Справочник.ПИФ КАК ПИФ
//			|ГДЕ
//			|	ПИФ.Родитель = ЗНАЧЕНИЕ(Справочник.ПИФ.ПустаяСсылка)
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ ПЕРВЫЕ 1
//			|	ПараметрыСЧАСрезПоследних.Период КАК Период
//			|ИЗ
//			|	РегистрСведений.ПараметрыСЧА.СрезПоследних(
//			|			,
//			|			ПИФ В
//			|				(ВЫБРАТЬ
//			|					ПИФыДействующие.Ссылка КАК Ссылка
//			|				ИЗ
//			|					ПИФыДействующие КАК ПИФыДействующие)) КАК ПараметрыСЧАСрезПоследних
//			|
//			|УПОРЯДОЧИТЬ ПО
//			|	Период";
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда
//			ДатаГотовностиБаза = Выборка.Период;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Возврат ДатаГотовностиБаза;
//	
//КонецФункции

//Функция Квартал(Дата) Экспорт 
//	
//	
//    Возврат Цел((Месяц(Дата) - 1) / 3) + 1
//КонецФункции

//Функция тДоговорОт(ДоговорСсылка)
//	
//	Возврат СокрЛП(ДоговорСсылка.НомерДоговора) + " от " + Формат(ДоговорСсылка.ДатаДоговора, "ДФ=dd.MM.yyyy");
//	
//КонецФункции

//Процедура ТаймАут(Секунд)
//	
//    WshShell = Новый COMОбъект("WScript.Shell");
//	
//    oExec=WshShell.Run("cmd.exe /c ping -n " + Секунд + " 127.0.0.1 > NUL", 0, 1);
//	
//КонецПроцедуры

//Функция ВыполнитьЗапросSQL(СобытиеЖР, SQL, ТекстЗапроса)
//	
//	Команда = Новый COMОбъект("ADODB.Command");
//	Выборка = Новый COMОбъект("ADODB.RecordSet");
//	
//	Команда.ActiveConnection = SQL;
//	Команда.CommandType  = 1;
//	Команда.CommandTimeout = 6000;
//	
//	Команда.CommandText = ТекстЗапроса; 

//	ЗаписьЖурналаРегистрации(СобытиеЖР,,,,"Выполняется запрос: " + Символы.ПС + Лев(ТекстЗапроса, 500));

//	Попытка
//		
//		Возврат Команда.Execute();
//		
//	Исключение
//		
//		ОписаниеОшибки = "Описание ошибки: " + ОписаниеОшибки();
//		
//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка,,,"Ошибки выполнения SQL Запроса: " + Лев(ТекстЗапроса, 500));
//		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
//		
//		ВызватьИсключение ОписаниеОшибки;
//		
//	КонецПопытки;
//	
//КонецФункции

//// Возвращает признак успешного выполнения обмена данными
////
//Функция РезультатВыполненияОбменаВыполнено(РезультатВыполненияОбмена)
//	
//	Возврат РезультатВыполненияОбмена = Неопределено
//		ИЛИ РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено
//		ИЛИ РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями;
//	
//КонецФункции

//// Регистрирует что обмен был произведен и фиксирует информацию в протоколе
////
//// Параметры:
////  СтруктураНастроекОбмена - Структура - структура со всеми необходимыми данными и объектами для выполнения обмена
//// 
//Процедура ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена)
//	
//	// статус "Неопределено" в конце обмена свидетельствует об успешном выполнении обмена
//	Если СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено Тогда
//		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено;
//	КонецЕсли;
//	
//	// формируем итоговое сообщение для протокола
//	СтрокаСообщения = НСтр("ru = '%1, %2; Обработано %3 объектов'");
//	СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
//						СтруктураНастроекОбмена.РезультатВыполненияОбмена,
//						СтруктураНастроекОбмена.ДействиеПриОбмене,
//						СтруктураНастроекОбмена.КоличествоОбъектовОбработано);
//	//
//	ОбменДаннымиСервер.ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
//	
//	СтруктураНастроекОбмена.ДатаОкончания = ТекущаяДатаСеанса();
//	
//	// фиксируем состояние обмена в РС
//	ЗафиксироватьЗавершениеОбменаВРегистреСведений(СтруктураНастроекОбмена);
//	
//	// если обмен данными был успешно выполнен
//	Если РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
//		
//		ЗафиксироватьУспешныйОбменДаннымиВРегистреСведений(СтруктураНастроекОбмена);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//// Фиксирует состояние обмена данными в регистре сведений СостояниеОбменовДанными
////
//// Параметры:
////  СтруктураНастроекОбмена - Структура - структура со всеми необходимыми данными и объектами для выполнения обмена
//// 
//Процедура ЗафиксироватьЗавершениеОбменаВРегистреСведений(СтруктураНастроекОбмена)
//	
//	// создаем структуру для новой записи в РС
//	СтруктураЗаписи = Новый Структура;
//	СтруктураЗаписи.Вставить("УзелИнформационнойБазы",    СтруктураНастроекОбмена.УзелИнформационнойБазы);
//	СтруктураЗаписи.Вставить("ДействиеПриОбмене",         СтруктураНастроекОбмена.ДействиеПриОбмене);
//	
//	СтруктураЗаписи.Вставить("РезультатВыполненияОбмена", СтруктураНастроекОбмена.РезультатВыполненияОбмена);
//	СтруктураЗаписи.Вставить("ДатаНачала",                СтруктураНастроекОбмена.ДатаНачала);
//	СтруктураЗаписи.Вставить("ДатаОкончания",             СтруктураНастроекОбмена.ДатаОкончания);
//	
//	// добавляем запись в РС
//	РегистрыСведений.СостоянияОбменовДанными.ДобавитьЗапись(СтруктураЗаписи);
//	
//КонецПроцедуры

//Процедура ЗафиксироватьУспешныйОбменДаннымиВРегистреСведений(СтруктураНастроекОбмена)
//	
//	// создаем структуру для новой записи в РС
//	СтруктураЗаписи = Новый Структура;
//	СтруктураЗаписи.Вставить("УзелИнформационнойБазы", СтруктураНастроекОбмена.УзелИнформационнойБазы);
//	СтруктураЗаписи.Вставить("ДействиеПриОбмене",      СтруктураНастроекОбмена.ДействиеПриОбмене);
//	СтруктураЗаписи.Вставить("ДатаОкончания",          СтруктураНастроекОбмена.ДатаОкончания);
//	
//	// добавляем запись в РС
//	РегистрыСведений.СостоянияУспешныхОбменовДанными.ДобавитьЗапись(СтруктураЗаписи);
//	
//КонецПроцедуры

//Процедура УдалитьФайлыВПопытке(ПолныйПуть)
//	
//	Попытка
//		УдалитьФайлы(ПолныйПуть);
//	Исключение
//	КонецПопытки;
//	
//КонецПроцедуры

//Процедура ЗаписатьЭлемент(ЗаписьXML, ИмяЭлемента, ЗначениеЭлемента)
//	
//	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
//	
//	//ЗаписатьXML(ЗаписьXML, ЗначениеЭлемента);
//	ЗаписьXML.ЗаписатьТекст(ЗначениеЭлемента);
//	ЗаписьXML.ЗаписатьКонецЭлемента(); //ИмяЭлемента
//	
//КонецПроцедуры

//Функция СтрПолучитьСтрокуМеждуРазделителями(Знач СтрокаИсходная, СтрокаНачала, СтрокаОкончания, ВыполнитьСокрЛП = Истина)
//	
//	Позиция = Найти(СтрокаИсходная, СтрокаНачала);
//	
//	Если Позиция = 0 Тогда
//		Возврат Неопределено;
//	КонецЕсли;             
//	
//	СтрокаИсходная = Сред(СтрокаИсходная, Позиция + СтрДлина(СтрокаНачала));
//	
//	Позиция = Найти(СтрокаИсходная, СтрокаОкончания);
//	
//	Если Позиция = 0 Тогда
//		Возврат Неопределено;
//	КонецЕсли;   
//	
//	СтрокаРезультат = Лев(СтрокаИсходная, Позиция - 1);
//	
//	Если ВыполнитьСокрЛП Тогда
//		СтрокаРезультат = СокрЛП(СтрокаРезультат);
//	КонецЕсли;
//	
//	Возврат СтрокаРезультат;
//	
//КонецФункции
//    

Процедура ЗаполнитьНовыхСотрудников(Организация) Экспорт
	
	СобытиеЖР = "ХД.ЗаполнитьНовыхСотрудников";
	
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	
	ЗаполнитьНовыхСотрудниковВыполнить(СобытиеЖР, Организация);
	
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	
КонецПроцедуры

Процедура ЗаполнитьНовыхСотрудниковВыполнить(СобытиеЖР, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ФильтрОрганизация",   ЗначениеЗаполнено(Организация));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Наименование КАК СотрудникСтрока,
	|	ЕСТЬNULL(Сотрудники.ФизическоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРождения,
	|	ЕСТЬNULL(МИНИМУМ(ТКД.ДатаПриема), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыхода,
	|	Истина Как СозданОбработкойНачальногоЗаполнения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		Левое СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТКД
	|		ПО Сотрудники.Ссылка = ТКД.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ZUPC_НовыеCотрудники КАК НовыеCотрудники
	|		ПО Сотрудники.Ссылка = НовыеCотрудники.Сотрудник
	|			ИЛИ Сотрудники.Наименование = НовыеCотрудники.СотрудникСтрока
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И ЕстьNULL(ТКД.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Сотрудники.ГоловнаяОрганизация = &Организация
	|	И НовыеCотрудники.СотрудникСтрока ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Ссылка,
	|	Сотрудники.Наименование,
	|	Сотрудники.ФизическоеЛицо.ДатаРождения
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникСтрока";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ЗаписьЖР(СобытиеЖР, "Новых записей не найдено");
		ОбщегоНазначения.СообщитьПользователю("Новых записей не найдено.");
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	КоличествоДобавлено = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.СотрудникСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		МЗ = РегистрыСведений.ZUPC_НовыеCотрудники.СоздатьМенеджерЗаписи();  
		ЗаполнитьЗначенияСвойств(МЗ, Выборка, "СотрудникСтрока,Сотрудник,ДатаВыхода,ДатаРождения,СозданОбработкойНачальногоЗаполнения");
		//МЗ.СотрудникСтрока                        = Выборка.СотрудникСтрока;
		//МЗ.Сотрудник                              = Выборка.Сотрудник;
		//МЗ.ДатаВыхода                             = Выборка.ДатаВыхода;
		//МЗ.ДатаРождения                           = Выборка.ДатаРождения;
		//МЗ.СозданОбработкойНачальногоЗаполнения   = Истина;
		МЗ.Записать(Истина);
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Заполнить Новых Сотрудников: добавлено записей — " + КоличествоДобавлено);
	ЗаписьЖР(СобытиеЖР, "Добавлено записей: " + КоличествоДобавлено);
	
КонецПроцедуры

//ОбновитьМестаИОфисы
Процедура ОбновитьМестаИОфисы()
	СобытиеЖР = "ХД.ОбновитьМестаИОфисы";
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Регистр.СотрудникСтрока КАК СотрудникСтрока,
	|	Регистр.Сотрудник КАК Сотрудник,
	|	Регистр.НомерМеста КАК СтарыйНомерМеста,
	|	Регистр.Офис КАК СтарыйОфис,
	|	Справочник.НомерМеста КАК НовыйНомерМеста,
	|	Справочник.Офис КАК НовыйОфис
	|ИЗ
	|	РегистрСведений.ZUPC_НовыеCотрудники КАК Регистр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Справочник
	|		ПО Регистр.Сотрудник = Справочник.Ссылка
	|ГДЕ
	|	Справочник.НомерМеста <> Регистр.НомерМеста
	|			ИЛИ Справочник.Офис <> Регистр.Офис
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистр.СотрудникСтрока";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	СчетчикОбновленных = 0;
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.СотрудникСтрока) Тогда
			ЗаписьЖР(СобытиеЖР, "Пропуск: пустое поле СотрудникСтрока для сотрудника: " + Строка(Выборка.Сотрудник));
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.ZUPC_НовыеCотрудники.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СотрудникСтрока.Установить(Выборка.СотрудникСтрока);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			ЗаписьЖР(СобытиеЖР, "Запись не найдена для сотрудника: " + Строка(Выборка.Сотрудник));
			Продолжить;
		КонецЕсли;
		ЗаписьЖурналаРегистрации(
		"ХД.ОбновитьМестаИОфисы",
		УровеньЖурналаРегистрации.Информация,
		,
		Выборка.Сотрудник,
		"Старый НомерМеста: " + Строка(Выборка.СтарыйНомерМеста)
		+ "; Старый Офис: " + Строка(Выборка.СтарыйОфис));
		ЗаписьРегистра = НаборЗаписей[0];
		ЗаписьРегистра.НомерМеста = Выборка.НовыйНомерМеста;
		ЗаписьРегистра.Офис = Выборка.НовыйОфис;
		НаборЗаписей.Записать(Истина);
		СчетчикОбновленных = СчетчикОбновленных + 1;
	КонецЦикла;
	Сообщить("Обновлено " + СчетчикОбновленных + " записей");
	ЗаписьЖР(СобытиеЖР, "Обновлено записей: " + СчетчикОбновленных);
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
КонецПроцедуры

#Область МониторингОшибокЖурналаРегистрации

// Проверяет журнал регистрации за период с последней обработки и отправляет найденные ошибки в eXpress.
// После успешного выполнения обновляет дату начала следующего мониторинга в дополнительной константе.
//
Процедура МониторингОшибокЖР() Экспорт
	СобытиеЖР = "ХД.ZUPC_МониторингОшибокЖР";
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	Попытка
		ДатаНачала = ПолучитьДатуНачалаМониторингаОшибокЖР();
		Если ДатаНачала = Неопределено Тогда
			ЗаписьЖР(СобытиеЖР, "Дата начала не задана в доп. константе. Выполнение пропущено.");
			Возврат;
		КонецЕсли;
		ДатаОкончания = ТекущаяДата();
		Если ДатаНачала >= ДатаОкончания Тогда
			ЗаписьЖР(СобытиеЖР, "Дата начала больше или равна текущей дате. Выполнение пропущено.");
			Возврат;
		КонецЕсли;
		ОшибкиЖР = ПолучитьОшибкиЖурналаРегистрации(ДатаНачала, ДатаОкончания);    
		Если ОшибкиЖР.Количество() = 0 Тогда
			Возврат;	
		КонецЕсли;
		Сообщения = СформироватьСообщенияМониторингаОшибокЖР(ДатаНачала, ДатаОкончания, ОшибкиЖР);
		Для Каждого Сообщение Из Сообщения Цикл
			ОповеститьExpress(Сообщение);
		КонецЦикла;
		УстановитьДатуНачалаМониторингаОшибокЖР(ДатаОкончания);
		ЗаписьЖР(СобытиеЖР, "Окончание обработки");
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖР(СобытиеЖР, ОписаниеОшибки, , Ложь, , УровеньЖурналаРегистрации.Предупреждение);
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьОшибкиЖурналаРегистрации(ДатаНачала, ДатаОкончания)
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", ДатаНачала);
	Отбор.Вставить("ДатаОкончания", ДатаОкончания);
	Отбор.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
	ОшибкиЖР = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(ОшибкиЖР, Отбор, "Уровень, Дата, Событие, Комментарий, ПредставлениеДанных");
	Возврат ОшибкиЖР;
КонецФункции

Функция СформироватьСообщенияМониторингаОшибокЖР(ДатаНачала, ДатаОкончания, ОшибкиЖР)
	Сообщения = Новый Массив;
	Заголовок = СтрШаблон("Период: %1 - %2. Найдено ошибок: %3",
		Формат(ДатаНачала, "ДЛФ=DT"),
		Формат(ДатаОкончания, "ДЛФ=DT"),
		ОшибкиЖР.Количество());
	ТекущееСообщение = Заголовок;
	КоличествоПримеров = ?(ОшибкиЖР.Количество() < 10, ОшибкиЖР.Количество(), 10);
	Для Индекс = 0 По КоличествоПримеров - 1 Цикл
		СтрокаОшибки = ОшибкиЖР[Индекс];
		ОписаниеОшибки = СформироватьСтрокуОшибкиМониторингаОшибокЖР(СтрокаОшибки, Заголовок);
		Если СтрДлина(ТекущееСообщение) + СтрДлина(Символы.ПС) + СтрДлина(ОписаниеОшибки) > ЛимитДлиныСообщенияМониторингаОшибокЖР() Тогда
			Сообщения.Добавить(ТекущееСообщение);
			ТекущееСообщение = Заголовок + Символы.ПС + ОписаниеОшибки;
		Иначе
			ТекущееСообщение = ТекущееСообщение + Символы.ПС + ОписаниеОшибки;
		КонецЕсли;
	КонецЦикла;
	Сообщения.Добавить(ТекущееСообщение);
	Возврат Сообщения;
КонецФункции

Функция СформироватьСтрокуОшибкиМониторингаОшибокЖР(СтрокаОшибки, Заголовок)
	ОписаниеОшибки = СтрШаблон("%1 | %2",
		Формат(СтрокаОшибки.Дата, "ДЛФ=DT"),
		Строка(СтрокаОшибки.Событие));
	Если ЗначениеЗаполнено(СтрокаОшибки.Комментарий) Тогда
		ОписаниеОшибки = СтрШаблон("%1 | %2", ОписаниеОшибки, Лев(Строка(СтрокаОшибки.Комментарий), 2500));
	КонецЕсли;
	ОписаниеОшибки = НормализоватьТекстСообщенияМониторингаОшибокЖР(ОписаниеОшибки);
	ДоступнаяДлина = ЛимитДлиныСообщенияМониторингаОшибокЖР() - СтрДлина(Заголовок) - СтрДлина(Символы.ПС);
	Возврат Лев(ОписаниеОшибки, ДоступнаяДлина);
КонецФункции

Функция ЛимитДлиныСообщенияМониторингаОшибокЖР()
	Возврат 4000;
КонецФункции

Функция НормализоватьТекстСообщенияМониторингаОшибокЖР(ТекстСообщения)
	Если ТекстСообщения = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Текст = Строка(ТекстСообщения);
	Текст = СтрЗаменить(Текст, Символы.ВК + Символы.ПС, Символы.ПС);
	Текст = СтрЗаменить(Текст, Символы.ВК, Символы.ПС);
	Текст = СтрЗаменить(Текст, Символы.Таб, " ");
	Текст = СтрЗаменить(Текст, Символ(160), " ");
	Возврат УдалитьУправляющиеСимволыМониторингаОшибокЖР(Текст);
КонецФункции

Функция УдалитьУправляющиеСимволыМониторингаОшибокЖР(Текст)
	Результат = "";
	Для Индекс = 1 По СтрДлина(Текст) Цикл
		КодСимволаТекста = КодСимвола(Текст, Индекс);
		Если КодСимволаТекста < 32 И КодСимволаТекста <> 10 Тогда
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(Текст, Индекс, 1);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьДатуНачалаМониторингаОшибокЖР()
	ИмяКонстанты = ИмяКонстантыДатыНачалаМониторингаОшибокЖР();
	ДатаНачала = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты(ИмяКонстанты, Ложь, Ложь);
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(ДатаНачала) <> Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ДатаНачала;
КонецФункции

Процедура УстановитьДатуНачалаМониторингаОшибокЖР(ДатаНачала)
	ИмяКонстанты = ИмяКонстантыДатыНачалаМониторингаОшибокЖР();
	УстановитьПривилегированныйРежим(Истина);
	КонстантаСсылка = Справочники.ДополнительныеКонстанты.НайтиПоНаименованию(ИмяКонстанты, Истина);
	Если КонстантаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	КонстантаОбъект = КонстантаСсылка.ПолучитьОбъект();
	КонстантаОбъект.Значения.Очистить();
	НоваяСтрока = КонстантаОбъект.Значения.Добавить();
	НоваяСтрока.Значение = ДатаНачала;
	КонстантаОбъект.Записать();
КонецПроцедуры

Функция ИмяКонстантыДатыНачалаМониторингаОшибокЖР()
	Возврат "ZUPC_МониторингОшибокЖР_ДатаНачала";
КонецФункции

#КонецОбласти

Функция ДатаВремяВUnix(ДатаВремя)
	ДатаUTC = УниверсальноеВремя(ДатаВремя);
	ДатаНачалаUnix = '19700101000000';  
	Возврат (ДатаUTC - ДатаНачалаUnix) * 1000;
КонецФункции

Процедура ОповеститьExpress(ТекстОповещения)   
	Если ПустаяСтрока(ТекстОповещения) Тогда
		Возврат;
	КонецЕсли;
	КлючОповещения = "МониторингЗУП";
	Попытка
		НастройкиОповещения = RSN_eXpress.НастройкиОповещенияExpress(КлючОповещения);
	Исключение
		ЗаписьЖурналаРегистрации(
			"Express.Notification",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка получения настроек eXpress: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Соединение = Новый HTTPСоединение(НастройкиОповещения.BaseURL, , , , , НастройкиОповещения.Timeout, Новый ЗащищенноеСоединениеOpenSSL());
	Попытка
		ТокенДоступа = RSN_eXpress.ТокенБота(Соединение, НастройкиОповещения);
		RSN_eXpress.ОтправитьСообщениеВExpress(Соединение, ТокенДоступа, НастройкиОповещения.IdЧата, ТекстОповещения, , НастройкиОповещения.BotID);
	Исключение
		ЗаписьЖурналаРегистрации(
			"Express.Notification",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка отправки сообщения в eXpress: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
КонецПроцедуры

#Область OfferSalary_УведомлениеОПовышенииЗПИзОффера

Процедура OfferSalary_УведомлениеОПовышенииЗПИзОффера()
	СобытиеЖР = "ХД.OfferSalary_УведомлениеОПовышенииЗПИзОффера";
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	СтрокаРегламентноеЗадание = "OfferSalary_УведомлениеОПовышенииЗПИзОффера";
	сРез = OfferSalary_ИнициализироватьТаблицуРезультата();
	OfferSalary_ЗаполнитьСотрудниковДляУведомления(СобытиеЖР, сРез);
	OfferSalary_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
КонецПроцедуры

Функция OfferSalary_ИнициализироватьТаблицуРезультата()
	сРез = Новый ТаблицаЗначений;
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	КвалификаторСтроки = Новый КвалификаторыСтроки(300, ДопустимаяДлина.Переменная);
	КвалификаторСуммы = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторИспСрока = Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный);
	сРез.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	сРез.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	сРез.Колонки.Добавить("СотрудникПредставление", Новый ОписаниеТипов("Строка",,,, КвалификаторСтроки));
	сРез.Колонки.Добавить("ДатаПриема", Новый ОписаниеТипов("Дата",,,,, КвалификаторДаты));
	сРез.Колонки.Добавить("ДатаУведомления", Новый ОписаниеТипов("Дата",,,,, КвалификаторДаты));
	сРез.Колонки.Добавить("ИспСрок", Новый ОписаниеТипов("Число",,, КвалификаторИспСрока));
	сРез.Колонки.Добавить("ДатаОкончанияИспытательногоСрока", Новый ОписаниеТипов("Дата",,,,, КвалификаторДаты));
	сРез.Колонки.Добавить("АктуальнаяСтрока", Новый ОписаниеТипов("Строка",,,, КвалификаторСтроки));
	сРез.Колонки.Добавить("ЗарплатаПослеИспСрока", Новый ОписаниеТипов("Число",,, КвалификаторСуммы));
	сРез.Колонки.Добавить("ЗарплатаЧерез6Мес", Новый ОписаниеТипов("Число",,, КвалификаторСуммы));
	сРез.Колонки.Добавить("ЗарплатаЧерез9Мес", Новый ОписаниеТипов("Число",,, КвалификаторСуммы));
	сРез.Колонки.Добавить("ЗарплатаЧерезГод", Новый ОписаниеТипов("Число",,, КвалификаторСуммы));
	Возврат сРез;
КонецФункции

Процедура OfferSalary_ЗаполнитьСотрудниковДляУведомления(Знач СобытиеЖР, сРез)
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.ОкончаниеПериода = ТекущаяДатаСеанса();
	ПараметрыПолучения.КадровыеДанные = "Организация,ФИОПолные,ДатаПриема,ИспытательныйСрокДатаЗавершения,ДатаУвольнения";
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыПолучения); 
	НапоминатьЗа = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Probation_НапомнитьОПовышенииЗарплатыИзОффера"); 
	ПроверяемаяДата = НачалоДня(ТекущаяДатаСеанса()) + (НапоминатьЗа * 86400); 
	ЗаписьЖР(СобытиеЖР, СтрШаблон("Проверяемая дата: %1", Формат(ПроверяемаяДата, "ДФ=dd.MM.yyyy")));
	Для каждого ДанныеСотрудника Из ТаблицаСотрудников Цикл
		Если ЗначениеЗаполнено(ДанныеСотрудника.ДатаУвольнения) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеСотрудника.ДатаПриема) Тогда
			Продолжить;
		КонецЕсли;
		Сотрудник = ДанныеСотрудника.Сотрудник;
		Если ЗначениеЗаполнено(Сотрудник.ЗарплатаПослеИспСрока)
			И ЗначениеЗаполнено(ДанныеСотрудника.ИспытательныйСрокДатаЗавершения)
			И НачалоДня(ДанныеСотрудника.ИспытательныйСрокДатаЗавершения) = ПроверяемаяДата Тогда
			OfferSalary_ДобавитьСтрокуРезультата(сРез, ДанныеСотрудника, "Salary after probation", ДанныеСотрудника.ИспытательныйСрокДатаЗавершения);
		КонецЕсли;
		Если ЗначениеЗаполнено(Сотрудник.ЗарплатаЧерез6Мес) И НачалоДня(ДобавитьМесяц(ДанныеСотрудника.ДатаПриема, 6)) = ПроверяемаяДата Тогда
			OfferSalary_ДобавитьСтрокуРезультата(сРез, ДанныеСотрудника, "Salary after 6 months", ДобавитьМесяц(ДанныеСотрудника.ДатаПриема, 6));
		КонецЕсли;
		Если ЗначениеЗаполнено(Сотрудник.ЗарплатаЧерез9Мес) И НачалоДня(ДобавитьМесяц(ДанныеСотрудника.ДатаПриема, 9)) = ПроверяемаяДата Тогда
			OfferSalary_ДобавитьСтрокуРезультата(сРез, ДанныеСотрудника, "Salary after 9 months", ДобавитьМесяц(ДанныеСотрудника.ДатаПриема, 9));
		КонецЕсли;
		Если ЗначениеЗаполнено(Сотрудник.ЗарплатаЧерезГод) И НачалоДня(ДобавитьМесяц(ДанныеСотрудника.ДатаПриема, 12)) = ПроверяемаяДата Тогда
			OfferSalary_ДобавитьСтрокуРезультата(сРез, ДанныеСотрудника, "Salary after 1 year", ДобавитьМесяц(ДанныеСотрудника.ДатаПриема, 12));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура OfferSalary_ДобавитьСтрокуРезультата(сРез, Знач ДанныеСотрудника, Знач АктуальнаяСтрока, Знач ДатаУведомления)
	Сотрудник = ДанныеСотрудника.Сотрудник;
	СтрокаРезультата = сРез.Добавить();
	СтрокаРезультата.Организация = ДанныеСотрудника.Организация;
	СтрокаРезультата.Сотрудник = Сотрудник;
	СтрокаРезультата.СотрудникПредставление = ДанныеСотрудника.ФИОПолные;
	СтрокаРезультата.ДатаПриема = ДанныеСотрудника.ДатаПриема;
	СтрокаРезультата.ДатаУведомления = ДатаУведомления;
	Если ЗначениеЗаполнено(ДанныеСотрудника.ИспытательныйСрокДатаЗавершения) Тогда
		СтрокаРезультата.ИспСрок = РазницаДатВМесяцах(ДанныеСотрудника.ДатаПриема, ДанныеСотрудника.ИспытательныйСрокДатаЗавершения);
		СтрокаРезультата.ДатаОкончанияИспытательногоСрока = ДанныеСотрудника.ИспытательныйСрокДатаЗавершения;
	КонецЕсли;
	СтрокаРезультата.АктуальнаяСтрока = АктуальнаяСтрока;
	СтрокаРезультата.ЗарплатаПослеИспСрока = Сотрудник.ЗарплатаПослеИспСрока;
	СтрокаРезультата.ЗарплатаЧерез6Мес = Сотрудник.ЗарплатаЧерез6Мес;
	СтрокаРезультата.ЗарплатаЧерез9Мес = Сотрудник.ЗарплатаЧерез9Мес;
	СтрокаРезультата.ЗарплатаЧерезГод = Сотрудник.ЗарплатаЧерезГод;
КонецПроцедуры

Функция OfferSalary_ТекстПисьма(Знач СобытиеЖР, сРез)
	Макет = ПолучитьМакет("ХД_ПовышениеЗПИзОффера_HTML");
	ТекстHTML = Макет.ПолучитьТекст();
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Описание}", "Salary increases from offer for the following employees:");
	ТекстHTML = OfferSalary_ЗаполнитьКарточкиПисьма(ТекстHTML, сРез);
	Возврат ТекстHTML;
КонецФункции

Функция OfferSalary_ЗаполнитьКарточкиПисьма(Знач ТекстHTML, Знач сРез)
	ШаблонКарточки = OfferSalary_ШаблонКарточкиHTML(ТекстHTML);
	Если ПустаяСтрока(ШаблонКарточки) Тогда
		Возврат ТекстHTML;
	КонецЕсли;
	ТекстКарточек = "";
	Для каждого СтрокаРезультата Из сРез Цикл
		ТекстКарточек = ТекстКарточек + ?(ПустаяСтрока(ТекстКарточек), "", "<br/>") + OfferSalary_КарточкаПисьма(ШаблонКарточки, СтрокаРезультата);
	КонецЦикла;
	Возврат СтрЗаменить(ТекстHTML, ШаблонКарточки, ТекстКарточек);
КонецФункции

Функция OfferSalary_ШаблонКарточкиHTML(Знач ТекстHTML)
	НачалоКарточки = СтрНайти(ТекстHTML, "<table border=""1"" cellpadding=""10px"">");
	Если НачалоКарточки = 0 Тогда
		Возврат "";
	КонецЕсли;
	ТекстПослеНачала = Сред(ТекстHTML, НачалоКарточки);
	КонецКарточки = СтрНайти(ТекстПослеНачала, "</table>");
	Если КонецКарточки = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат Сред(ТекстПослеНачала, 1, КонецКарточки + СтрДлина("</table>") - 1);
КонецФункции

Функция OfferSalary_КарточкаПисьма(Знач ШаблонКарточки, Знач СтрокаРезультата)
	КарточкаHTML = ШаблонКарточки;
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{Сотрудник}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.СотрудникПредставление));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{ДатаПриема}", УведомленияИзОффераДатаHTML(СтрокаРезультата.ДатаПриема));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{ИспСрок}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.ИспСрок));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{ДатаОкончанияИспытательногоСрока}", УведомленияИзОффераДатаHTML(СтрокаРезультата.ДатаОкончанияИспытательногоСрока));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{Организация}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.Организация));
	КарточкаHTML = OfferSalary_ЗаполнитьСтрокуЗарплаты(КарточкаHTML, СтрокаРезультата, "Salary after probation", "Зарплата после испытательного срока:", "{ЗарплатаПослеИспСрока}", СтрокаРезультата.ЗарплатаПослеИспСрока);
	КарточкаHTML = OfferSalary_ЗаполнитьСтрокуЗарплаты(КарточкаHTML, СтрокаРезультата, "Salary after 6 months", "Зарплата через 6 мес:", "{ЗарплатаЧерез6Мес}", СтрокаРезультата.ЗарплатаЧерез6Мес);
	КарточкаHTML = OfferSalary_ЗаполнитьСтрокуЗарплаты(КарточкаHTML, СтрокаРезультата, "Salary after 9 months", "Зарплата через 9 мес:", "{ЗарплатаЧерез9Мес}", СтрокаРезультата.ЗарплатаЧерез9Мес);
	Возврат OfferSalary_ЗаполнитьСтрокуЗарплаты(КарточкаHTML, СтрокаРезультата, "Salary after 1 year", "Зарплата через год:", "{ЗарплатаЧерезГод}", СтрокаРезультата.ЗарплатаЧерезГод);
КонецФункции

Функция OfferSalary_ЗаполнитьСтрокуЗарплаты(Знач КарточкаHTML, Знач СтрокаРезультата, Знач АктуальнаяСтрока, Знач НаименованиеСтроки, Знач ПараметрСуммы, Знач Сумма)
	НаименованиеHTML = УведомленияИзОффераЗначениеHTML(НаименованиеСтроки);
	СуммаHTML = УведомленияИзОффераЗначениеHTML(Сумма);
	Если СтрокаРезультата.АктуальнаяСтрока = АктуальнаяСтрока Тогда
		НаименованиеHTML = СтрШаблон("<b>%1</b>", НаименованиеHTML);
		СуммаHTML = СтрШаблон("<b>%1</b>", СуммаHTML);
	КонецЕсли;
	КарточкаHTML = СтрЗаменить(КарточкаHTML, НаименованиеСтроки, НаименованиеHTML);
	Возврат СтрЗаменить(КарточкаHTML, ПараметрСуммы, СуммаHTML);
КонецФункции

Процедура OfferSalary_СозданиеЭлектронногоПисьмаИсходящего(Знач СобытиеЖР, сРез)
	Если сРез.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
	ПолучателиПисьма = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("OfferSalary_Рассылка_УведомлениеОПовышенииЗПИзОффера", Истина);
	ТекстHTML = OfferSalary_ТекстПисьма(СобытиеЖР, сРез);
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", "ZUP: Salary increase from offer notification");
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	ПараметрыПисьма.Вставить("Текст", ТекстHTML);
	ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПисьма.Вставить("ПолучателиПисьма", ПолучателиПисьма);
	УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
КонецПроцедуры

#КонецОбласти

#Область OfferPerformanceBonus_УведомлениеОБонусеИзОффера

Процедура OfferPerformanceBonus_УведомлениеОБонусеИзОффера()
	СобытиеЖР = "ХД.OfferPerformanceBonus_УведомлениеОБонусеИзОффера";
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	сРез = OfferPerformanceBonus_СотрудникиДляУведомления(СобытиеЖР);
	OfferPerformanceBonus_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
КонецПроцедуры

Функция OfferPerformanceBonus_СотрудникиДляУведомления(Знач СобытиеЖР)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.Текст = "ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Наименование КАК СотрудникПредставление,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_PerformanceBonusPerOffer КАК PerformanceBonus,
	|	ZUPC_PerformanceBonusNotificationDates.NotificationDate КАК NotificationDate
	|ИЗ
	|	Справочник.Сотрудники.ZUPC_PerformanceBonusNotificationDates КАК ZUPC_PerformanceBonusNotificationDates
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО ZUPC_PerformanceBonusNotificationDates.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ВЫРАЗИТЬ(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_PerformanceBonusPerOffer КАК СТРОКА(1024)) <> """"
	|	И ZUPC_PerformanceBonusNotificationDates.NotificationDate МЕЖДУ &НачалоДня И &КонецДня";
	сРез = Запрос.Выполнить().Выгрузить();
	ЗаписьЖР(СобытиеЖР, СтрШаблон("Сотрудников для уведомления: %1", сРез.Количество()));
	Возврат сРез;
КонецФункции

Функция OfferPerformanceBonus_ТекстПисьма(Знач СобытиеЖР, сРез)
	Макет = ПолучитьМакет("ХД_PerformanceBonusИзОффера_HTML");
	ТекстHTML = Макет.ПолучитьТекст();
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Описание}", "Performance bonus per offer notifications for the following employees:");
	ТекстHTML = OfferPerformanceBonus_ЗаполнитьКарточкиПисьма(ТекстHTML, сРез);
	Возврат ТекстHTML;
КонецФункции

Функция OfferPerformanceBonus_ЗаполнитьКарточкиПисьма(Знач ТекстHTML, Знач сРез)
	ШаблонКарточки = OfferPerformanceBonus_ШаблонКарточкиHTML(ТекстHTML);
	Если ПустаяСтрока(ШаблонКарточки) Тогда
		Возврат ТекстHTML;
	КонецЕсли;
	ТекстКарточек = "";
	Для каждого СтрокаРезультата Из сРез Цикл
		ТекстКарточек = ТекстКарточек + ?(ПустаяСтрока(ТекстКарточек), "", "<br/>") + OfferPerformanceBonus_КарточкаПисьма(ШаблонКарточки, СтрокаРезультата);
	КонецЦикла;
	Возврат СтрЗаменить(ТекстHTML, ШаблонКарточки, ТекстКарточек);
КонецФункции

Функция OfferPerformanceBonus_ШаблонКарточкиHTML(Знач ТекстHTML)
	НачалоКарточки = СтрНайти(ТекстHTML, "<table border=""1"" cellpadding=""10px"">");
	Если НачалоКарточки = 0 Тогда
		Возврат "";
	КонецЕсли;
	ТекстПослеНачала = Сред(ТекстHTML, НачалоКарточки);
	КонецКарточки = СтрНайти(ТекстПослеНачала, "</table>");
	Если КонецКарточки = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат Сред(ТекстПослеНачала, 1, КонецКарточки + СтрДлина("</table>") - 1);
КонецФункции

Функция OfferPerformanceBonus_КарточкаПисьма(Знач ШаблонКарточки, Знач СтрокаРезультата)
	КарточкаHTML = ШаблонКарточки;
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{Сотрудник}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.СотрудникПредставление));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{PerformanceBonus}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.PerformanceBonus));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{ДатаПриема}", УведомленияИзОффераДатаHTML(СтрокаРезультата.ДатаПриема));
	Возврат СтрЗаменить(КарточкаHTML, "{Организация}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.Организация));
КонецФункции

Процедура OfferPerformanceBonus_СозданиеЭлектронногоПисьмаИсходящего(Знач СобытиеЖР, сРез)
	Если сРез.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
	ПолучателиПисьма = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("OfferPerformanceBonus_Рассылка_УведомлениеОБонусеИзОффера", Истина);
	ТекстHTML = OfferPerformanceBonus_ТекстПисьма(СобытиеЖР, сРез);
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", "ZUP: Performance bonus per offer notification");
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	ПараметрыПисьма.Вставить("Текст", ТекстHTML);
	ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПисьма.Вставить("ПолучателиПисьма", ПолучателиПисьма);
	УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
КонецПроцедуры

#КонецОбласти

#Область OfferSignOnBonus_УведомлениеОБонусеИзОффера

Процедура OfferSignOnBonus_УведомлениеОБонусеИзОффера()
	СобытиеЖР = "ХД.OfferSignOnBonus_УведомлениеОБонусеИзОффера";
	ЗаписьЖР(СобытиеЖР, "Начало обработки");
	сРез = OfferSignOnBonus_СотрудникиДляУведомления(СобытиеЖР);
	OfferSignOnBonus_СозданиеЭлектронногоПисьмаИсходящего(СобытиеЖР, сРез);
	ЗаписьЖР(СобытиеЖР, "Окончание обработки");
КонецПроцедуры

Функция OfferSignOnBonus_СотрудникиДляУведомления(Знач СобытиеЖР)
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.Текст = "ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Наименование КАК СотрудникПредставление,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК Организация,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_SignOnBonus КАК SignOnBonus
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ВЫРАЗИТЬ(ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_SignOnBonus КАК СТРОКА(1024)) <> """"
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник.ZUPC_SignOnBonusNotificationSentDate МЕЖДУ &НачалоДня И &КонецДня";
	сРез = Запрос.Выполнить().Выгрузить();
	ЗаписьЖР(СобытиеЖР, СтрШаблон("Сотрудников для уведомления: %1", сРез.Количество()));
	Возврат сРез;
КонецФункции

Функция OfferSignOnBonus_ТекстПисьма(Знач СобытиеЖР, сРез)
	Макет = ПолучитьМакет("ХД_SignOnBonusИзОффера_HTML");
	ТекстHTML = Макет.ПолучитьТекст();
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Описание}", "Sign-on bonus per offer notifications for the following employees:");
	ТекстHTML = OfferSignOnBonus_ЗаполнитьКарточкиПисьма(ТекстHTML, сРез);
	Возврат ТекстHTML;
КонецФункции

Функция OfferSignOnBonus_ЗаполнитьКарточкиПисьма(Знач ТекстHTML, Знач сРез)
	ШаблонКарточки = OfferSignOnBonus_ШаблонКарточкиHTML(ТекстHTML);
	Если ПустаяСтрока(ШаблонКарточки) Тогда
		Возврат ТекстHTML;
	КонецЕсли;
	ТекстКарточек = "";
	Для каждого СтрокаРезультата Из сРез Цикл
		ТекстКарточек = ТекстКарточек + ?(ПустаяСтрока(ТекстКарточек), "", "<br/>") + OfferSignOnBonus_КарточкаПисьма(ШаблонКарточки, СтрокаРезультата);
	КонецЦикла;
	Возврат СтрЗаменить(ТекстHTML, ШаблонКарточки, ТекстКарточек);
КонецФункции

Функция OfferSignOnBonus_ШаблонКарточкиHTML(Знач ТекстHTML)
	НачалоКарточки = СтрНайти(ТекстHTML, "<table border=""1"" cellpadding=""10px"">");
	Если НачалоКарточки = 0 Тогда
		Возврат "";
	КонецЕсли;
	ТекстПослеНачала = Сред(ТекстHTML, НачалоКарточки);
	КонецКарточки = СтрНайти(ТекстПослеНачала, "</table>");
	Если КонецКарточки = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат Сред(ТекстПослеНачала, 1, КонецКарточки + СтрДлина("</table>") - 1);
КонецФункции

Функция OfferSignOnBonus_КарточкаПисьма(Знач ШаблонКарточки, Знач СтрокаРезультата)
	КарточкаHTML = ШаблонКарточки;
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{Сотрудник}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.СотрудникПредставление));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{SignOnBonus}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.SignOnBonus));
	КарточкаHTML = СтрЗаменить(КарточкаHTML, "{ДатаПриема}", УведомленияИзОффераДатаHTML(СтрокаРезультата.ДатаПриема));
	Возврат СтрЗаменить(КарточкаHTML, "{Организация}", УведомленияИзОффераЗначениеHTML(СтрокаРезультата.Организация));
КонецФункции

Процедура OfferSignOnBonus_СозданиеЭлектронногоПисьмаИсходящего(Знач СобытиеЖР, сРез)
	Если сРез.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ДатаОтправки = ТекущаяДатаСеанса();
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
	ПолучателиПисьма = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("OfferSignOnBonus_Рассылка_УведомлениеОБонусеИзОффера", Истина);
	ТекстHTML = OfferSignOnBonus_ТекстПисьма(СобытиеЖР, сРез);
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", "ZUP: Sign-on bonus per offer notification");
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	ПараметрыПисьма.Вставить("Текст", ТекстHTML);
	ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПисьма.Вставить("ПолучателиПисьма", ПолучателиПисьма);
	УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);
КонецПроцедуры

#КонецОбласти 

#Область ОбщиеФункцииДляУведомленийИзОффера 

Функция УведомленияИзОффераДатаHTML(Знач Дата)
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	Возврат Формат(Дата, "ДФ=dd.MM.yyyy");
КонецФункции

Функция УведомленияИзОффераЗначениеHTML(Знач Значение)
	Текст = Строка(Значение);
	Текст = СтрЗаменить(Текст, "&", "&amp;");
	Текст = СтрЗаменить(Текст, "<", "&lt;");
	Текст = СтрЗаменить(Текст, ">", "&gt;");
	Текст = СтрЗаменить(Текст, Символы.ВК + Символы.ПС, "<br/>");
	Текст = СтрЗаменить(Текст, Символы.ПС, "<br/>");
	Возврат СтрЗаменить(Текст, Символы.ВК, "<br/>");
КонецФункции     

#КонецОбласти