// +SERG ^_^h
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздатьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормы()
	СоздатьЭлементыУведомлениеДниОтпуска();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыУведомлениеДниОтпуска()
	НоваяКоманда = Команды.Добавить("УведомитьДниОтпуска");
	НоваяКоманда.Заголовок = "Уведомление дни отпуска";
	НоваяКоманда.Действие = "УведомитьДниОтпуска";
	НовыйЭлемент = Элементы.Добавить("КнопкаУведомитьДниОтпуска", Тип("КнопкаФормы"), Элементы.Уведолмения);
	НовыйЭлемент.Заголовок = "Уведомление дни отпуска";
	НовыйЭлемент.ИмяКоманды = "УведомитьДниОтпуска";
КонецПроцедуры

&НаКлиенте
Процедура УведомитьДниОтпуска(Команда)
	ВыполнитьКомандуНаСервере("УведомитьДниОтпуска");
КонецПроцедуры


&НаСервере
Процедура ВыполнитьРассылкуПоБазеКлиентовНаСервере()
	ВыполнитьКомандуНаСервере("CRM_C_ВыполнитьРассылкуПоБазеКлиентов");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРассылкуПоБазеКлиентов(Команда)
	ВыполнитьРассылкуПоБазеКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ИдентификаторКоманды)
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ЭтаОбработка.ВыполнитьКоманду(ИдентификаторКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаБазыКлиентовНаСервере()
	ВыполнитьКомандуНаСервере("CRM_C_ЗагрузкаБазыКлиентов");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаБазыКлиентов(Команда)
	ЗагрузкаБазыКлиентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаБазыКлиентовЖурнал(Команда)
	ОткрытьЖР("ХД.ЗагрузкаБазыКлиентов");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРассылкуПоБазеКлиентовЖурнал(Команда)
	ОткрытьЖР("ХД.CRM_C_ВыполнитьРассылкуПоБазеКлиентов");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖР(СобытиеЖурналаРегистрации)
	
	Отбор = Новый Структура;
	Отбор.Вставить("СобытиеЖурналаРегистрации", СобытиеЖурналаРегистрации);
	Отбор.Вставить("ДатаНачала",                НачалоДня(ТекущаяДата()));
	Отбор.Вставить("ДатаОкончания",             ТекущаяДата());
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", Отбор, ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузкаБазыКлиентовSelecomНаСервере()
	ВыполнитьКомандуНаСервере("CRM_C_ЗагрузкаБазыКлиентовSelecom");
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаБазыКлиентовSelecom(Команда)
	ЗагрузкаБазыКлиентовSelecomНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузкаНомеровИнвойсовСервере()
	 ВыполнитьКомандуНаСервере("ASPECT_ЗагрузкаНомеровИнвойсов");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНомеровИнвойсов(Команда)
         ЗагрузкаНомеровИнвойсовСервере()
КонецПроцедуры 


&НаСервере
Процедура УведомлениеОНовомСотрудникеНаСервере()
	   ВыполнитьКомандуНаСервере("Zoho_УведомлениеОНовомСотруднике");
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОНовомСотруднике(Команда)
         УведомлениеОНовомСотрудникеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоHTMLНаСервере()
	 ВыполнитьКомандуНаСервере("ОтправитьПисьмоHTML");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоHTML(Команда)
	ОтправитьПисьмоHTMLНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВНовыхСотрудникахОфисиМестоНаСервере()
	ВыполнитьКомандуНаСервере("ЗаполнитьВНовыхСотрудникахОфисиМесто");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВНовыхСотрудникахОфисиМесто(Команда)
	ЗаполнитьВНовыхСотрудникахОфисиМестоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьМестаИОфисыНаСервере()
	ВыполнитьКомандуНаСервере("ОбновитьМестаИОфисы");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМестаИОфисы(Команда)
	ОбновитьМестаИОфисыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМестаИОфисыЖурнал(Команда)
	ОткрытьЖР("ХД.ОбновитьМестаИОфисы");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУведомлениеОСтатусеОбменаНаСервере()
	ВыполнитьКомандуНаСервере("ВыполнитьУведомлениеОСтатусеОбмена");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУведомлениеОСтатусеОбмена(Команда)
	ВыполнитьУведомлениеОСтатусеОбменаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаДоменнойИнформацииНаСервере()
	ВыполнитьКомандуНаСервере("ЗагрузкаУчетнойИнофрмацииПользователя");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДоменнойИнформации(Команда)
	ЗагрузкаДоменнойИнформацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомлениеОДнеРожденияСотрудниковНаСервере()
	ВыполнитьКомандуНаСервере("BirthDay_НапомнитьОДняхРожденияхСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОДнеРожденияСотрудников(Команда)
	УведомлениеОДнеРожденияСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнформацияОСостоянииСинхронизацииУтромНаСервере()
	ВыполнитьКомандуНаСервере("Sync_ИнформацияОСостоянииСинхронизацийУтром");
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОСостоянииСинхронизацииУтром(Команда)
	ИнформацияОСостоянииСинхронизацииУтромНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнформацияОСостоянииСинхронизацииКаждыйЧасНаСервере()
	 ВыполнитьКомандуНаСервере("Sync_ИнформацияОСостоянииСинхронизацийКаждыйЧас");
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОСостоянииСинхронизацииКаждыйЧас(Команда)
	ИнформацияОСостоянииСинхронизацииКаждыйЧасНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписьЗарплатыNetЕжедневноНаСервере()
	 ВыполнитьКомандуНаСервере("ЗаписьЗарплатыNetЕжедневно");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьЗарплатыNetЕжедневно(Команда)
	ЗаписьЗарплатыNetЕжедневноНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациювSDНаСервере()
	ВыполнитьКомандуНаСервере("ОбновитьИнформациювSD");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациювSD(Команда)
	ОбновитьИнформациювSDНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпеллингуСотрудниковНаСервере()
	   ВыполнитьКомандуНаСервере("ЗаполнитьСпеллингуСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпеллингуСотрудников(Команда)
	//ЗаполнитьСпеллингуСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполняемФизЛицоИзСотрудниковНаСервере()
	 ВыполнитьКомандуНаСервере("ЗаполняемФизЛицоИзСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняемФизЛицоИзСотрудников(Команда)
	//ЗаполняемФизЛицоИзСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеренестиБонусыНаСервере()
	 ВыполнитьКомандуНаСервере("ПеренестиБонусы");
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиБонусы(Команда)
	ПеренестиБонусыНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомлениеОбОкончанииИспСрокаНаСервере()
		 ВыполнитьКомандуНаСервере("Probation_УведомлениеОбОкончанииИспытательногоСрока");
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОбОкончанииИспСрока(Команда)
	УведомлениеОбОкончанииИспСрокаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомлениеОПовышенииЗПИзОффераНаСервере()
	ВыполнитьКомандуНаСервере("OfferSalary_УведомлениеОПовышенииЗПИзОффера");
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОПовышенииЗПИзОффера(Команда)
	УведомлениеОПовышенииЗПИзОффераНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомлениеOPerformanceBonusИзОффераНаСервере()
	ВыполнитьКомандуНаСервере("OfferPerformanceBonus_УведомлениеОБонусеИзОффера");
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеOPerformanceBonusИзОффера(Команда)
	УведомлениеOPerformanceBonusИзОффераНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомлениеOSignOnBonusИзОффераНаСервере()
	ВыполнитьКомандуНаСервере("OfferSignOnBonus_УведомлениеОБонусеИзОффера");
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеOSignOnBonusИзОффера(Команда)
	УведомлениеOSignOnBonusИзОффераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛокациювДолжностиНаСервере()
	 ВыполнитьКомандуНаСервере("ЗаполнитьЛокациювДолжности");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЛокациювДолжности(Команда)
	ЗаполнитьЛокациювДолжностиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьизЭксельТелефоныНаСервере()
	ВыполнитьКомандуНаСервере("ЗагрузитьизЭксельТелефоны");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьизЭксельТелефоны(Команда)
	ЗагрузитьизЭксельТелефоныНаСервере();
КонецПроцедуры

&НаСервере
Процедура HREstablishmentExcelНаСервере()
	ВыполнитьКомандуНаСервере("HREstablishmentExcel");
КонецПроцедуры

&НаКлиенте
Процедура HREstablishmentExcel(Команда)
	HREstablishmentExcelНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьHRИзменениеЗПНДФЛНаСервере()
	ВыполнитьКомандуНаСервере("ОтправитьHRИзменениеЗПНДФЛ");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьHRИзменениеЗПНДФЛ(Команда)
	ОтправитьHRИзменениеЗПНДФЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТелефоныИзSDНаСервере()
	ВыполнитьКомандуНаСервере("ПолучитьТелефоныИзSD");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТелефоныИзSD(Команда)
	ПолучитьТелефоныИзSDНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыровнятьМаскуТелефоновНаСервере()
	ВыполнитьКомандуНаСервере("ВыровнятьМаскуТелефонов");
КонецПроцедуры

&НаКлиенте
Процедура ВыровнятьМаскуТелефонов(Команда)
	ВыровнятьМаскуТелефоновНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаМонитораОбменаДаннымиНаСервере()
	ВыполнитьКомандуНаСервере("ПосмотретьТаблицаМонитораОбменаДанными");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМонитораОбменаДанными(Команда)
	ТаблицаМонитораОбменаДаннымиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьIDИзSDНаСервере()
	ВыполнитьКомандуНаСервере("ПолучитьIDИзSD");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьIDИзSD(Команда)
	ПолучитьIDИзSDНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПодставлениеФизЛицаВУчетнойИнформацииНаСервере()
	ВыполнитьКомандуНаСервере("ВыполнитьПодставлениеФизЛицаВУчетнойИнформации");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодставлениеФизЛицаВУчетнойИнформации(Команда)
	ВыполнитьПодставлениеФизЛицаВУчетнойИнформацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФизЛицоПоИмениВУчИнфНаСервере()
	ВыполнитьКомандуНаСервере("ЗаполнитьФизЛицоПоИмениВУчИнф");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФизЛицоПоИмениВУчИнф(Команда)
	ЗаполнитьФизЛицоПоИмениВУчИнфНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуДанныхНаСервере()
	ВыполнитьКомандуНаСервере("ВыполнитьСверкуДанных");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуДанных(Команда)
	ВыполнитьСверкуДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуУправленческойШтаткиНаСервере()
	ВыполнитьКомандуНаСервере("ВыполнитьВыгрузкуУправленческойШтатки");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуУправленческойШтатки(Команда)
	ВыполнитьВыгрузкуУправленческойШтаткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуУправленческойШтаткиЖурнал(Команда)
	ОткрытьЖР("ХД.ВыполнитьВыгрузкуУправленческойШтатки");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуПосадкиСотрудниковНаСервере()
	ВыполнитьКомандуНаСервере("ВыполнитьВыгрузкуПосадкиСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуПосадкиСотрудников(Команда)
	ВыполнитьВыгрузкуПосадкиСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетныеДанныевРСУчетнаяИнформацияНаСервере()
	ВыполнитьКомандуНаСервере("ЗаполнитьУчетныеДанныевРСУчетнаяИнформация");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетныеДанныевРСУчетнаяИнформация(Команда)
	ЗаполнитьУчетныеДанныевРСУчетнаяИнформацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СравнитьТелефоныBBЭксельНаСервере()
	ВыполнитьКомандуНаСервере("СравнитьТелефоныBBЭксель");
КонецПроцедуры

&НаКлиенте
Процедура СравнитьТелефоныBBЭксель(Команда)
	СравнитьТелефоныBBЭксельНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовыхСотрудниковНаСервере()
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ЭтаОбработка.ЗаполнитьНовыхСотрудников(ОтборОрганизацияЗаполнениеСотрудников);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНовыхСотрудников(Команда)
	ЗаполнитьНовыхСотрудниковНаСервере();
КонецПроцедуры


	 

